[
    {
        "id": "51388",
        "title": "LEG  Stretch  digital circus 3",
        "description": "LEG STRETCH CHALLENGE! The Amazing Digital Circus Stretch the goofy character to solve different puzzles in this funny online game. Use physics to your advantage as you stretch the main character to climb and reach the goal in each level. Keep stretching until you solve all of the different puzzles.",
        "instructions": "hand and mouse",
        "url": "https://html5.gamemonetize.com/4tdbououp3ukjjse99g1uchooauf91uu/",
        "category": "Boys",
        "tags": "Adventure, Batman, Monkey",
        "thumb": "https://img.gamemonetize.com/4tdbououp3ukjjse99g1uchooauf91uu/512x384.jpg",
        "width": "600",
        "height": "800"
    },
    {
        "id": "51503",
        "title": "Oil Tanker Truck Transport",
        "description": "Driving a monster truck is awesome and thrilling! You have to be careful with every operation! How about driving a truck on the cliff edge? In Oil Tanker Truck Transport you have to face this challenge! You are a truck driver, and you have to reach the finish line! Tough mountain roads and tight lanes are your challenges! Can you do this risky mission? Many truck types and levels are ready for you to beat! Play this game! Have fun!",
        "instructions": "Touch and drag move",
        "url": "https://html5.gamemonetize.com/8a8zdsgou4lwpsx4b2cgpfios6h8p0q3/",
        "category": "Boys",
        "tags": "3D, Boys, Car, Girls, Kids, monstertruck, Truck",
        "thumb": "https://img.gamemonetize.com/8a8zdsgou4lwpsx4b2cgpfios6h8p0q3/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "51354",
        "title": "Call to Lethal Company",
        "description": "The Lethal Company urgently needs interns! Urgently call the employees of the company and not only to find out what it is like to work in a Lethal Company!!",
        "instructions": "Control 1 You need to select from the list who you want to call 2 Once selected the call will begin immediately 3 Press the red handset button to end the call 4 Scroll through contacts using the mouse wheel on a computer or swipe on a phone ",
        "url": "https://html5.gamemonetize.com/rtf7e669gd9ccw1tkcjncyb4vmmlbs21/",
        "category": "Boys",
        "tags": "Funny, Relaxation, Simulation, Simulator, Space, unity, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/rtf7e669gd9ccw1tkcjncyb4vmmlbs21/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51222",
        "title": "Boogers",
        "description": "The time has come to put everything in its place and please your friend with attention. Boogers is a new hit for practical use: you open the application, turn on the search for a potential place of snot attraction and watch the screen. Just a couple of moments and you will leave your mark where it is needed. Dont waste the moment.",
        "instructions": "The Boogers app will help you find a place to stick a booger 1 Find the booger 2 Click start 3 We walk and look for the place where the booger detector points 4 Once a place is found we make a booger Good luck in your search ",
        "url": "https://html5.gamemonetize.com/mdu5ueiwl6rjkw725980ug2kap3sraa4/",
        "category": "Boys",
        "tags": "Boys, Interactive, Relaxation, School, Unity3D",
        "thumb": "https://img.gamemonetize.com/mdu5ueiwl6rjkw725980ug2kap3sraa4/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51168",
        "title": "Police Car Line Driving",
        "description": "Police Car Line Driving is a cool and addictive 3D car-avoiding arcade game. You have to chase unauthorized vehicles and drive as far as you can for higher score records. Each vehicle will give you an extra 100 scores right away. You have to dodge the bombs, other vehicles will do the same. If you hit them, you will lose the game immediately. Your current score and best score will be shown on the settlement page. If you want to improve your current score, you can restart and try again.",
        "instructions": "On PC and Mobile Tap and swipe move the police car ",
        "url": "https://html5.gamemonetize.com/njabpms143vcnswvfgx72emtf7x89t0h/",
        "category": "Boys",
        "tags": "3D, Avoid, Bomb, Boys, Car, Kids, Platform, Police, Racing, Stunts",
        "thumb": "https://img.gamemonetize.com/njabpms143vcnswvfgx72emtf7x89t0h/512x384.jpg",
        "width": "750",
        "height": "1624"
    },
    {
        "id": "50977",
        "title": "Village Farm Life",
        "description": "Farm Life is a game that simulate tasks of farmers who work on a big farm. With farm Life, Players are transformed into farmers do everything from planting and tending crops until harvest, hand-picking and buy breeding animals and care until maturity; experienced simultaneously, manually what makes the food manufacturing and food from agricultural products harvested in the animal feed crops. This brings the extremely interesting and attractive experiences. Are you ready to play and build their own farm in this game? Website Developer <a href='https://www.gamesmunch.com/'>https://www.gamesmunch.com/</a>",
        "instructions": "use the mouse to play this game",
        "url": "https://html5.gamemonetize.com/fwbro63nct7si1iia09e0gn8el6ee8xh/",
        "category": "Boys",
        "tags": "1 Player, Farm",
        "thumb": "https://img.gamemonetize.com/fwbro63nct7si1iia09e0gn8el6ee8xh/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "50972",
        "title": "MagicTower",
        "description": "It is said that the queen is a powerful sorceress, and the princess sisters have been captured by the queen. Hero, you must hurry to rescue the princesses!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/86s69hjykukvfzw769mjgg2da7uurpfl/",
        "category": "Boys",
        "tags": "1 Player, 2D, Adventure, RPG",
        "thumb": "https://img.gamemonetize.com/86s69hjykukvfzw769mjgg2da7uurpfl/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51041",
        "title": "Car Rush Fast Game",
        "description": "Buckle up and get ready for the high-octane thrill ride of Car Rush Game! Hit the pedal and race through a winding urban landscape, dodging traffic, and overcoming obstacles. Show off your lightning-fast reflexes and keen driving skills as you strive to reach the finish line first. Get ready for the ultimate adrenaline rush in this pulse-pounding racing experience!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/o3qz5blqw700khul2j2d6vm2d1nlhb3u/",
        "category": "Boys",
        "tags": "Boys, Car, car tuning, free html5 games for your website, html games for your website, HTML5, html5 games",
        "thumb": "https://img.gamemonetize.com/o3qz5blqw700khul2j2d6vm2d1nlhb3u/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48972",
        "title": "Excavator Simulator 3D",
        "description": "Drive and operate realistic 3D construction vehicles in Excavator Simulator 3D, the best engineer vehicle JCB simulation game. You can choose from different trucks, excavators, and Pincer Jaws to complete various missions and tasks. Whether you need to dig, clamp, lift, hammer, or forklift, you can switch the attachments easily and quickly. Learn how to control these powerful machines and enjoy the realistic physics and graphics. Complete the levels faster and earn more money to buy more vehicles and unlock new challenges. Have fun!",
        "instructions": "On PC W - Gas S - Brake or Backward A - Turn left D - Turn right Left wheel - rotate mechanic arm Right wheel - accelerate mechanic arm On Mobile Hold Arrows - steering Hold pedals - drive forward or back Swipe wheels - accelerate ",
        "url": "https://html5.gamemonetize.com/7wov98mycit3fq1iqlxn1dxs020z4qnz/",
        "category": "Boys",
        "tags": "Boys, Car, Driving, Kids, Simulator",
        "thumb": "https://img.gamemonetize.com/7wov98mycit3fq1iqlxn1dxs020z4qnz/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "50811",
        "title": "Real JCB Excavator Simulator",
        "description": "Excavator Crane Driving Sim is a realistic and fun 3D cartoon construction vehicle driving simulation game. You can drive and operate Excavators, Rollers, Shovels, Forklifts, and Trucks in 4 stages of levels. You can earn coins and buy more skins or customize your vehicles in DIY mode. You can also watch ads to get more coins easily. You don&rsquo;t have to worry about time or scores, just follow the green arrows and complete all construction levels!",
        "instructions": "On PC WASD or Arrow keys - move QE - rotate the mechanic arm R rise or lay down the arm T grab bucket On Mobile Press and hold the buttons Click on the slider customize the color scheme",
        "url": "https://html5.gamemonetize.com/lrhrhwj6zkb8o1drgkszffgv1z8k94ra/",
        "category": "Boys",
        "tags": "3D, Boys, Car, Casual, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/lrhrhwj6zkb8o1drgkszffgv1z8k94ra/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "50942",
        "title": "Alvin Super Hero",
        "description": "Join the, Alvin Super Hero , in an action-packed superhero training game. Theodore has created a high-speed Superboard, and now its time to see who deserves it in a neighborhood race. If youve played Temple Run before , youll be familiar with the gameplay &ndash; navigate a randomly generated obstacle course through the streets, collect coins, and run as far as you can. But watch out for obstacles; one collision ends the race. Test your skills in this thrilling Super Hero adventure!",
        "instructions": "- desktop Avoid the obstacles Use the arrow keys to steer left and right - mobile Avoid the obstacles Swipe left or right to control - desktop Use the arrow keys to jump or duck - mobile Swipe up or down to jump or crouch ",
        "url": "https://html5.gamemonetize.com/d0fxy3q7cp54uq299iwx76xqywvtit1x/",
        "category": "Boys",
        "tags": "run, running, Skateboard, subway, Subway Surfers, Super, Superhero",
        "thumb": "https://img.gamemonetize.com/d0fxy3q7cp54uq299iwx76xqywvtit1x/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50743",
        "title": "Encanto Coloring Book",
        "description": "Encanto Coloring Book invites players into the vibrant and magical world inspired by the Disney animated film Encanto. This delightful coloring book game offers a creative and interactive experience for fans of all ages. Immerse yourself in the enchanting story of the Madrigal family, who live in a magical house in the mountains of Colombia. Website developer:",
        "instructions": "Use mouse to play Encanto Coloring Book online ",
        "url": "https://html5.gamemonetize.com/kmuxtlomy1qvavnvpiac46m367fl69mc/",
        "category": "Boys",
        "tags": "Android, Color, Coloring, Educational, HTML5, iPad, iPhone",
        "thumb": "https://img.gamemonetize.com/kmuxtlomy1qvavnvpiac46m367fl69mc/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50815",
        "title": "Craig of the Creek Learning the Body Online",
        "description": "Craig of the Creek Learning the Body Online is an engaging educational game that takes young players on an exciting journey to discover the mysteries of the human body. Embark on an adventure with Craig and his friends from the Creek as they explore the intricacies of anatomy through fun and interactive challenges. Website Developer <a href='https://www.games-kids.com'>https://www.games-kids.com</a>",
        "instructions": "Use mouse to playCraig of the Creek Learning The Body game online ",
        "url": "https://html5.gamemonetize.com/73ji3pqi1c0e4uki4badplna6vlph7p0/",
        "category": "Boys",
        "tags": "Educational, Quiz",
        "thumb": "https://img.gamemonetize.com/73ji3pqi1c0e4uki4badplna6vlph7p0/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50741",
        "title": "Ba Da Bean Coloring Book ",
        "description": "Ba Da Bean Coloring Book is an engaging and creative coloring experience designed for all ages. Dive into a world of whimsical illustrations featuring adorable characters, intricate patterns, and lively scenes. With a vibrant palette of colors at your fingertips, unleash your artistic expression and bring these captivating images to life.",
        "instructions": "Use mouse to play Ba Da Bean Coloring Book online ",
        "url": "https://html5.gamemonetize.com/eh6qu75skbbrbzlkl0wjijmz0krts3b6/",
        "category": "Boys",
        "tags": "Color, Coloring",
        "thumb": "https://img.gamemonetize.com/eh6qu75skbbrbzlkl0wjijmz0krts3b6/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50694",
        "title": "Dark War",
        "description": "Welcome to the world of adrenaline, magic and the fight against evil! an exciting role-playing game with a view from above, the action of which takes place in modern reality. In this game, you will be embodied in the role of a brave exorcist of an ancient order who devoted his life to fighting the forces of evil. Game Features: Diverse Weapons: Your fighting skills include not only swords, but also firearms. You also have magical abilities. Destroy the main bosses: epic battles with powerful demonic bosses are waiting for you. Develop a strategy and use your unique abilities to defeat evil.",
        "instructions": "You play as a member of the order of demon Hunters Your task is to find and destroy the gatekeeper demons There is a system of tasks with The game is adapted for mobile devices and a personal computer",
        "url": "https://html5.gamemonetize.com/henzg07w9l8dgdwrqsww9xydgpz2gpcs/",
        "category": "Boys",
        "tags": "Adventure, Best, Blood, Crazy, Defense, Wizard",
        "thumb": "https://img.gamemonetize.com/henzg07w9l8dgdwrqsww9xydgpz2gpcs/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "13532",
        "title": "Retro Street Fighter",
        "description": "Travel back in time with Retro Street Fighter, a side-scrolling fighting game that will make you feel nostalgic. This game features 2D-pixel art that gives it a classic look. You will fight your way through multiple levels, facing different enemies and showing off your skills. You can choose from seven levels of difficulty and challenge yourself. You will also have various moves to use in combat, such as punches, kicks, and blocks. But be careful, some enemies are tough and dangerous.",
        "instructions": "On PC Arrow keys move J punch I kick K jump L block On Mobile Drag the move wheel Tap the buttons to attack or defend ",
        "url": "https://html5.gamemonetize.com/jr7roso7r39aua71aijeuxoxlgluaqku/",
        "category": "Boys",
        "tags": "2D, Fighting, Pixel, Side Scrolling, Street Fighting",
        "thumb": "https://img.gamemonetize.com/jr7roso7r39aua71aijeuxoxlgluaqku/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "50312",
        "title": "Skibidi Man: Search of Skibidi Girl",
        "description": "In one old skibidi village, a boy decided to meet a skibidi girl, and she fell in love with him at first sight, but she was stolen by the evil skibidi Bully. Now you have to help the boy find her Love... Many dangers await you along the way.",
        "instructions": "A - LEFT ARROW LEFT MOVE D - ARROW RIGHT RIGHT MOVE W SPACE - UP ARROW JUMP MOVE",
        "url": "https://html5.gamemonetize.com/6ubohjfnkghbso76xbuikm2p8ldfnklr/",
        "category": "Boys",
        "tags": "1 Player, Action, Adventure, Arcade, Boy, Boys, Girl, Girls, Minecraft",
        "thumb": "https://img.gamemonetize.com/6ubohjfnkghbso76xbuikm2p8ldfnklr/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "50139",
        "title": "Spaceman Escape Adventure",
        "description": "Spaceman Escape Adventure is an addictive space adventure game. Help the isolated astronauts in space successfully get the key, open the door, and escape successfully. Be careful with the current, if you hit it, you will start right back where you started. The portal is a sign that you have reached your goal and you can pass the level. Are you ready for the challenge?",
        "instructions": "WASD or tap to move",
        "url": "https://html5.gamemonetize.com/xatdw0u14xo45jxir654hnif9di0qk77/",
        "category": "Boys",
        "tags": "2D, Action, Android, Avoid, Collecting, H5, Obstacle",
        "thumb": "https://img.gamemonetize.com/xatdw0u14xo45jxir654hnif9di0qk77/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49268",
        "title": "Battle Warship Arena",
        "description": "Battle Warship Arena is a thrilling 2D naval combat game that lets you command your own warship and blast away enemy ships. You can choose from five different ships and five unique captains, each with their own skills and abilities. You can also upgrade your warship&rsquo;s firepower, armor, speed, and more. To win each level, you need to destroy all enemy ships while staying within the red circle. If you go outside the circle, your warship will take constant damage until it sinks. Battle Warship Arena is a fun and challenging game that will test your strategic skills and reflexes. Are you ready to rule the seas?",
        "instructions": "Tap buttons to aim and shoot hold wheel to move",
        "url": "https://html5.gamemonetize.com/lvpy2a5xbyd2xj8h5oeqzspfevjiuy15/",
        "category": "Boys",
        "tags": "Battle, Boat, Casual, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/lvpy2a5xbyd2xj8h5oeqzspfevjiuy15/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "45970",
        "title": "Zombie defense: War Z Survival",
        "description": "Zombie defense: War Z Survival, the ultimate zombie game, is here to fulfill your gaming desires! Prepare yourself for an battle against hordes of flesh-eating zombies, as you desperately strive to save your own life from the impending zombie tsunami. The sheer number of these undead creatures is mind-boggling. Escaping their clutches might prove to be a daunting task, but fear not, for the war against these relentless beings has only just commenced! Equipped with a powerful firearm, your role as a skilled zombie catcher becomes crucial in halting this unstoppable zombie wave. So, rally your courage and embark on this exhilarating journey!",
        "instructions": "Click to play",
        "url": "https://html5.gamemonetize.com/sj7s1t0c6x9u5k021ne0tp7wi3q90b5q/",
        "category": "Boys",
        "tags": "Collecting, Defense, Fighting, Gun, War, weapons, Zombie",
        "thumb": "https://img.gamemonetize.com/sj7s1t0c6x9u5k021ne0tp7wi3q90b5q/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "45469",
        "title": "Only Up! Parkour",
        "description": "Only Up! is an exciting arcade game in which you have to overcome obstacles and conquer Inspired by the popular game Your task is to guide the character through a vertical labyrinth full of various obstacles. You must react quickly, jump accurately and climb up dexterously to avoid crashing into obstacles and falling down. As you progress through the various levels, you will encounter increasing difficulty and new challenges such as moving platforms and rotating obstacles.",
        "instructions": "WASD Move Space Jump",
        "url": "https://html5.gamemonetize.com/x0hb11h9lq2347nqv2kvk4bycdlxm9eb/",
        "category": "Boys",
        "tags": ".io, 1 Player, 3D, 3D Games, Action, Adventure, Android, Arcade, Boy, Hypercasual, New, Obstacle, OnlyUp, vehicle",
        "thumb": "https://img.gamemonetize.com/x0hb11h9lq2347nqv2kvk4bycdlxm9eb/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "46391",
        "title": "Idle Archer Tower Defense RPG",
        "description": "Welcome brave archer heroes to the enchanting realm of Idle Archer Tower Defense RPG! Embrace the role of a solitary archer, unyielding in defending their towering stronghold against relentless tides of monstrous adversaries. With an unwavering determination, you pledge to safeguard the realm from the nefarious creatures summoned by the sinister dark Lord. Engage in a relentless battle to fortify your tower, enhance the skill set of your valiant archers, triumph over malicious waves of malevolence, and with every defeat, rise again, imbued with newfound strength and resilience.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/l52877duuk1ge26w3ccw5re4bqbbq44b/",
        "category": "Boys",
        "tags": "1 Player, 2D, Bow, Castle, Defense, Kids, Magic, Mobile, Online, RPG, Skills, Stickman, Tower Defense, War",
        "thumb": "https://img.gamemonetize.com/l52877duuk1ge26w3ccw5re4bqbbq44b/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "48053",
        "title": "Object Hunter",
        "description": "Object Hunter is an exciting and addictive online game. Stunning visuals immerse you in a beautifully designed environment full of intricate details and hidden objects, your main goal is to turn into objects to hide or find cleverly hidden objects in the game scene within a limited time of various objects. One will be the captor, and the rest will hide! Lets dive into the captivating world of Object Hunter and discover why its worth your time!",
        "instructions": "1 Drag to move and hide from hunters or become a hunter to find hiders 2 Challenge yourself in the timed mode where you race against the clock to find all the hidden objects 3 Sharpen your observation skills and you will be rewarded with a satisf",
        "url": "https://html5.gamemonetize.com/xu647z6k294whfq6ajunb0lfkas88qdk/",
        "category": "Boys",
        "tags": "3D, Casual, Detective, Escape, Hidden, HTML5, Kids, Online, Strategy",
        "thumb": "https://img.gamemonetize.com/xu647z6k294whfq6ajunb0lfkas88qdk/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "47778",
        "title": "Combat Koloboks",
        "description": "You are the commander of an elite unit of combat koloboks and the goal of your life is to defeat the rebellious detachments of terrorist koloboks.",
        "instructions": "Go to the squad and hire heroes or upgrade Go on missions or into random combat Earn money and upgrade your squad ",
        "url": "https://html5.gamemonetize.com/in3exfht3w9oohcmagtp0bmtxh2g4djw/",
        "category": "Boys",
        "tags": "Arena, Army, MMO, Shoot, Strategy, War",
        "thumb": "https://img.gamemonetize.com/in3exfht3w9oohcmagtp0bmtxh2g4djw/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "47967",
        "title": "Plants Vs Zombies: Merge Defense",
        "description": "Plants Vs Zombies Merge Defense is an army of merged plants to protect your garden from countless zombies. Your goal is to protect your garden from challenging waves of zombies. Experimenting with different plant combinations and positioning is the key to maximizing your defense capabilities and overcoming tough challenges. Prepare your defenses, merge your plants wisely, and unleash the full power of your green army to triumph over the relentless hordes of brain-craving zombies!",
        "instructions": "1 Click the mouse or tap the screen to grow plants to prevent zombies from attacking 2 The gold coins or diamonds obtained can be used to buy different heroes and plants and upgrade them to stop the attack of zombies 3 Similar plants can be merged to",
        "url": "https://html5.gamemonetize.com/ii67kla6ysrwd90rddusa7el27k43zvv/",
        "category": "Boys",
        "tags": "Brain, Classic, Fun, HTML5, Kids, Online, Plant, Relaxation, Skill, Strategy, Tower Defense, Zombie",
        "thumb": "https://img.gamemonetize.com/ii67kla6ysrwd90rddusa7el27k43zvv/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "44806",
        "title": "Roblox Coloring Book",
        "description": "Roblox Coloring Book is an engaging and creative game that offers players a fun and interactive way to explore their artistic skills within the Roblox universe. In this game, players are presented with a wide array of coloring pages featuring popular Roblox characters, items, and scenes. Roblox Coloring Book offers a wide range of coloring pages, catering to players of all ages and interests. Whether youre a fan of Robloxs iconic avatars, famous game environments, or unique accessories, theres a coloring page that suits your preferences. Additionally, the game regularly updates its collection, ensuring a constant supply of fresh and exciti",
        "instructions": "Use mouse to play this Coloring book game with Roblox ",
        "url": "https://html5.gamemonetize.com/qyzbrptpe2yl2zz5nula589k2nvd4yq4/",
        "category": "Boys",
        "tags": "Color, Coloring",
        "thumb": "https://img.gamemonetize.com/qyzbrptpe2yl2zz5nula589k2nvd4yq4/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46254",
        "title": "World of Tanks Blitz",
        "description": "Welcome to World of Tanks Blitz, where you will experience the thrill of a real shooting game! Join a global community of millions of players, venture into your very first massive tank battle, engage in intense 7x7 combat, and emerge victorious! Immerse yourself in this online tank shooting game, where youll encounter a wide range of vehicles, maps, game modes, and countless strategic possibilities. Get ready for adrenaline-pumping tank clashes on an epic scale!",
        "instructions": "Slide to move your target and aim and tap to shoot your enemies",
        "url": "https://html5.gamemonetize.com/uq5ow69wgxydz7rzm0gefv6v91wmrksy/",
        "category": "Boys",
        "tags": "1 Player, Battlegrounds, Best, Fire, Kill, Mobile, Online, Shoot, Tank, Tanks, Timing, unity, War",
        "thumb": "https://img.gamemonetize.com/uq5ow69wgxydz7rzm0gefv6v91wmrksy/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "46563",
        "title": "War Plane Strike: Sky Combat",
        "description": "Getting ready for a thrilling and adrenaline-pumping experience with War Plane Strike: Sky Combat? Prepare to embark on an action-packed adventure where youll assume control of a warplane and partake in epic battles against enemy forces. As the esteemed ace soldier in your army, bravely undertake missions, engage in combat against adversaries, and eliminate airborne threats with precision! With its vibrant graphics and captivating scenery, get ready to immerse yourself in the exhilarating sensation of soaring through the skies. Its time to become the ultimate fighter pilot!",
        "instructions": "PC WASD to move left mouse to fire Mobile slide to move tap to fire",
        "url": "https://html5.gamemonetize.com/ggcnpsldi1mbkoesjwee4unb1wc0b332/",
        "category": "Boys",
        "tags": "1 Player, Aircraft, Driving, Fire, Kids, Plane, Shoot, Simulator, Timing",
        "thumb": "https://img.gamemonetize.com/ggcnpsldi1mbkoesjwee4unb1wc0b332/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "47180",
        "title": "Merge Master: Skibidi Bop",
        "description": "Discover the fantasy world of skibidi monsters in the Merge Master: Skibidi Bop! Merge your terrible monsters, make them evolve and have the most powerful army. You need to use your tactics and your brain to combine monsters and fight the skibidi toilet! You need to evolve your monsters quickly and have a strong army! If you want to win this battle, you need to evolve your monster quickly to get a huge army! Come on!",
        "instructions": "Click monster buttons to buy monsters drag same monsters to merge them and get a higher-level monster",
        "url": "https://html5.gamemonetize.com/7cno37tfianlivq29hanilqqtqak2ghv/",
        "category": "Boys",
        "tags": "Alien, Android, Arena, Battle, Best, Boy, Boys, Fight, Kids, Kill, Monster, Skibidi Toilet, Strategy, War",
        "thumb": "https://img.gamemonetize.com/7cno37tfianlivq29hanilqqtqak2ghv/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "47507",
        "title": "Ice Scream: Horror Escape",
        "description": "Ice Scream: Horror Escape is an exciting and scary adventure puzzle game. One day morning, you saw your best friend being kidnapped by a strange man into the ice cream truck. You need to rescue children in danger and escape from the evil ice cream truck driver. Do you have the courage to take on the challenge?",
        "instructions": "1 Use WASD or the joystick to move 2 Press the button to interact with the scene 3 Escape from the Ice Cream Trucker and save your friend ",
        "url": "https://html5.gamemonetize.com/7jz6aysjuk90clvhm2us38y3mkdr3e8w/",
        "category": "Boys",
        "tags": "3D, Adventure, Boy, Brain, Escape, HTML5, Puzzle, Strategy",
        "thumb": "https://img.gamemonetize.com/7jz6aysjuk90clvhm2us38y3mkdr3e8w/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "47372",
        "title": "Merge Bubble Number",
        "description": "Merge Bubble Number is a simple and addictive number merge puzzle game. You will control a board of checkers, each with a bubble with a number in it. You need to connect as many bubbles as possible so that bubbles of the same number merge together. The goal of the game is to merge as many bubbles as possible before there are no bubbles that can be synthesized, and finally reach a high score.",
        "instructions": "1 Use the mouse to drag You can also tap the screen to control on mobile devices 2 The game requires you to use mathematical thinking and strategies flexibly and arrange every move reasonably 3 You need to predict the merged numbers and choose the a",
        "url": "https://html5.gamemonetize.com/2hy8rlzvcdrj7z84145tf9jhcubbd5is/",
        "category": "Boys",
        "tags": "Boy, Brain, Bubble, Fun, HTML5, Kid, Kids, Mobile, Number, Online, Puzzle, Strategy",
        "thumb": "https://img.gamemonetize.com/2hy8rlzvcdrj7z84145tf9jhcubbd5is/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "46764",
        "title": "Find 6 Differences",
        "description": "Find 6 Differences is a casual puzzle game where you need to find the differences between two seemingly identical images and spot them. The game is simple yet entertaining, with each round lasting just a few minutes, making it perfect for unwinding in your free time. Can you find out all the differences? Come and have fun!",
        "instructions": "Take a close look at these two seemingly identical images You must use your eyesight and observation skills to find out all the six differences and mark them by clicking with the left mouse ",
        "url": "https://html5.gamemonetize.com/wb2cwnqf7vbiw802zwbg3kx5twqkyrvj/",
        "category": "Boys",
        "tags": "Boy, Casual, Difference, Fun, HTML5, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/wb2cwnqf7vbiw802zwbg3kx5twqkyrvj/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "47248",
        "title": "Stick Legions",
        "description": "Monsters have attacked your village! You are the only survivor! Are you ready to shoulder the important task of saving the village and defeating the army of monsters? Come and play Stick Legins to rescue your stickman companions, drive away monsters, and become a hero of justice!",
        "instructions": "1 Tap to move 2 Think about how to proceed to the next step 3 Rescue your companions and upgrade your strength ",
        "url": "https://html5.gamemonetize.com/jvv9e8al0014k2s1xgwut4058ltwh8ob/",
        "category": "Boys",
        "tags": "Battle, Boy, Fight, HTML5, Kid, Kids, Mobile, Online, Puzzle, Stickman, Strategy, War",
        "thumb": "https://img.gamemonetize.com/jvv9e8al0014k2s1xgwut4058ltwh8ob/512x384.jpg",
        "width": "750",
        "height": "1334"
    }
]