[
    {
        "id": "52049",
        "title": "Zombie Survival FPS : Defense Z Mart",
        "description": "NON STOP ZOMBIE SHOOTER GAME !! JOIN US NOW The game is set in the apocalypse when the zombie pandemic is widespread. Your last defense is a supermarket. You must destroy all the zombies you encounter. With a weapon system and extremely attractive first-person shooting gameplay, it promises to bring players an extremely interesting experience. Dont let any zombies get through. shoot or die !",
        "instructions": "Move the mouse to aim Left click to shoot R to Reload Press Esc to unlock cursor P to Pause Unpause M to Mute Unmute",
        "url": "https://html5.gamemonetize.com/0o8izaqf1dgfgyqszj039u90a0apo95o/",
        "category": "Shooting",
        "tags": "1 Player, 3D, 3D Games, Action, apocalypse, Best Games, CSGO, Defense, fps, Shoot, Shoot 'Em Up, Shooter, Shooting, Zombie",
        "thumb": "https://img.gamemonetize.com/0o8izaqf1dgfgyqszj039u90a0apo95o/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51892",
        "title": "Battle City Online",
        "description": "Battle City Online contains 35 different levels Each map contains different types of terrain and obstacles You can play with your friends locally, or online (coming soon) You can create your own map and play it with friends Drive the tank of your childhood :) I dare you to pass all levels, protecting the city against tanks super smart Todos :- 1- Multiplayer online game play 2- Shop - players can sell or buy their rewards and their own maps 3- Implement coin system for betting and tournaments 4- Implement joystick support in map editor 5- Better UI for Map Editor section. 6- Implement AI difficulty to support (easy, normal, hard) play modes",
        "instructions": "1- keyboard 2- joystick - only xbox 360 3- mouse to navigate through UI",
        "url": "https://html5.gamemonetize.com/clh4isvecl4undsvzkb2z5k6jo7xw637/",
        "category": "Shooting",
        "tags": "1 Player, 2 Player, Arena, Battle",
        "thumb": "https://img.gamemonetize.com/clh4isvecl4undsvzkb2z5k6jo7xw637/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "51929",
        "title": "Bubble Ocean",
        "description": "A tap game to pove your speed! You are in control of the ocean and you must create bubbles to bring the pollution back to where it came from! Show them what you are made of!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/c6ga66lnynydlu6ycjpl5bxlhjmhy9le/",
        "category": "Shooting",
        "tags": "Bubble, Clicker",
        "thumb": "https://img.gamemonetize.com/c6ga66lnynydlu6ycjpl5bxlhjmhy9le/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51976",
        "title": "Grand Skibidi Town",
        "description": "Grand Skibidi Town features gta style sandbox, drivable vehicles and big arsenal of weapons, your mission is to destroy given amount of skibidi toilets in order to successfully complete each level and unlock new weapons.",
        "instructions": "WASD - Move LMB - Shoot RMB - Aim R - Reload G - Grenade Space - Jump ",
        "url": "https://html5.gamemonetize.com/lapi8m2ozqd1lnk9a582ew9hvggcu7u8/",
        "category": "Shooting",
        "tags": "1 Player, 3D, 3D Games, Action, Adventure, gta, Shoot, Shoot 'Em Up, Shooter, Shooting, Skibidi, Skibidi Toilet, Unity3D",
        "thumb": "https://img.gamemonetize.com/lapi8m2ozqd1lnk9a582ew9hvggcu7u8/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "51922",
        "title": "Tank Sniper 3D",
        "description": "Tank Sniper 3D: The Ultimate Shooting Game Are you a fan of shooting games? Do you have what it takes to be a sniper tank driver? Then youll love Tank Sniper 3D - the action game that puts your skills to the test. Shoot your enemies with one shot from behind cover. Stay hidden until you strike with a surprise shot. Then, dodge their fire and hit as many targets as you can. How long can you survive? Find out now and play Tank Sniper 3D!",
        "instructions": "Hold to aim release to shoot",
        "url": "https://html5.gamemonetize.com/8l8z2va227lgfnrkqrgd6mib6xpzlh5z/",
        "category": "Shooting",
        "tags": "3D, Battle, Boys, Casual, Shooting, Sniper, Tank",
        "thumb": "https://img.gamemonetize.com/8l8z2va227lgfnrkqrgd6mib6xpzlh5z/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "51820",
        "title": "Hot Girl Shooter",
        "description": "Hot Girl Shooter: A Stunning Shooting Game! Join the hottest shooting game ever! Hot Girl Shooter lets you control gorgeous ladies with amazing guns and blast your enemies away! Each girl has her style and charm! Choose from different weapons and modes for endless fun! If you love guns and action, this game is for you! Play now!",
        "instructions": "WASD to move",
        "url": "https://html5.gamemonetize.com/31lgegym60ey47s6ot8w763s8ism8j6j/",
        "category": "Shooting",
        "tags": "1 Player, 2D, Boys, Casual, Cute, Girls, Gun, Kids",
        "thumb": "https://img.gamemonetize.com/31lgegym60ey47s6ot8w763s8ism8j6j/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "51672",
        "title": "Magical Archer",
        "description": "n the game &ldquo;Magical Archer,&rdquo; you will enter an enchanting fantasy world where you take on the role of a magical archer with the task of collecting a collection of magical bottles. These bottles contain various spells and enchantments. Gameplay: The game consists of 16 levels, each of which presents a challenge to your archery skills. At the beginning of each level, you stand in front of a glass that needs to be shattered. To do this, you must set the angle and strength of your shot so that the arrow precisely hits the target. The game offers 6 different types of magical bottles, each with its own color and magical properties. To unlock a bo",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/snyx35svpq1e0s7354g7c4chq8ofuabi/",
        "category": "Shooting",
        "tags": "Android, arrows, Bow, First Person Shooter, free html5 games for your website, HTML, HTML5, iPhone",
        "thumb": "https://img.gamemonetize.com/snyx35svpq1e0s7354g7c4chq8ofuabi/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "45390",
        "title": "Shoot Block Rush 3D",
        "description": "Shoot Block Rush 3D is a simple and easy-to-use shooting game consisting of many small levels. It doesnt require you to have great shooting skills. You need to choose the right abilities and paths to win. Your goal is to keep shooting in all directions and clear all the obstacles that stand in your way. Try to be the best destroyer and defeat the boss!",
        "instructions": "Slide to move",
        "url": "https://html5.gamemonetize.com/iqe4no55e9i6pvg1eaqct96e3xoo6d4c/",
        "category": "Shooting",
        "tags": "Casual, Gun, Kids, Shooting",
        "thumb": "https://img.gamemonetize.com/iqe4no55e9i6pvg1eaqct96e3xoo6d4c/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "51720",
        "title": "Crime Theft Gangster Paradise",
        "description": "Crime Theft Gangster Paradise is an action-packed gaming experience set in the neon-lit streets of Las Vegas. Players become ruthless gangsters, armed with a vast array of weapons, stylish costumes, and exotic cars. Engage in intense shootouts, daring missions, and high-speed street races while collecting valuable loot Welcome to the city of sin&mdash;the place where you can drown yourself in riches! Be prepared to live a new life and experience a limitless world where you make the rules. Do whatever it takes to quickly rake in a vast fortune and become a billionaire. In a world where there is no law, be ready to defend yourself at the drop",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/z5py0263ltj5xsk4bqvnzqce21pra5da/",
        "category": "Shooting",
        "tags": "Batman, Battlegrounds, Cars, gta, HTML5, Shoot, Shoot 'Em Up, unity games",
        "thumb": "https://img.gamemonetize.com/z5py0263ltj5xsk4bqvnzqce21pra5da/512x384.jpg",
        "width": "460",
        "height": "700"
    },
    {
        "id": "51703",
        "title": "Hawkeye Sniper",
        "description": "Be the best sniper with Hawkeye Sniper! This is a cool and challenging game where you have to spot and shoot the enemy! They are hidden very well! Can you hit them all with a perfect shot? It&rsquo;s time to prove yourself! Play this game! Have fun!",
        "instructions": "Click to aim Release to shoot ",
        "url": "https://html5.gamemonetize.com/mtdepw7ngtwtvfy3348x68n1hihtopc7/",
        "category": "Shooting",
        "tags": "3D, Boys, Gun, Simulation, Sniper",
        "thumb": "https://img.gamemonetize.com/mtdepw7ngtwtvfy3348x68n1hihtopc7/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "51523",
        "title": "Deform It",
        "description": "Deform It is a game about deforming objects. There are 13 different ball options and 14 levels in total. Set in space, this game has 3 game modes. -Level Mode -Free Deform Mode -Antigravity Mode",
        "instructions": "---GAMEPLAY--- Move the camera with WASD Move the camera UP Q Move the camera DOWN E LMB for shooting projectiles C for open close crosshair V for lock unlock cursor P for open close PAUSE Panel ---SKILLS--- F Doubleshot Skill G Triples",
        "url": "https://html5.gamemonetize.com/cnrxdusp5voxrfahhgtyme4twzz0o4u6/",
        "category": "Shooting",
        "tags": "1 Player, 3D, Ball, Casual, Clicker, Shoot",
        "thumb": "https://img.gamemonetize.com/cnrxdusp5voxrfahhgtyme4twzz0o4u6/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "51620",
        "title": "Telekinesis Attack",
        "description": "Use your telekinesis magic power! Gain the ability to control the power of thought! Throw your enemies wherever you want, hit them against whatever you want and deal with them however you want! Using your unique power, defeat all enemies, interact with different objects, take away weapons from enemies and be the strongest!",
        "instructions": "Control by pulling enemies just hold down the mouse button on the enemy and pull him in different directions to defeat the enemy just throw him in any direction ",
        "url": "https://html5.gamemonetize.com/mdwhevqlrf9seap60s9gr6bbl18njy4u/",
        "category": "Shooting",
        "tags": "3D Games, Fighting, First Person Shooter, Magic, Shoot, Shooter, Stickman, Superhero, Unity3D",
        "thumb": "https://img.gamemonetize.com/mdwhevqlrf9seap60s9gr6bbl18njy4u/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "51649",
        "title": "Backrooms: Skibidi Shooter",
        "description": "Backrooms: Skibidi Shooter features endless backrooms crowded with skibidi toilets and your mission is to shoot your way through each level and try to find the exit to successfully complete each level and unlock new weapons.",
        "instructions": "WASD - Move LMB - Shoot RMB - Aim R - Reload G - Grenade Space - Jump ",
        "url": "https://html5.gamemonetize.com/upfnrhlbt1moynrycl070zdkuj602pvm/",
        "category": "Shooting",
        "tags": "1 Player, 3D, 3D Games, Action, Adventure, Gun, Shoot, Shoot 'Em Up, Shooter, Shooting, Skibidi, Skibidi Toilet, Unity3D",
        "thumb": "https://img.gamemonetize.com/upfnrhlbt1moynrycl070zdkuj602pvm/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "51626",
        "title": "Thomas Runner",
        "description": "Thomas Runner&rdquo; is an exhilarating and dynamic arcade game where the player embarks on an adventurous journey through a hazardous world filled with turrets, zombies, spikes, and mines. The player&rsquo;s objective is to reach the end of each level while surviving various threats and collecting bonuses.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/vawfi05aa5yrj0czd4mlmxvttep92ngd/",
        "category": "Shooting",
        "tags": "1 Player, 2D, Arcade, Army, Bomb, Fire, First Person Shooter, free html5 games for your website, html games for your website, html5 games, Shoot, Shooter, Zombie",
        "thumb": "https://img.gamemonetize.com/vawfi05aa5yrj0czd4mlmxvttep92ngd/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "46312",
        "title": "operation Thunderstrike",
        "description": "This is a demo of the game Operation Thunderstrike. The game has infleunces from classics like Metal Slug, Heavy Weapon and Silkworm This is a fast shooting Shmup game where you are in control of either a Tank or a helicopter. Make use of the upgrades throughput the game to make it to the boss at the end of the level! Do you like the game? Got any comments? Dont hesitate and click the links within the game to go to the developers fb page or Itch.io page. Enjoy!",
        "instructions": "Mobile touch screen Keyboard TANK - left right move tank - Up Down move turret - V fire Bullet - C Fire Cannon - X Jump HELICOPTER - Left Right Up Down move heli - V Shoot Bullet - C Shoot Cannon",
        "url": "https://html5.gamemonetize.com/cnit0h0j4yxj12q7mkk0v38atyownjn4/",
        "category": "Shooting",
        "tags": "Action, Shoot 'Em Up",
        "thumb": "https://img.gamemonetize.com/cnit0h0j4yxj12q7mkk0v38atyownjn4/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46316",
        "title": "Jetpack Rider",
        "description": "JetPack Rider is a side-scrolling, game in which you are traveling through the construction site. You are trying to destroy or avoid enemies and obstacles. Collected coins can be used for skins upgrades or buying helpful items.",
        "instructions": "Power Makes player go higher ndash Touch hold W Magnet Makes player go faster for the next 3 seconds ndash Touch hold B Shield For 5 seconds player is invincible ndash Touch hold B Rocket Destroys electric obstacles and enemies amp",
        "url": "https://html5.gamemonetize.com/xycugfmpo73v5eh3oujbqy808hrnyx07/",
        "category": "Shooting",
        "tags": "fly, Shooter, sky",
        "thumb": "https://img.gamemonetize.com/xycugfmpo73v5eh3oujbqy808hrnyx07/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "45936",
        "title": "Tower Defense Kingdoms",
        "description": "Tower Defense Kingdoms is an exciting and challenging game that puts you in control of defending your kingdom against waves of enemies. Build and upgrade your towers strategically to fend off hordes of invaders and prevent them from reaching your castle. With dozens of levels and various enemies, each with their unique strengths and weaknesses, Tower Defense Kingdoms will keep you engaged and entertained for hours on end.",
        "instructions": "Tap to play",
        "url": "https://html5.gamemonetize.com/sl90beby7k9mcd61gdkjskhj7qm4qaqq/",
        "category": "Shooting",
        "tags": "2D, Adventure, Arcade, HTML, HTML5, Online, Shooter, Shooting",
        "thumb": "https://img.gamemonetize.com/sl90beby7k9mcd61gdkjskhj7qm4qaqq/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "50334",
        "title": "Santa Stars Shooter",
        "description": "Welcome to our newest Christmas theme game Santa Stars Shooter. The game has 20 levels with different difficulty. The goal of the game is for Santa Claus to shoot the Christmas stars with snowballs. The game has great graphics and movements. Enjoy this shooting game and Happy New Year and a Merry Christmas!",
        "instructions": "Use your mouse to play this game or tap on the screen ",
        "url": "https://html5.gamemonetize.com/6j6voum4j8qmvne4suw9fhcr734ge6nb/",
        "category": "Shooting",
        "tags": "1 Player, Christmas, Fun, Kids, Shooter, Shooting, Winter",
        "thumb": "https://img.gamemonetize.com/6j6voum4j8qmvne4suw9fhcr734ge6nb/512x384.jpg",
        "width": "960",
        "height": "540"
    },
    {
        "id": "51317",
        "title": "Cameraman vs Skibidi Monster : Fun Battle",
        "description": "Cameraman vs Skibidi Monster is an action-packed cameraman game where you engage in thrilling battles against hordes of skibidi toilets and challenging bosses. With a wide range of cameraman, players can tailor their experience to their preferences. The inclusion of unique elements like well-aimed shots, bullet ricochets, and dangerous traps adds depth and excitement to the game. Strategic use of secret traps like circular saws, spikes, and concrete blocks enhances the tactical aspect of the battles.",
        "instructions": "Hold the left mouse button to aim and release to shoot ",
        "url": "https://html5.gamemonetize.com/idro0bv73k70uwwenrs2mkjua5cjbci8/",
        "category": "Shooting",
        "tags": "Battle, Mouse, Physics, Strategy",
        "thumb": "https://img.gamemonetize.com/idro0bv73k70uwwenrs2mkjua5cjbci8/512x384.jpg",
        "width": "1366",
        "height": "768"
    },
    {
        "id": "51165",
        "title": "The Day of Zombies",
        "description": "The Day of Zombies is a zombie survival shooter game where you play as an american ranger and your mission is to search for weapons across the map in order to survive. The game features vast location to explore and big arsenal of weapons to find.",
        "instructions": "WASD - Move LMB - Shoot RMB - Aim R - Reload G - Grenade Space - Jump F - Use ",
        "url": "https://html5.gamemonetize.com/lr3qt0rzp8b8f97atvaiut5as8m4icfy/",
        "category": "Shooting",
        "tags": "1 Player, 3D, 3D Games, Action, Gun, Shoot, Shoot 'Em Up, Shooter, Shooting, survival, Unity3D, War, Zombie",
        "thumb": "https://img.gamemonetize.com/lr3qt0rzp8b8f97atvaiut5as8m4icfy/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "51132",
        "title": "Strike Galaxy Attack ",
        "description": "Prepare for an adrenaline-fueled, top-down, military space shooting extravaganza with Strike Galaxy Attack! Show off your lightning-fast reflexes and strategic thinking as you face off against a relentless army of invaders. Memorize their patterns, unleash your firepower, and become the hero who saves the galaxy. Suitable for players of all ages, this free online game guarantees endless fun. Engage now and embark on an intergalactic adventure!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/5qoll80lcrsvumk53nurp6e1j40djm16/",
        "category": "Shooting",
        "tags": "Action, Adventure, free html5 games for your website, html5 games, Shooting",
        "thumb": "https://img.gamemonetize.com/5qoll80lcrsvumk53nurp6e1j40djm16/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46468",
        "title": "Infantry Attack:Battle 3D FPS",
        "description": "Soldier! Stop playing the escape game! The third world war is here, and the mission is waiting for you! The enemy is attacking our country, and we count on you to protect it, so grab your weapon and prepare to fight! Easy control to aim and shoot the enemy, finish each task to win the ultimate victory!",
        "instructions": "WASD to move tap to shoot",
        "url": "https://html5.gamemonetize.com/foof3euvtu1r928pcec4j0vtslnqqqy6/",
        "category": "Shooting",
        "tags": "3D, Battle, Fighting, Gun, Shooting, War, weapons",
        "thumb": "https://img.gamemonetize.com/foof3euvtu1r928pcec4j0vtslnqqqy6/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "50875",
        "title": "Pirate Block Craft Monster Shooter",
        "description": "Prepare for an exhilarating survival shooting game that promises thrilling and entirely novel encounters. In the world of Block Craft, characters find themselves marooned on a treacherous river, a perilous realm teeming with monsters and uncertainty. Sinister, bloodthirsty beings such as Bambam and Chuu Chuu are relentlessly hunting down every survivor. Website Developer <a href='https://ro.bestcrazygames.com'>https://ro.bestcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/lhmi1jgygea8lv7arg44d30z2hnrel7p/",
        "category": "Shooting",
        "tags": "Android, Block, blocky, HTML5, iPad, iPhone, Mentolatux, Mobile, Monster, Shooting, Zombie",
        "thumb": "https://img.gamemonetize.com/lhmi1jgygea8lv7arg44d30z2hnrel7p/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50855",
        "title": "Dead City Zombie Invasion 2023",
        "description": "is an action-adventure game that places you in the shoes of a well-armed individual, tasked with eradicating hordes of zombies that have infested a city. Vigilance is key to surviving the onslaught of the living dead. The game offers user-friendly controls, allowing you to navigate by simply tapping the desired location on the screen. If youre in the mood for some zombie-slaying action, aim accurately at your undead adversaries. Website Developer <a href='https://ro.kizi10.org'>https://ro.kizi10.org</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/jxdno88jafvyr9vfma8p4g8gxr8zb4tn/",
        "category": "Shooting",
        "tags": "apocalypse, Levels, Mentolatux, Shooting, Skills, survival, WebGL, Zombie",
        "thumb": "https://img.gamemonetize.com/jxdno88jafvyr9vfma8p4g8gxr8zb4tn/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49292",
        "title": "Skibidi Hit Master",
        "description": "Skibidi Hit Master is a hilarious Shooting game where you must defend the world from an invasion of Skibidi Toilets! Take on the role of a cameraman and fight off waves of toilet-like monsters. Battle the Skibidi Boss, G-Man, and his army of quirky enemies. Embark on this absurd comedy and save humanity from the comical toilet terror! Get ready to laugh through the flush in this entertaining adventure with cartoonish graphics.",
        "instructions": "Drag and click to shoot",
        "url": "https://html5.gamemonetize.com/5v5di5766lz4kax3unxtr0qqaylr4me9/",
        "category": "Shooting",
        "tags": "Battle, Shooting",
        "thumb": "https://img.gamemonetize.com/5v5di5766lz4kax3unxtr0qqaylr4me9/512x384.jpg",
        "width": "560",
        "height": "854"
    },
    {
        "id": "50539",
        "title": "Riffle Assault",
        "description": "A fun and challenging trench battle game. Manage your purchases and movements to overcome the enemy! You are the general! The enemies army are coming! . Manage your purchases and movements to overcome the enemy! Reach to the end and then you will be victorious!",
        "instructions": "Touch the weapon buttons to buy your army Touch the soldiers to make them move forward Manage your purchases and movements to overcome the enemy ",
        "url": "https://html5.gamemonetize.com/008zinna5lvgtoc89x5zoau2nsr2g27t/",
        "category": "Shooting",
        "tags": "2D, Best Games, Strategy, War",
        "thumb": "https://img.gamemonetize.com/008zinna5lvgtoc89x5zoau2nsr2g27t/512x384.jpg",
        "width": "1900",
        "height": "1250"
    },
    {
        "id": "50872",
        "title": "Arsenal Online",
        "description": "High-octane 2D shooter. Jump into some quick and explosive shoot-em-up action! Play one of many fun game modes either solo or with a friend online! Each game mode has a different objective, such as Sniper where accuracy is rewarded, or Time Attack where maximum kills is the goal. Unlock hundreds of weapons and attachments, ranging from pistols, SMGs, assault rifles, LMGs, sniper rifles, and more! Enter the firing range where all weapons and attachments are immediately accessible.",
        "instructions": "Desktop Mouse keyboard Mobile Tap",
        "url": "https://html5.gamemonetize.com/fadsdximj0ao2vsyuswwntlarkxe1ns5/",
        "category": "Shooting",
        "tags": "2D, Arcade, Casual, Gun, Mobile, Multiplayer, Shoot 'Em Up, Shooter, Shooting, Simulation",
        "thumb": "https://img.gamemonetize.com/fadsdximj0ao2vsyuswwntlarkxe1ns5/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "50808",
        "title": "Killer Santa",
        "description": "Killer Santa is an Action-Adventure game where Santa is a super cop and takes the task of killing bad people. Will he be able to do it?",
        "instructions": "Use the arrow keys to move and the Left Mouse Button to Shoot Right Mouse Button to throw the Grenade ",
        "url": "https://html5.gamemonetize.com/ys147ejqihtss47n5hs9ax7wam7cnlu8/",
        "category": "Shooting",
        "tags": "3D, Action, Adventure, Fun, Shoot 'Em Up, Shooter",
        "thumb": "https://img.gamemonetize.com/ys147ejqihtss47n5hs9ax7wam7cnlu8/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49825",
        "title": "Cat Robot Transform War",
        "description": "This thrilling cat robot simulator offers a dynamic blend of survival hero action and car robot transformation. The game sets you in the midst of a robot war, challenging you to clear the city of adversaries in a series of car and cat robot games. This addictive experience combines robot shooting with wild animal transformation, offering nonstop action and various abilities like punching and jumping. Website Developer <a href='https://vi.kizi10.org'>https://vi.kizi10.org</a>",
        "instructions": "TAB show menu WASD to move MouseLeft to shoot MouseRight to Aim F to change to car and press again F to change to cat robot on control car use button mobile from the screen and for PC version use WASD on mobile you can use button from the screen",
        "url": "https://html5.gamemonetize.com/yku2862csp6ye66344uo25v3tq1938dj/",
        "category": "Shooting",
        "tags": "Android, Car, Driving, HTML5, iPad, iPhone, Mentolatux, Mobile, Robot, Shooting, unity, WebGL",
        "thumb": "https://img.gamemonetize.com/yku2862csp6ye66344uo25v3tq1938dj/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50628",
        "title": "Sniper Strike",
        "description": "Sniper Strike is a first-person shooter game that puts you in intense and difficult situations. Stay vigilant and exercise caution as you navigate through challenging missions. Your keen eye and precise aim are crucial as you identify and eliminate high-value targets to accomplish each mission triumphantly. Prepare for an adrenaline-pumping experience filled with tactical precision and thrilling sniper action.",
        "instructions": "Desktop Left-click shoot Right-click iron sight Scroll mouse-wheel zoom in out R reload Tab pause Mobile Use UI controls",
        "url": "https://html5.gamemonetize.com/faj3w69flisi32koxs0ea4h1tawgogu8/",
        "category": "Shooting",
        "tags": "3D, Gun, Killing, Shoot, Shooting, Sniper",
        "thumb": "https://img.gamemonetize.com/faj3w69flisi32koxs0ea4h1tawgogu8/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50459",
        "title": "Skibidi Warzone Shooting Online",
        "description": "Play Free Skibidi Warzone Shooting Online is a new 3D game. You will control a cameraman who will face thousands of skibidi. You will have to move around the city, point and shoot. The world was invaded by thousands of skibidi toilets whose mission and objective is to destroy every human being and cameraman to control the city. They will chase you and corner you to eliminate you. Try to escape so they dont catch you, you will be able to survive all the levels you can. Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "Controls Use the mouse on Desktop Touch the screen on mobile devices ",
        "url": "https://html5.gamemonetize.com/mg6l8zq0fqhcowa25vm1hwk149tumgsl/",
        "category": "Shooting",
        "tags": "Gun, kiz10, Shooter, War",
        "thumb": "https://img.gamemonetize.com/mg6l8zq0fqhcowa25vm1hwk149tumgsl/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50512",
        "title": "Skibidi Strike",
        "description": "Skibidi Strike is a shooting game where you play as special forces soldier and your mission is to shoot given amount of skibidi toilets in order to survive and unlock big arsenal of guns awarded after completing each level with increasing difficulty.",
        "instructions": "WASD - Move LMB - Shoot RMB - Aim R - Reload G - Grenade Space - Jump ",
        "url": "https://html5.gamemonetize.com/otdbe3ccst605qyfhnwnod62pnhnjjqb/",
        "category": "Shooting",
        "tags": "1 Player, 3D, 3D Games, Action, CSGO, Shoot, Shoot 'Em Up, Shooter, Shooting, Skibidi, Skibidi Toilet, Unity3D",
        "thumb": "https://img.gamemonetize.com/otdbe3ccst605qyfhnwnod62pnhnjjqb/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "48666",
        "title": "Cargo Truck: Transport &amp; Hunt",
        "description": "Are you ready for a wild adventure with Cargo Truck: Transport &amp; Hunt, a simulation game that combines driving and hunting? The zoo animals have escaped and you are the only one who can catch them! Drive your truck across the city and use your sniper gun to hunt down the animals, from leopards to elephants. But be careful, they are fast and furious! You have to bring them back to the zoo safely and quickly. Cargo Truck: Transport &amp; Hunt is a game that will challenge your skills and nerves. Don&rsquo;t miss this exciting game! Have fun!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ng2igdvp92xohmlehl315mwqe3wt9caq/",
        "category": "Shooting",
        "tags": "3D, Animal, Boys, Gun, Shooting, Sniper, Truck",
        "thumb": "https://img.gamemonetize.com/ng2igdvp92xohmlehl315mwqe3wt9caq/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "49943",
        "title": "Metal Slug Adventure",
        "description": "Metal Slug Adventure is a newly developed side-scrolling action shooting , based on the essence of the legendary arcade masterpiece! With upgraded visuals that pay homage to its retro roots while introducing a fresh and captivating art style, the game brings a splendid visual presentation and abundant content including a vast array of weapons, diverse battlefields, and various super-vehicles.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/fdngtbzxm6ilhy3f91n5edffnjhsa9ze/",
        "category": "Shooting",
        "tags": "1 Player, 2D, Action, Adventure, Best Games, Casual, Shooting, Skills",
        "thumb": "https://img.gamemonetize.com/fdngtbzxm6ilhy3f91n5edffnjhsa9ze/512x384.jpg",
        "width": "800",
        "height": "480"
    },
    {
        "id": "50316",
        "title": "Assault Time",
        "description": "3D first person shooter game. Your mission is to explore the enemy base and take down all the guards. Shoot enemies, pick up first aid kits and earn money to purchase various upgrades.",
        "instructions": "Computer Arrow keys or W A S D to move the character Mouse to turn the character aim and shoot L to lock pointer R to reload P - pause Mobile Use on-screen joystick to move fire button to shoot tap and drag on right side of the screen to aim and",
        "url": "https://html5.gamemonetize.com/p59ss73bjptrct2bb63ci3xzjbra2r7r/",
        "category": "Shooting",
        "tags": "3D, 3D Games, Action, Android, Army, Boys, Bullet, Enemies, Gun, HTML5, iPhone, Killing, Mobile, Shooter",
        "thumb": "https://img.gamemonetize.com/p59ss73bjptrct2bb63ci3xzjbra2r7r/512x384.jpg",
        "width": "900",
        "height": "506"
    },
    {
        "id": "50252",
        "title": "Agent Skibidi",
        "description": "Hey, agents, load your weapons! All the toilet monsters have awakened and are coming to kill you. Eliminate all the monsters and collect the highest score. Remember, you can always reach a higher score. Monsters are coming from both the right and left. Work together with your friend to take them all down. Use different weapon modes to kill all the monsters.",
        "instructions": "Press A-D keys to shoot You will move in the direction youre firing Press the Arrow keys to shoot Mobile gameplay is available ",
        "url": "https://html5.gamemonetize.com/4kbn6y0aadz1fssql42d6op1m3zgk2a6/",
        "category": "Shooting",
        "tags": "2 Player, 2 Player Games, 2D, Action, Gun, Shoot, Shooter, Shooting",
        "thumb": "https://img.gamemonetize.com/4kbn6y0aadz1fssql42d6op1m3zgk2a6/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50156",
        "title": "Chernobyl Zombie Hell",
        "description": "It has not been a long time since the explosion (The Chernobyl disaster, 26 April 1986) and all living things in the areas close to the reactor have been greatly affected by the radioactivity. Every week, cleaners are sent to the area to prevent the monsters from being heard. Youre this weeks cleaner. You have to clear zombies, dogs, rats and more. You will start at the regional hospital, then go down to the streets of Chernobyl and finally reach the tunnels under the reactor. Enjoy high quality graphics, a wide variety of weapons and perfectly balanced gameplay.",
        "instructions": "Change weapon Mouse wheel amp 1 2 3 4 5 Grenade G Interact Pick item F Pause P Leaning Q E Lock Unlock Mouse Cursor L Move Arrow keys amp W A S D Look Mouse Shoot Left mouse button Zoom Right mouse button Run Left Shift",
        "url": "https://html5.gamemonetize.com/01yrjf2hqf2aesokf2jeq6o45k0puiet/",
        "category": "Shooting",
        "tags": "3D, 3D Games, Arena, Gun, Horror, Monster, Shooter, Shooting, Undead, unity, Unity3D, Vampire, weapons, Zombie",
        "thumb": "https://img.gamemonetize.com/01yrjf2hqf2aesokf2jeq6o45k0puiet/512x384.jpg",
        "width": "922",
        "height": "487"
    },
    {
        "id": "50127",
        "title": "Stupid Zombies Online",
        "description": "Stupid Zombies Online is a 2D puzzle game that lets you enjoy a thrilling zombie shooting adventure. You have to use your strategic thinking and shooting skills to eliminate all the zombies at each level. You can control the shooting angle and use a limited number of bullets to clear the zombies. The game has 100 levels of zombie-filled challenges for you to complete. You can earn scores by killing all the zombies with as few bullets as possible. If you are ready for some fun and exciting zombie action, then play Stupid Zombies Online now!",
        "instructions": "Hold to aim release to shoot",
        "url": "https://html5.gamemonetize.com/eesvler8sjxjkd8z35zczvloz5igtb3q/",
        "category": "Shooting",
        "tags": "2D, Casual, Logic, Physics, Puzzle, Zombie",
        "thumb": "https://img.gamemonetize.com/eesvler8sjxjkd8z35zczvloz5igtb3q/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "50111",
        "title": "Rebel Wings",
        "description": "The player controls the ship, shooting laser to enemies, launching homing missiles and fighting bosses. Each level the enemies differ, more difficult enemies are added and more difficult bosses. Each boss moves on its own unique pattern. Collect power ups like health, missiles, and bomb that kills every visible enemy to clear the stage. Fight through 16 ready levels. Collect the parts from the exploded enemy ships. Use the collected scrap as a currency to upgrade your own ship.",
        "instructions": "On desktop browsers use WASD or ARROW keys to move X of Shift key to launch missile Use the mouse to select levels or select which part of your ship to buy in hangar On mobile browsers there are two options to move the players ship which you can choose",
        "url": "https://html5.gamemonetize.com/sakdarokyhzgz75r2ybmf80pmt4ebdcn/",
        "category": "Shooting",
        "tags": "1 Player, Android, HTML5, iPad, iPhone, Mobile, Shoot 'Em Up, Side Scrolling, Space",
        "thumb": "https://img.gamemonetize.com/sakdarokyhzgz75r2ybmf80pmt4ebdcn/512x384.jpg",
        "width": "1200",
        "height": "675"
    },
    {
        "id": "49810",
        "title": "Pacific Ocean Adventure",
        "description": "How about fishing in the depths of the Pacific ocean? You must fight against sharks and hunt other fish to earn gold! Join this wonderful adventurous game now!",
        "instructions": "W A S D or Arrow Keys Movement Space Attack When you enter the game from a mobile device you can use the touch controls on the screen ",
        "url": "https://html5.gamemonetize.com/b3gmh9go2cl19hbsmci17bh738xcloty/",
        "category": "Shooting",
        "tags": "1 Player, 2D, Action, Adventure, Bubble, Fish, Fishing, Pixel, survival",
        "thumb": "https://img.gamemonetize.com/b3gmh9go2cl19hbsmci17bh738xcloty/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49762",
        "title": "Skibidi Attack",
        "description": "Welcome t Skibidi Attack shooting game! Tap or click to shoot skibidi toilets to get a high score! Dont let skibidi toilets come near to you. Enjoy and good luck!",
        "instructions": "Tap or click to shoot",
        "url": "https://html5.gamemonetize.com/d3rkszqi4fjxzuv900ibqo6v1cdo3xed/",
        "category": "Shooting",
        "tags": "Shooter, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/d3rkszqi4fjxzuv900ibqo6v1cdo3xed/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "49580",
        "title": "ROBOTS ENIGMA",
        "description": "Coins are scattered throughout the level, collect as many coins as you can while navigating through the challenging terrain.Defeat all enemy units to achieve victory.",
        "instructions": "Use WASD or arrow keys to move the player and click left mouse button to attack ",
        "url": "https://html5.gamemonetize.com/ya5f3mwrtttq0lfgw9yuf8v3v88h5zo0/",
        "category": "Shooting",
        "tags": "Action, Adventure, Battle, Fight, Robot, survival",
        "thumb": "https://img.gamemonetize.com/ya5f3mwrtttq0lfgw9yuf8v3v88h5zo0/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "49182",
        "title": "Infinite Blocks",
        "description": "Join the battle against the advancing block army in Infinite Blocks. Defend your base by strategically eliminating rows of blocks with precision shots. Can you withstand the relentless assault and achieve the highest score? Challenge your skills and test your endurance in this action-packed adventure!",
        "instructions": "Use a mouse or touchpad to play this game ",
        "url": "https://html5.gamemonetize.com/yicypspzteeu2d06qfbr8o62nc9zsbu3/",
        "category": "Shooting",
        "tags": "Block, HTML5, Matching, Mobile, Shooter",
        "thumb": "https://img.gamemonetize.com/yicypspzteeu2d06qfbr8o62nc9zsbu3/512x384.jpg",
        "width": "420",
        "height": "700"
    },
    {
        "id": "49540",
        "title": "Mountain Tank",
        "description": "A tank shooting game with multiple tanks, enhanced upgrades, and various terrain levels.Button controlled tank movement and shooting.",
        "instructions": "Button controlled tank movement and shooting ",
        "url": "https://html5.gamemonetize.com/qrh3ov788e2pho4lisrwxjofjcmauvg1/",
        "category": "Shooting",
        "tags": "1 Player, Adventure, Hypercasual",
        "thumb": "https://img.gamemonetize.com/qrh3ov788e2pho4lisrwxjofjcmauvg1/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "49403",
        "title": "Tanks: Counteroffensive",
        "description": "You control a tower with cannons and machine guns. Enemy troops are on the offensive. Try to stop them as soon as possible, when they come closer they will not leave you a chance.",
        "instructions": "Mouse click or tap to play Control in Mobile 1 Joystick for turning the tower 2 Three attack buttons for machine gun and cannon and rocket launcher",
        "url": "https://html5.gamemonetize.com/yytlybvqzcrfx0mh4igk52l3qf35o4z7/",
        "category": "Shooting",
        "tags": "3D, Action",
        "thumb": "https://img.gamemonetize.com/yytlybvqzcrfx0mh4igk52l3qf35o4z7/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49532",
        "title": "Pumpkin Hunt",
        "description": "The game challenges players to test their aiming and reflexes by shooting pumpkins . Its a simple yet addictive game.The main objective of Pumpkin Hunt is to shoot down pumpkins as they appear on the screen.",
        "instructions": "Players aim and shoot at the pumpkins by using a controllers crosshairs Shooting a pumpkins rewards the player with points ",
        "url": "https://html5.gamemonetize.com/2m1c5vmtlw1bl9fa5sdorbrtcqi359f5/",
        "category": "Shooting",
        "tags": "Casual, Halloween, Hypercasual, Shoot, Shooting",
        "thumb": "https://img.gamemonetize.com/2m1c5vmtlw1bl9fa5sdorbrtcqi359f5/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "49417",
        "title": "Cowboy vs Skibidi Toilets",
        "description": "Cowboy vs Skibidi Toilets is a shooting game set in wild west where you play as cowboy and your mission is to shoot all skibidi toilets using different weapons, try to survive each round to unlock new guns.",
        "instructions": "WASD - Move LMB - Shoot RMB - Aim R - Reload G - Grenade Space - Jump ",
        "url": "https://html5.gamemonetize.com/pdsguzyx3xhl0dekvbdi132bw3hzj44t/",
        "category": "Shooting",
        "tags": "1 Player, 3D, 3D Games, Action, Gun, Shoot, Shoot 'Em Up, Shooter, Shooting, Skibidi, Skibidi Toilet, Unity3D",
        "thumb": "https://img.gamemonetize.com/pdsguzyx3xhl0dekvbdi132bw3hzj44t/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "49352",
        "title": "Zombie Wars TopDown Survival",
        "description": "Prepare to Vanquish Foes and Collect Treasure! Strategically Deploy Your Ammunition and Arsenal! Remember to Upgrade Your Firearms and Stock Up on Ammo Before Going Into Battle! Zombie faster and the boss waiting you to destroy. Website Developer <a href='https://www.kizi10.org/'>https://www.kizi10.org/</a>",
        "instructions": "Mouse click or tap to play and from PC you can use WASD amp ARROW to move",
        "url": "https://html5.gamemonetize.com/y7tbihkovrbyz0ybxxd0o85s70b2h8er/",
        "category": "Shooting",
        "tags": ".io Games, 1 Player, Android, HTML5, iPad, iPhone, Mentolatux, Mobile, Shooting, survival, Top Down, Zombie",
        "thumb": "https://img.gamemonetize.com/y7tbihkovrbyz0ybxxd0o85s70b2h8er/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48890",
        "title": "Skibidi Toilet FPS Shooting Survival",
        "description": "Skibidi Toilet FPS Shooting Survival is an exhilarating video game that combines fast-paced first-person shooting action with a unique twist. Players find themselves in a perilous situation as they battle enemies in a world where toilets become battlegrounds. With a quirky and humorous concept, this game offers a refreshing take on the traditional FPS genre. Strategize, shoot, and survive in this wacky virtual arena filled with unexpected challenges and laughter-inducing moments. Get ready to plunge into the Skibidi Toilet FPS Shooting Survival adventure! Website Developer <a href='https://www.kizi10.org/'>https://www.kizi10.org/</a>",
        "instructions": "WASD walk mouse left shoot and mouse right AIM",
        "url": "https://html5.gamemonetize.com/eoeo4gswxn1whp6mkold64qn6dunff5w/",
        "category": "Shooting",
        "tags": "Mentolatux, Shooter, Shooting, Skibidi, Skibidi Toilet, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/eoeo4gswxn1whp6mkold64qn6dunff5w/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48962",
        "title": "Battleground Survival 2023",
        "description": "Battleground Survival is an adrenaline-pumping, action-packed multiplayer survival game that drops players onto a deserted island, where the ultimate goal is to be the last person or team standing. As a skilled survivalist, youll need to rely on your wits, strategy, and combat prowess to outlast your rivals in this intense virtual battleground. Website Developer <a href='https://www.bestcrazygames.com/'>https://www.bestcrazygames.com/</a>",
        "instructions": "WASD walk SHIFT run MOUSE shooting aim and scroll change gun TAB menu",
        "url": "https://html5.gamemonetize.com/bbjdiu2s8se9muqkdbllq6by8qy4ds3t/",
        "category": "Shooting",
        "tags": "Mentolatux, Shooting, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/bbjdiu2s8se9muqkdbllq6by8qy4ds3t/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48846",
        "title": "Grimace Bullet Blender",
        "description": "In the exciting game Grimace Bullet Blender, players are tasked with a thrilling challenge. Their objective is to click on the police officer or any object on the map to direct the bullet towards the character, Grimace. Once the bullet is perfectly aligned with Grimace, a SHOOT button will appear, ready to be activated. This dynamic gameplay mechanic adds an element of precision and strategy to the game, making it an engaging experience for players of all ages. Website Developer <a href='https://www.crazygamesonline.com/'>https://www.crazygamesonline.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/74ijtek8l89t61rhi0x5f7f4feuhh78r/",
        "category": "Shooting",
        "tags": "Android, Grimace, Grimace Shake, Mentolatux, Mobile, Shoot, Shooting, Top Down, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/74ijtek8l89t61rhi0x5f7f4feuhh78r/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49009",
        "title": "One Bullet To Grimace",
        "description": "One Bullet to Grimace is a shooting game where the player needs to control a bullet after firing it. The bullet can be steered left and right to target multiple enemy grimaces. The objective is to destroy all enemies to win. The game features 50 levels. Website Developer <a href='https://www.bestcrazygames.com/'>https://www.bestcrazygames.com/</a>",
        "instructions": "A left D right for mobile use buttons",
        "url": "https://html5.gamemonetize.com/qdhbk8rmikytwo7d31x7nkyej7cvz6lk/",
        "category": "Shooting",
        "tags": "Android, Grimace, Grimace Shake, HTML5, iPad, iPhone, Mentolatux, Mobile, Shoot, Shooting, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/qdhbk8rmikytwo7d31x7nkyej7cvz6lk/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46687",
        "title": "Zombie Frontier Shooter",
        "description": "Zombie Frontier Shooter is an adrenaline-pumping experience filled with non-stop action and zombie-slaying madness! Step into the shoes of a skilled sniper hunter as you embark on a mission to eliminate the relentless horde of undead creatures. In a world plagued by a lethal virus that has transformed ordinary humans into ferocious zombies, the threat of a blood-soaked demise looms over mankind. However, amidst the chaos, survivors must rise up and engage in a life-or-death struggle against the zombie menace, morphing into fearless zombie shooters who will stop at nothing to secure their territory. Pick up weapons, destroy zombies and survive",
        "instructions": "Drag to move your character",
        "url": "https://html5.gamemonetize.com/t5ja1jr6s0tib922yaoc1d86xb3oh49h/",
        "category": "Shooting",
        "tags": "3D, Arcade, Avoid, Collecting, Gun, Helicopter, Simulation, Sniper, Zombie",
        "thumb": "https://img.gamemonetize.com/t5ja1jr6s0tib922yaoc1d86xb3oh49h/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "48883",
        "title": "Dead Aim: Skibidi Toilets Attack",
        "description": "Dead Aim: Skibidi Toilets Attack is a shooting game where you play as special forces soldier on a city streets invaded by skibidi toilets and your mission is to shoot them all in order to survive and unlock 10 types of weapons.",
        "instructions": "WASD - Move LMB - Shoot R - Reload Space - Jump ",
        "url": "https://html5.gamemonetize.com/glr4degbtojrnmiudrcmmkw2o7b7gnqp/",
        "category": "Shooting",
        "tags": "1 Player, 3D, 3D Games, Action, Gun, Shoot, Shoot 'Em Up, Shooter, Shooting, Skibidi, Skibidi Toilet, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/glr4degbtojrnmiudrcmmkw2o7b7gnqp/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "48756",
        "title": "Grimace Versus Skibidi",
        "description": "Grimace vs Skibidi is an action-based defense game. The Grimace is in deep trouble and has to defend the shakes from the dangerous Skibidi Aliens. Help him to move fast and throw the snow balls and avoid them reaching the shakes; If they reach the eggs you lose the game!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/wybt0jrneff6jkodzgnq7cnp3wbhxv9x/",
        "category": "Shooting",
        "tags": "Boy, Defense, Grimace, Grimace Shake, HTML, HTML5, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/wybt0jrneff6jkodzgnq7cnp3wbhxv9x/512x384.jpg",
        "width": "1024",
        "height": "600"
    },
    {
        "id": "48687",
        "title": "Flying Grimace",
        "description": "Flying Grimace is a fun shooting game for all. To play this game, you need to be great at aiming. The game is set in colorful environments, and your aim is to destroy as many Grimaces as possible. Remember, you have limited bullets. Flying Grimace will surely test your aiming skills and keep you engaged for hours. This game is perfect for fans of arcade shooting games and anyone who loves a good challenge.",
        "instructions": "PC You can use ASDW or the right-left and up-down arrow keys to fix your target And space key to shoot Mobile Use the joystick to fix your target and tap on the shoot button to shoot ",
        "url": "https://html5.gamemonetize.com/xbh3e5wb6bilzeu1l2r12otatxkc3uex/",
        "category": "Shooting",
        "tags": "Fun, Funny, Grimace, Grimace Shake, Highscore, NapTech Games, Shoot, Shooter, Shooting",
        "thumb": "https://img.gamemonetize.com/xbh3e5wb6bilzeu1l2r12otatxkc3uex/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "48657",
        "title": "Grimace Commando",
        "description": "Defend the world to the Grimace invasion! Use your mini machine gun to destroy all Grimace Inavders! This game is a classic endless trend arcade game when you need to resist the more you can and sign the best record!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/s5ckkqi51j69zm0nyghyuy03t8hoszyy/",
        "category": "Shooting",
        "tags": "Arcade, Boy, Grimace, Grimace Shake, HTML, HTML5, Mobile, Shooter",
        "thumb": "https://img.gamemonetize.com/s5ckkqi51j69zm0nyghyuy03t8hoszyy/512x384.jpg",
        "width": "1024",
        "height": "600"
    },
    {
        "id": "48521",
        "title": "Speakerman Vs Skibidi Toilet",
        "description": "The game is set in a post-apocalyptic world where the Speakerman and the Skibidi Toilet are the two most powerful forces. The Speakerman is a giant robot with a powerful speaker that can emit destructive sound waves.",
        "instructions": "Control PC Use the arrow keys on the keyboard to target the Skibidi Toilet Remember do not shoot the speakerman Mobile Use the joystick to target the Skibidi Toilet Remember do not shoot the speakerman ",
        "url": "https://html5.gamemonetize.com/y27rb3r0b9saiz6ziakmy4alnxutpkjv/",
        "category": "Shooting",
        "tags": "Adventure, Best Games, NapTech Games, Shoot, Shooter, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/y27rb3r0b9saiz6ziakmy4alnxutpkjv/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "48529",
        "title": "Skibidi Invasion",
        "description": "The goal is to resist the more you can and after you can sign your personal record in the local leaderboard! Shoot the Skibidi Toilet aliens as fast as you can and survive much time and achieve high scores. Use your machine gun weapon to destroy all Skibidi! The goal is to resist the more you can and after you can sign your personal record in the local leaderboard. Have fun with this great funny endless game!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/jd5s7us23loraqjc37qjtuasjfmzl1fm/",
        "category": "Shooting",
        "tags": "Arcade, Boy, HTML5, Mobile, Shooter, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/jd5s7us23loraqjc37qjtuasjfmzl1fm/512x384.jpg",
        "width": "1024",
        "height": "600"
    },
    {
        "id": "48612",
        "title": "Kick Grimace",
        "description": "Do you love physics puzzle brain games? Well, this game is for you! Use your brain and think before you drop the red ball. You must hit the purple Grimace with the ball and try to collect 3 Grimace Milk Shake. Explore Tons of amazing levels and Enjoy.",
        "instructions": "Tap or click to play",
        "url": "https://html5.gamemonetize.com/ep9maa7wijhej1ymmob0oskwuwryjlz6/",
        "category": "Shooting",
        "tags": "Ball, Grimace, Physics, Red",
        "thumb": "https://img.gamemonetize.com/ep9maa7wijhej1ymmob0oskwuwryjlz6/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "46229",
        "title": "Dog Sitter",
        "description": "The dogs of the people on the street ran away.Look for them in the garden of the house and catch them.Then hand it back to its owners and do your duty.The more dogs you chase, the more points you get.",
        "instructions": "Tap and catch dogs that spawn in random locations every 1 second",
        "url": "https://html5.gamemonetize.com/3bovn58l2fpwn9pv7aqun6isz704xon5/",
        "category": "Shooting",
        "tags": "1 Player, 2D, Action, Adventure, Animal, Arcade, Baby, Best, Boy, Girl",
        "thumb": "https://img.gamemonetize.com/3bovn58l2fpwn9pv7aqun6isz704xon5/512x384.jpg",
        "width": "1708",
        "height": "960"
    },
    {
        "id": "48571",
        "title": "Grimace Dead Island Shooting",
        "description": "In the game Dead Island Shooting, players take on the role of a skilled survivor in a post-apocalyptic world infested with the menacing Grimace enemies. Armed with dual guns, one in each hand, players face off against relentless waves of these grotesque creatures. Your task is strategically aiming and shooting at the Grimace enemies, utilizing your agility and accuracy to stay alive. As the waves progress, the challenge intensifies, pushing your shooting skills to the limit. Website Developer <a href='https://www.bestcrazygames.com/'>https://www.bestcrazygames.com/</a>",
        "instructions": "Mouse click or tap to shooting",
        "url": "https://html5.gamemonetize.com/ykjxx02q8pq9mcyc81vs2n5k7v4spqq2/",
        "category": "Shooting",
        "tags": "Fire, Grimace, Mentolatux, Shooting, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/ykjxx02q8pq9mcyc81vs2n5k7v4spqq2/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48448",
        "title": "Skibidi Laser Kill",
        "description": "Skibidi Laser Kill Game is a fast-paced, action-packed laser shooter arcade game. Players take control of a laser-wielding character and must defend themselves against waves of oncoming enemies. The game features a variety of enemies, each with their own unique attacks. Players must use their skills and reflexes to dodge enemy fire and take them down.",
        "instructions": "Pc Click the left button of the mouse to shoot the box and when obstacles are appear on the screen then drag the character to move right and left mobile Click the screen to shoot the box and when obstacles are appear on the screen then drag the charact",
        "url": "https://html5.gamemonetize.com/q67yaflcz7qvtox9udiqctmtmi0uv2uc/",
        "category": "Shooting",
        "tags": "Best Games, Fun, Games, HTML, HTML5, NapTech Games, Online, Play, Shoot, Shooting, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/q67yaflcz7qvtox9udiqctmtmi0uv2uc/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "47921",
        "title": "Zombie Treasure Adventure",
        "description": "Play the newest action-adventure game Zombie Treasure Adventure. Your goal is to collect the keys to open the treasure. Through the game, you are fighting with zombies that are attacking you. For every eliminated zombie you earn a star. Also, you are collecting coins for which you earn points. The game has 6 interesting levels. On the last level, you are fighting with the boss zombie!",
        "instructions": "Use arrow keys to move Z and X for a gun and to use another weapon ",
        "url": "https://html5.gamemonetize.com/mfi0mo2dk7e1kdfc0ehyuli9dnydxm8e/",
        "category": "Shooting",
        "tags": "Action, Adventure, Shooting, Zombie",
        "thumb": "https://img.gamemonetize.com/mfi0mo2dk7e1kdfc0ehyuli9dnydxm8e/512x384.jpg",
        "width": "960",
        "height": "540"
    },
    {
        "id": "48412",
        "title": "Machine Gun Squad Brave Soldier",
        "description": "Machine Gun Squad is an exciting shooting game. You are a brave soldier. This dangerous mission is to kill the head of terrorists. There are too many terrorists with kinds of weapons. We will supply the airdrop, and the powerful weapons in there. Good luck! Machine Gun Squad is an action-packed shooting game that puts players in the shoes of a brave soldier on a dangerous mission to eliminate the head of a terrorist organization. The game boasts thrilling gameplay mechanics, impressive graphics, and a variety of weapons to choose from. Machine Gun Squad, shooting game, brave soldier, terrorists, powerful weapons, airdrop system, strategy",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/qopbx1nlotnt69gyptvd70h8c0f9i8r4/",
        "category": "Shooting",
        "tags": "Action, Army, Battle, Battlegrounds, Bullet, Gun, Shoot, Shoot 'Em Up, Shooter, Shooting, War",
        "thumb": "https://img.gamemonetize.com/qopbx1nlotnt69gyptvd70h8c0f9i8r4/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48360",
        "title": "Sniper Dinosaur Hunting",
        "description": "Roaming through lush and immersive environments, youll need to use your keen observational abilities to spot these ancient creatures from afar. With an array of powerful sniper rifles at your disposal, each with its unique attributes, youll need to carefully choose your weapon and adapt your strategy for every encounter. As you progress, youll face increasingly intelligent and agile dinosaurs, pushing your shooting skills to the limit.",
        "instructions": "Mouse click or tap to play aim shoot and look around WASD walk",
        "url": "https://html5.gamemonetize.com/o8m5s0ichg906dv22mwxn24ww5ryszgc/",
        "category": "Shooting",
        "tags": "dino, Dinosaur, hunter, Hunting, Shooting, Sniper, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/o8m5s0ichg906dv22mwxn24ww5ryszgc/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46369",
        "title": "Cartoon Bricks Vip",
        "description": "Relax your brain and play the best bricks breaker game this year. Touch and shoot balls to break all bricks. You must clear all bricks to finish each level. Find the best aim angle to break a maximum of bricks. The bricks are destroyed when their score reach 0. Break the bricks before they hit the bottom of the screen. Cartoon Bricks is a addictive and challenging brick game. Just play it to relax your brain. Be focus on breaking bricks and you will find it more funny and exciting. Features - Easy to play - Colorful glow skins. - Easy game controls with one finger. - Thousands of stages! Endless game mode. - More props to get more fun!",
        "instructions": "How to play - Hold the screen with your finger and move to aim - Find best positions and angles to hit all bricks - When the durability of brick reaches 0 destroyed - Never let bricks reach the bottom or game is over - The ball flies to wherever you ",
        "url": "https://html5.gamemonetize.com/lmjtaexlxgiei2f1j8ejsmpk5ve7hfds/",
        "category": "Shooting",
        "tags": "1 Player, 2D, Action, Arcade, Ball, Block, Bricks, Cartoon, Casual, Classic, endless, Fun, Highscore, Mobile",
        "thumb": "https://img.gamemonetize.com/lmjtaexlxgiei2f1j8ejsmpk5ve7hfds/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "48270",
        "title": "Skibidi Toilet Shooting",
        "description": "Skibidi Toilet Shooting is an action packed shooting game set in blocky world where you play as american soldier and your mission is to shoot given amount of skibidi toilets in order to successfully complete each level and unlock new types of weapons.",
        "instructions": "WASD - Move LMB - Shoot RMB - Aim R - Reload G - Grenade Space - Jump ",
        "url": "https://html5.gamemonetize.com/gmuug4m73z1p4in0qu6idpvhogz7q9s0/",
        "category": "Shooting",
        "tags": "1 Player, 3D, 3D Games, Action, Gun, Shoot, Shoot 'Em Up, Shooter, Shooting, Skibidi, Skibidi Toilet, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/gmuug4m73z1p4in0qu6idpvhogz7q9s0/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "48041",
        "title": "Sniper Shooter",
        "description": "Immerse yourself in an adrenaline-pumping experience as you take on the role of a skilled sniper, tasked with defending your nation against enemy forces. With a vast array of customizable weapons, you can upgrade each guns unique attributes to create your perfect killing machine. Increase accuracy, reduce recoil, and enhance your firepower to dominate the battlefield.",
        "instructions": "Press and hold the screen to move aim the scope at the enemy release to shoot ",
        "url": "https://html5.gamemonetize.com/wrvgnynolrj2gjf8jfndfyb1t6cjg3r1/",
        "category": "Shooting",
        "tags": "3D Games, Action, Shooting, Sniper",
        "thumb": "https://img.gamemonetize.com/wrvgnynolrj2gjf8jfndfyb1t6cjg3r1/512x384.jpg",
        "width": "1136",
        "height": "640"
    },
    {
        "id": "47910",
        "title": "World War 2: Strategy Games",
        "description": "The war is coming. Show your unique art of war from the tip of your finger to bring out an impeccable world war. You can command any single army and match your own army groups at your will. You can also lead your allies to join the beach of Normandy or command the Axis forces to defend Atlantic Wall. Pick the nation you desire to join the second world war and decide the fate of the campaign in this World War II strategy game.",
        "instructions": "Mouse control More free rewards - WW2 turn-based tactics war games - Destructible and fixable bridges - Radar technology to detect enemy forces https gamesmunch com ",
        "url": "https://html5.gamemonetize.com/nvegf67hboe2xsjfmz85m4i3y4c9xnpm/",
        "category": "Shooting",
        "tags": ".io Games, 1 Player, 3D, 3D Games, Action, Fight, Fighting, Street Fighting",
        "thumb": "https://img.gamemonetize.com/nvegf67hboe2xsjfmz85m4i3y4c9xnpm/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48228",
        "title": "Zombie Parade Defense 6",
        "description": "Zombie Parade Defense continues with its 6th episode. This time you have to defend at 10 different stages. Enemies will get stronger with each stage. Dont forget to visit the Market section for upgrading weapons and an extra health bar etc.",
        "instructions": "Player 1 Move W A S D Hit C Grenade V Reload X Jump W Walk on the wall Switch weapon Q-E Player 2 Move ARROW KEYS Hit L Grenade K Reload J Jump UP ARROW KEY Walk on the wall Switch weapon P",
        "url": "https://html5.gamemonetize.com/z29uy1w1vesacxn31r485ivesj9a0snd/",
        "category": "Shooting",
        "tags": "2 Player, 2 Player Games, Battle, War, Zombie",
        "thumb": "https://img.gamemonetize.com/z29uy1w1vesacxn31r485ivesj9a0snd/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46386",
        "title": "Gun Mayhem Original",
        "description": "Gun Mayhem is a high octane arena style versus game! Battle with or against AI and friends alike in this cartoony platform shooter. - Supports up to 4 players at once - Utilize over 60 different firearms - 12 diverse maps to fight on - 4 unique gameplay modes: Last Man Standing, One Shot One Kill, Gun Game and Duck Defense - Campaign mode includes coop option - Customizable characters",
        "instructions": " Controls can be edited in game option Arrow Keys - Movement Left Square Bracket - Shoot Right Square Bracket - Throw Bomb Players 2 - 4 Controls can be edited in options ",
        "url": "https://html5.gamemonetize.com/qu3kkmif58laf9yj9ioq1ya631man0jn/",
        "category": "Shooting",
        "tags": "1 Player, 2 Player, 2D, Action, Game, Games, HTML, HTML5, Online, Shooting",
        "thumb": "https://img.gamemonetize.com/qu3kkmif58laf9yj9ioq1ya631man0jn/512x384.jpg",
        "width": "900",
        "height": "610"
    },
    {
        "id": "48096",
        "title": "Shooting Survival Skibidi Toilet",
        "description": "Skibidi toilet enemy is spawn from the ground and come to play, player have 2 guns and shooting to finish a number to kill to end the wave, environment is a forest with good quality of tree, grass, texture and much more fun i nthis shooting game",
        "instructions": "Mouse left to shoot and look around",
        "url": "https://html5.gamemonetize.com/xg9q4ctueabftzhgjpeqxym0ki7488ms/",
        "category": "Shooting",
        "tags": "Forest, Shooting, Skibidi, Skibidi Toilet, survival, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/xg9q4ctueabftzhgjpeqxym0ki7488ms/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48152",
        "title": "Skibidi Toilet vs Camer Man",
        "description": "Skibidi Toilet vs Camera Man A shooting game is a fun and challenging game that is perfect for players of all ages. It is a great game to play with friends or family, and it is sure to provide hours of entertainment. Website Developer <a href='https://naptechgames.com/'>https://naptechgames.com/</a>",
        "instructions": "Pc When the Skibidis appear on the screen click the mouse left button to shoot along their faces mobile When the Skibidis appear on the screen click the mobile screen to shoot along their faces ",
        "url": "https://html5.gamemonetize.com/glss8lxu6kkk8r27huayc2crocpqrmiy/",
        "category": "Shooting",
        "tags": "2D, Best Games, NapTech Games, Shoot, Shooter, Shooting, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/glss8lxu6kkk8r27huayc2crocpqrmiy/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "47603",
        "title": "Cannon Ball Strike",
        "description": "Click or tap the screen to throw balls into the container below. Time your moves and try not to waste any balls. Your goal is to fill the bucket below with the colored balls in your arsenal. Aim wisely, shoot the ball and fill all the buckets with colors. Balls that you cannot get into the bucket will deduct points from your final score.",
        "instructions": "How to play Desktop Mouse Mobile Touch control ",
        "url": "https://html5.gamemonetize.com/6h2gqviwrjikjln2ihr15gcpvl4or7ol/",
        "category": "Shooting",
        "tags": "Ball, Hypercasual, Shoot, Shooter, Shooting",
        "thumb": "https://img.gamemonetize.com/6h2gqviwrjikjln2ihr15gcpvl4or7ol/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "47642",
        "title": "Sayan Batle 2D",
        "description": "Galactic Shooter is an adrenaline-pumping 2D shooting game set in the far reaches of the universe. As a brave space pilot, you must embark on an epic journey to protect the galaxy from the invasion of ruthless alien forces. Armed with a state-of-the-art spaceship and a powerful arsenal of futuristic weapons, your mission is to eliminate hordes of enemy spacecraft and ensure the survival of the human race. Gameplay: The game features action-packed gameplay with engaging levels and challenging enemies. Each level is set in a different sector of the galaxy, presenting unique environments and enemy types. Youll encounter swarms of enemy spacesh",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/eilmwampen28oygvmdmgujzxhf74b36o/",
        "category": "Shooting",
        "tags": "2D, Shooting, unity, WebGL",
        "thumb": "https://img.gamemonetize.com/eilmwampen28oygvmdmgujzxhf74b36o/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48065",
        "title": "Sniper Survival Skibidi Toilet",
        "description": "Explore the thrilling world of Sniper Survival Skibidi Toilet, a mobile game that will put your sharpshooting skills to the test in a dangerous post-apocalyptic setting. Armed with your reliable sniper rifle, youll need to take out cunning enemies while perfecting your skibidi dance moves to remain undetected. Website Developer <a href='https://www.kizi10.org'>https://www.kizi10.org</a>",
        "instructions": "Mouse click or tap to play use WASD to walk the mouse use to shooting by pushing button left and mouse button right Aim look around use also mouse ",
        "url": "https://html5.gamemonetize.com/zhnkek8g3nf4gnsf5lnekiu30l8qh01o/",
        "category": "Shooting",
        "tags": "Shooting, Skibidi, Skibidi Toilet, Skill, Sniper, survival, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/zhnkek8g3nf4gnsf5lnekiu30l8qh01o/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48060",
        "title": "Play In Mall",
        "description": "Play an 3D first person water gun game with your friends! During a game break, you can buy items from Amazon (through verified Amazon Associates Program). No download needed, play it in your browser on any device!",
        "instructions": "PC keyboard mouse move wasd or arrow keys rotate shoot select mouse Mobile tablet touchscreen move bottom left touch joystick rotate bottom right touch joystick shoot with move upper left touch joystick shoot with rotate upper right tou",
        "url": "https://html5.gamemonetize.com/52g15pmd4ni6fcm12oit6r0rkcpj6niv/",
        "category": "Shooting",
        "tags": ".io, .io Games, 3D, 3D Games, Fun, Multiplayer, Shooter, Shopping",
        "thumb": "https://img.gamemonetize.com/52g15pmd4ni6fcm12oit6r0rkcpj6niv/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47866",
        "title": "Duty Call Modern Warfate 2",
        "description": "Your country is in trouble as you have been heavily influenced by militaries, you are the last expectation right now, you hae the discharge free military vehicles close by with the heavy armament specialist weapons, you will design an assault by utilizing all your property and air assets world war modern. You need to manufacture a system to demolish your foes tanks and helicopters before they make your assault to look docile. You are the commando of Special Forces, you will lead from the front in the terminating combat zone, plan your assault and afterward start the weapon strike right now shooting match-ups. Utilize all the world war weap",
        "instructions": "WASD - move mouse move - aim Left mouse button - shoot Right mouse button - scope activate R - reload Shift - run",
        "url": "https://html5.gamemonetize.com/i1h4zxt1z2bfk78s3xxbkhxon6pepuw7/",
        "category": "Shooting",
        "tags": "Army, Battle, Boys, Fire, Killing, Shoot, Shooter, Simulator, Sniper, War",
        "thumb": "https://img.gamemonetize.com/i1h4zxt1z2bfk78s3xxbkhxon6pepuw7/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "47864",
        "title": "TopDown Skibidi Toilet Shooting",
        "description": "Embark on an exhilarating journey with TopDown Skibidi Toilet Shooting, an action-packed top-down game that guarantees hours of thrilling gameplay! Get ready to immerse yourself in a quirky and fast-paced world where you, the skilled player, take on the role of a fearless hero with a unique mission: to collect objects, survive against relentless ski bidi toilets, and eliminate a set number of enemy ski bidi toilets to progress to the next level! In this captivating game, youll navigate through a series of challenging missions, each filled with cunning enemy ski bidi toilets eager to thwart your progress.",
        "instructions": "Mouse click or tap to play Use WASD to move soldier Mouse to shooting",
        "url": "https://html5.gamemonetize.com/m9yj7katuk538av1qlru2cqitmbbxmkc/",
        "category": "Shooting",
        "tags": "Enemies, Enemy, Shooting, Skibidi, Skibidi Toilet, Top Down, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/m9yj7katuk538av1qlru2cqitmbbxmkc/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47602",
        "title": "Spaceship War Zone ",
        "description": "pace Shuttle War is an immersive and exciting space shuttle game. While playing this fun game, you&rsquo;ll have to tap and swipe the screen to take control of the space shuttle and destroy your enemies with laser fire. As an endless one-touch game, it offers a game experience that gets progressively harder and harder. In the game, you will face many enemies as you move through the depths of space with your space shuttle. Enemy ships, space stations and obstacles will test your skills and reflexes. By making quick and accurate decisions, neutralize the enemies and enjoy the visual feast full of explosive effects.",
        "instructions": "How to play Desktop Mouse Mobile Touch control ",
        "url": "https://html5.gamemonetize.com/yfymir1v56e8t2al2pfv115e4jjn7dge/",
        "category": "Shooting",
        "tags": "Arcade, Game, Shoot, Shooting, Space, Spaceship, War, weapons",
        "thumb": "https://img.gamemonetize.com/yfymir1v56e8t2al2pfv115e4jjn7dge/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "47751",
        "title": "Sniper Hunting Deadly Animal",
        "description": "In the dense heart of an untamed wilderness lies a legendary figure known as the Silent Animal Sniper. This enigmatic hunter has mastered the art of stealth and precision, making them an apex predator in the treacherous jungle. With keen eyes and nerves of steel, they navigate the rugged terrain, blending seamlessly into the shadows, and striking fear into the hearts of both their prey and rivals. Born and raised in the wild, this elusive marksman has forged an unbreakable bond with the jungle and its inhabitants.",
        "instructions": "Mouse click or tap to play They move with the grace of a panther and possess the instincts of a seasoned tracker ",
        "url": "https://html5.gamemonetize.com/sgx5ha69v0rrku8lsttfil1vcsqu07xc/",
        "category": "Shooting",
        "tags": "Adventure, Animal, Forest, Gun, jungle, Shooting, Skill, Sniper",
        "thumb": "https://img.gamemonetize.com/sgx5ha69v0rrku8lsttfil1vcsqu07xc/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47877",
        "title": "Ping Pong Shooter",
        "description": "Ping Pong Shooter is a fun and addictive puzzle game that combines the classic gameplay of Bubble Shooter with the physics-based gameplay of Ping Pong. The game features a variety of different levels, each with its own unique challenges. As you progress through the game, the levels will become more difficult, requiring you to use your skills and strategy to clear them.",
        "instructions": "Desktop Use the right click button of the mouse to shoot the ping pong ball Mobile Click and shoot the ping pong ball Controls and Indicators The scores and levels are shown in the upper middle of the screen ",
        "url": "https://html5.gamemonetize.com/dx0q0tkp11u0jw93wp13wq60wbl44qde/",
        "category": "Shooting",
        "tags": "2D, Bubble Shooter, HTML, HTML5, Shoot, Shooter, Shooting",
        "thumb": "https://img.gamemonetize.com/dx0q0tkp11u0jw93wp13wq60wbl44qde/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "47856",
        "title": "Sniper Hunting Skibidi Toilet",
        "description": "Embark on an unforgettable and quirky hunting adventure with Sniper Hunting Skibidi Toilet! Get ready to test your marksmanship skills and indulge in some hilarious action as you attempt to track down the elusive Skibidi Toilet. You aim to take down this cheeky and elusive target with your trusty sniper rifle. Controlling the game is easy and intuitive. Use your Mouse click or tap to play, making it accessible for PC and mobile players. When you need to access the games options or take a quick break, just hit the Tab key to bring up the Menu.",
        "instructions": "Mouse click or tap to play Tab - Menu Mouse Left Fire MouseRight Aim MouseScroll Zoom SHIFT Breath",
        "url": "https://html5.gamemonetize.com/z7b5yixkzil2cmnfvmfo544tp8bt5qnl/",
        "category": "Shooting",
        "tags": "3D Games, Gun, Level, Levels, Shooting, Skibidi, Skibidi Toilet, Skill, Sniper, Unity3D, weapons, WebGL",
        "thumb": "https://img.gamemonetize.com/z7b5yixkzil2cmnfvmfo544tp8bt5qnl/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47868",
        "title": "Skibidi Toilet Shooter",
        "description": "Skibidi Toilet Shooter is a fast-paced, shooting game where you have to kill the nasty Skibidi toilets. It is your responsibility to stop the Skibidi toilets from taking over the world. Use all your abilities to kill those nasty toilets and set the world free.",
        "instructions": "Desktop Use the arrow key buttons of the keyboard to move And the space button is for the shoot You can also use the buttons on the screen to move and shoot Mobile There are arrow buttons on the screen you can use those buttons to move and there i",
        "url": "https://html5.gamemonetize.com/szxoceh9mtkp0te9gx7vifxahguy75lc/",
        "category": "Shooting",
        "tags": "3D Games, Arcade, Casual, Classic, Crazy, Fun, Game, Games, Shoot, Shooter, Shooting, Ski, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/szxoceh9mtkp0te9gx7vifxahguy75lc/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "47792",
        "title": "Plane Shooter",
        "description": "Prepare for thrilling aerial combat in our action-packed Plane Shooter game! Take control of a powerful fighter plane as you navigate through intense enemy territory, engaging in epic dogfights and dodging enemy fire. Test your skills and reflexes as you shoot down waves of enemies and boss planes in a visually stunning, fast-paced experience.",
        "instructions": "Use Left Right Up and Down Arrow keys to move Left Right Up and Down Respectively You can also drag the plane using mouse in any direction For mobile devices use your finger to drag the plane ",
        "url": "https://html5.gamemonetize.com/9au6hds7l82msv86cxnmhn57heuc3udd/",
        "category": "Shooting",
        "tags": "1 Player, 2D, Action, Plane, Shooter, Shooting",
        "thumb": "https://img.gamemonetize.com/9au6hds7l82msv86cxnmhn57heuc3udd/512x384.jpg",
        "width": "450",
        "height": "1000"
    },
    {
        "id": "39107",
        "title": "Gun Run!   Gun Sprint",
        "description": "Flip the gun and move forward to reach the goal! When you tap the screen, the gun will shoot and flip forward or backward! Focus on the tap timing, shoot the enemies, and get high score! If the gun fly high, it will be hard to control.",
        "instructions": "Touch or Click",
        "url": "https://html5.gamemonetize.com/67h1zmfqpw4my22n7s5kz0j6c4087uh0/",
        "category": "Shooting",
        "tags": "3D, Action, Battle, Gun, HTML5, Hypercasual, weapons",
        "thumb": "https://img.gamemonetize.com/67h1zmfqpw4my22n7s5kz0j6c4087uh0/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47380",
        "title": "Tank Napoleon",
        "description": "You are the commander of a tank brigade - collect unique tanks to your taste and go into battle! Liberate the lands of the Supreme Council from the rebellious forces. Battles of 12 by 12 tanks are waiting for you. Develop your battle strategy and get into the top of the best tankers.",
        "instructions": "Mouse click or tap to play At the beginning of the game you can immediately go into battle to earn your first money to buy a new tank There will be hints in the battle Collect your tank configurations and enter a new battle ",
        "url": "https://html5.gamemonetize.com/yt71j3xn3opwb6ablihy1nndq9rg3nsq/",
        "category": "Shooting",
        "tags": "Battle, Strategy, Tank, Tanks, War",
        "thumb": "https://img.gamemonetize.com/yt71j3xn3opwb6ablihy1nndq9rg3nsq/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "47696",
        "title": "Defend the Planet",
        "description": "In the vast universe, there are many unknown dangers, just today, the Earth is suffering from the impact of asteroids, partners, lets use space fighters to stop them and defend our planet!",
        "instructions": "Please use the mouse to turn the direction and the left mouse button to attack ",
        "url": "https://html5.gamemonetize.com/kxwa7wy554wr4k2hr01hpcka2si5rihc/",
        "category": "Shooting",
        "tags": ".io Games, 1 Player, Shoot",
        "thumb": "https://img.gamemonetize.com/kxwa7wy554wr4k2hr01hpcka2si5rihc/512x384.jpg",
        "width": "800",
        "height": "497"
    },
    {
        "id": "47697",
        "title": "Skibidi Flappy Poppy",
        "description": "Get ready for an exhilarating gaming experience with Skibidi Toilet game series! Step into the shoes of the beloved character Skibidi Toilet as you play through a high-stakes game inspired by the super series Flappy Bird in poppy style. Are you able to avoid all pipes and try to collect all medals? Enjoy this great game!",
        "instructions": "Use your Mouse to click or tap the screen to play ",
        "url": "https://html5.gamemonetize.com/fqbwaar44gcqnk3u9d21kornuujbge4j/",
        "category": "Shooting",
        "tags": "Action, Android, HTML5, Mobile, run, running, Shooting, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/fqbwaar44gcqnk3u9d21kornuujbge4j/512x384.jpg",
        "width": "768",
        "height": "1024"
    },
    {
        "id": "46911",
        "title": "Spaceship Destruction",
        "description": "Play the newest action shooter game Spaceship Destruction. The game has 7 different levels from easier to harder. The goal of the game is to destroy all the enemies who are attacking you, collecting energy items, bombs, shields, and more. Enjoy and have fun!",
        "instructions": "You can use the mouse or arrow keys to play this game ",
        "url": "https://html5.gamemonetize.com/g2e77ahalq8bmd3ued7ryp6m78lhfwrp/",
        "category": "Shooting",
        "tags": "Action, Flight, Shooting, Space, Spaceship",
        "thumb": "https://img.gamemonetize.com/g2e77ahalq8bmd3ued7ryp6m78lhfwrp/512x384.jpg",
        "width": "480",
        "height": "720"
    },
    {
        "id": "43297",
        "title": "Star of warfare ",
        "description": "Star of warfare is a free multiplayer first-person shooter game that currently has 3 game modes deathmatch, team deathmatch an like capture the flag but will be updated with more modes battle royal and gun game. There are three weapon classes available in Star of warfare. You can use an assault rifle sniper or shotgun with more weapons being added soon.",
        "instructions": "WASD to move Space to jump left mouse button to shoot right mouse button to aim Shift to run P to pause the game Enter to respawn F to pick up a gun R to reload your weapon C to crouch 1 2 3 to change your",
        "url": "https://html5.gamemonetize.com/i1rug1a2wfumsk5a72vqmt7zry8ddjn4/",
        "category": "Shooting",
        "tags": "Action, Army, Multiplayer, weapons, WebGL",
        "thumb": "https://img.gamemonetize.com/i1rug1a2wfumsk5a72vqmt7zry8ddjn4/512x384.jpg",
        "width": "800",
        "height": "550"
    },
    {
        "id": "47473",
        "title": "Private Zombie Wave 2",
        "description": "A very smooth and precise 3rd person zombie shooter game",
        "instructions": "A Move Left D Move Right S Hide Space Shoot P Pause Or screen controller",
        "url": "https://html5.gamemonetize.com/yjmqujr6ywps0j7i6y1b2wtiw5gywnn0/",
        "category": "Shooting",
        "tags": "Shooter, Shooting, Zombie",
        "thumb": "https://img.gamemonetize.com/yjmqujr6ywps0j7i6y1b2wtiw5gywnn0/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47497",
        "title": "Tank Battle Tank War",
        "description": "ake your own equipment and tanks to engage in epic battles in the hills and crush the most formidable enemies. Collect loot after each battle to upgrade your armored vehicles weapons. You can unlock new tanks and fight your own way. After each victory, you will be rewarded with countless gold coins and will rise to the position of greatest war marshal.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/h2uu6i6jr0s10xftbb2icdkb8kom40hp/",
        "category": "Shooting",
        "tags": "Battle, Fire, Shoot, Tank, War",
        "thumb": "https://img.gamemonetize.com/h2uu6i6jr0s10xftbb2icdkb8kom40hp/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47447",
        "title": "Tank War Machines",
        "description": "Incredibly dynamic and fun multiplayer game. Build your tank from dozens of parts, play with your friends &amp; dominate the arena - 3 vs 3 PVP action. Try different tactics and win. Choose a tank and join the battle! Tanks A Lot! features four distinct game modes: - shoot your way in a classic, adrenaline-filled Deathmatch - fight for resources in Brawl - be the last man standing in Battle Royale - play football in Tank-O-Ball, but with tanks!",
        "instructions": "The game level is to enter the battlefield operate your own tank to attack the enemy target the enemy target is a moving target For tanks and airplanes players need to pay attention to the different angles of attack and the different damage caused by ",
        "url": "https://html5.gamemonetize.com/3ulpd2m1hkmcmaoruiq7abp1o5tlxnrw/",
        "category": "Shooting",
        "tags": "1 Player, 2D, Action, airplane, Arcade, Battle, Gun, Tank, Tanks, War, weapons",
        "thumb": "https://img.gamemonetize.com/3ulpd2m1hkmcmaoruiq7abp1o5tlxnrw/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "47233",
        "title": "Noob Challenge Rush",
        "description": "Welcome to the thrilling world of Noob Challenge Rush an action-packed HTML5 game where your survival skills will be put to the test. Can you outsmart the hordes of noobs and stay alive by swiftly dodging them while eliminating each one with your diamond-throwing abilities? Step into the challenge and find out! In this intense game, your mission is clear: run, dodge, and survive the relentless pursuit of the noobs. Utilize your agility to navigate through the obstacles and stay one step ahead of the pack. But mere evasion wont be enough &ndash; its time to fight back!",
        "instructions": "Throw Diamonds with the Space Bar Move the Player with the Arrow Keys ",
        "url": "https://html5.gamemonetize.com/ci5xvcgajyi98nua8xpa0x0a3dzc55tn/",
        "category": "Shooting",
        "tags": "3D, 3D Games, HTML, HTML5, Maze, Minecraft, Monster, Physics, run, Shooting",
        "thumb": "https://img.gamemonetize.com/ci5xvcgajyi98nua8xpa0x0a3dzc55tn/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "46662",
        "title": "Skibidi Toilet Wars",
        "description": "Are you ready for the Battle of Skibi Toilets? Fight for world domination in space with Skibidi Toilet. This game is a single player game. You and Your Opponent Have 3 Hits. And the one with 0 Right to Hit is defeated. So your goal in the game is to hit the opponent 3 times. Have fun!",
        "instructions": "Change Character Direction with Mouse To play again you must right click on the Play Again button ",
        "url": "https://html5.gamemonetize.com/403vxgif7m80edggube7b52m1hu6ascx/",
        "category": "Shooting",
        "tags": "1 Player, 2D, Arcade, Arena, Battle, Best, endless, Fight, Fighting, Gun, Shoot, Shooting, Skibidi Toilet, Space",
        "thumb": "https://img.gamemonetize.com/403vxgif7m80edggube7b52m1hu6ascx/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "47269",
        "title": "Target Triumph ",
        "description": "(60 Levels) - Welcome to an adrenaline-pumping battleground where your tactical skills and sharp wit are put to the test! In this thrilling game, you find yourself in a dynamic 2D environment, constantly on the move while facing a relentless enemy. But here&rsquo;s the twist: before you can take your shot, you must solve a mind-bending riddle cleverly placed between you and your target. Only by unraveling the riddle&rsquo;s secrets can you align your crosshairs and deliver a precise strike to eliminate your foe. you&rsquo;ll need lightning-fast reflexes, strategic thinking, and a knack for deciphering clues to emerge victorious.",
        "instructions": "Aim with the mouse cursor and shoot with the left button For Mobile Tap and hold to aim Release to shoot",
        "url": "https://html5.gamemonetize.com/u0ss0tdywly1w683rhu75mvfrpi64mvi/",
        "category": "Shooting",
        "tags": "Action, Hypercasual, Shoot, Shoot 'Em Up, Shooter, Shooting, Sniper, weapons",
        "thumb": "https://img.gamemonetize.com/u0ss0tdywly1w683rhu75mvfrpi64mvi/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "47249",
        "title": "Skibidi Toilet Shoot Out",
        "description": "Skibidi Toilet Shoot Out is super fun shooting game that you can play online for free. Its in HTMl5, No Need to Install it! The aim of the game is to shoot as many Skibidi Camerman as possible and make a highscore! Start playing and have fun!",
        "instructions": "Mouse or keyboard to play ",
        "url": "https://html5.gamemonetize.com/xfyxid84j269wdsllylsc044vd72mlzw/",
        "category": "Shooting",
        "tags": "Android, Arcade, Avoid, Boys, Hypercasual, Shoot, Shooting, Skibidi Toilet, Skill",
        "thumb": "https://img.gamemonetize.com/xfyxid84j269wdsllylsc044vd72mlzw/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "47213",
        "title": "Last World ",
        "description": "A 2D platform game is a type of video game where the main character navigates through a two-dimensional environment while avoiding obstacles and enemies. In this specific game, the main player is a young boy who is on a mission to escape the spell of witches and skeletons. There are 10 episodes in total, each one presenting new challenges and obstacles for the player to overcome. The young boy must avoid contact with the witches and skeletons, as touching them will result in game over. To navigate through the environment, the boy must be careful to avoid wooden and metal stakes that are scattered throughout the levels. These stakes can obstr",
        "instructions": "Up Right Left Arrow to move and to Shot the gun Click Left Mouse Button - By the way watch out for the witch and the skeleton",
        "url": "https://html5.gamemonetize.com/ddhn38ohhoqlfuamqme6y51ae2srjtqd/",
        "category": "Shooting",
        "tags": "1 Player, Action, Adventure, Boy, Game, World",
        "thumb": "https://img.gamemonetize.com/ddhn38ohhoqlfuamqme6y51ae2srjtqd/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "47209",
        "title": "Skibidi Toilets Attack ",
        "description": "Skibidi Toilet Attack game is a horror game with a character of Skibidi Toilet, and its also an action game. The game will take you to a faraway place where the Skibidi Toilet is haunting players around the world. Its an extremely scary yet enjoyable",
        "instructions": "Camera Rotation - Mouse Movement Player Movement - WASD or Arrows Shooting - Left mouse button Jump - Space",
        "url": "https://html5.gamemonetize.com/4izuw5dyxtlzwjwr8iqq04yln9zh4fy4/",
        "category": "Shooting",
        "tags": "3D, Action, Funny, Shooter, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/4izuw5dyxtlzwjwr8iqq04yln9zh4fy4/512x384.jpg",
        "width": "1920",
        "height": "1080"
    }
]