[
    {
        "id": "51145",
        "title": "Stretch huggy Monster",
        "description": "Navigate through the levels by extending the limbs of the character while steering clear of obstacles. Be cautious not to overstretch, as it may lead to tearing! Stretch Man offers an enjoyable and addictive puzzle gaming experience suitable for all. Whether you're looking for casual entertainment or a way to pass the time during moments of leisure, it's perfect for any occasion.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/wy6cwdoxnvmfqcu4cipvvvd755vvvgj2/",
        "category": "Stickman",
        "tags": "Boys, Monster, Puzzle, Quiz, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/wy6cwdoxnvmfqcu4cipvvvd755vvvgj2/512x384.jpg",
        "width": "600",
        "height": "800"
    },
    {
        "id": "51471",
        "title": "Stick Run Parkour",
        "description": "Single player infinity Run Funny Arcade Stickman Parkour Game by Baran Yel Super Cluster Hub. Coming Soon; Market Costumes Effects New Regions New Objectiles",
        "instructions": "W A S D - Movement P - Pause Space - Start",
        "url": "https://html5.gamemonetize.com/vlget2spakvpr60kgec5oup19mdex93p/",
        "category": "Stickman",
        "tags": "Arcade, Stickman",
        "thumb": "https://img.gamemonetize.com/vlget2spakvpr60kgec5oup19mdex93p/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51359",
        "title": "Shadow Stickman Fight",
        "description": "Shadow Stickman Fight is an awesome and intense 2D ninja survival arcade game. You have to survive the endless waves of enemies with stickman ninjas. Every time you pass a belt exam, you get the examiner's hat and weapon. You can use souls to trade items or earn gifts. You have to follow the white dots and hit the enemies. You have to time your attack when enemies are in your attack distance. You can also enter the arsenal and choose different equipment, like helmets and weapons.",
        "instructions": "On PC A move left D move right On Mobile Swipe or tap",
        "url": "https://html5.gamemonetize.com/wu5idx0ik1b7xyqv9k7a003a71f5kf6d/",
        "category": "Stickman",
        "tags": "2D, Boys, Fighting, Girls, Kids, Ninja, onetouch, Stickman",
        "thumb": "https://img.gamemonetize.com/wu5idx0ik1b7xyqv9k7a003a71f5kf6d/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "50907",
        "title": "Stickman Merge Battle: Arena",
        "description": "An exciting strategic merge game where you have to demonstrate your advantage over the red stickman invaders. Create your army of stickmen, show your wit in the formation of troops and defeat all bosses. Less than 1% percent of players are able to unlock all stickmen and complete the game. - 3D stickmen - Each level is harder than the previous one - Intuitive controls - Boss difficulty every ten levels - Tactical game for all ages",
        "instructions": "- Click Sword and arrow button to purchase units - Click Tile button to purchase tiles - Drag units between tiles to improve your strategic positioning - Merge two units of the same type to get the next tier unit",
        "url": "https://html5.gamemonetize.com/obyhafhugknxn37yy4vsed6yknb9d6rl/",
        "category": "Stickman",
        "tags": "1 Player, 3D, Action, Arena, Army, Battle, Bow, Clash, Enemy, Fight, Hypercasual, Management, Stickman, Strategy",
        "thumb": "https://img.gamemonetize.com/obyhafhugknxn37yy4vsed6yknb9d6rl/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "50462",
        "title": "Z Stick Duel Fighting",
        "description": "Join the ultimate stickman battle in Z Stick Duel Fighting, a game that will make you fight for glory. You will play as a stickman warrior who must face other stickmen from across the universe. You will use various skills and techniques to defeat them in a duel. You will also have to manage your mana, dodge their attacks, and strike them with a fatal blow. You will have the chance to try different skills and styles. You will also have to prove yourself as the stickman fighting king of the universe. Z Stick Duel Fighting is a game that will test your speed and strategy. Don't miss this exciting game!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/o7tw740jgsxamrx0frgto50sxzl3w79r/",
        "category": "Stickman",
        "tags": "2D, Avoid, Boys, Kids, Magic, Skill, Stickman",
        "thumb": "https://img.gamemonetize.com/o7tw740jgsxamrx0frgto50sxzl3w79r/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "50617",
        "title": "Stickman Miner",
        "description": "Embark on a lucrative journey beneath the earth in Stickman Idle Miner, a captivating mining simulator. Start with a humble pickaxe, chip away at mineral-rich veins, and uncover a variety of ores including coal, iron, gold, and diamonds. Sell the resources to make money. Refine raw minerals into valuable products to sell at peak prices. Expand your empire, upgrade your tools, grow your facilities, and transform your small enterprise into a global mining powerhouse.",
        "instructions": "Movement AWSD Arrow Keys Joystick",
        "url": "https://html5.gamemonetize.com/bhyewxjcbnyu7f32233fmpk6z7kaj9n6/",
        "category": "Stickman",
        "tags": "Crafting, Minecraft, Miner",
        "thumb": "https://img.gamemonetize.com/bhyewxjcbnyu7f32233fmpk6z7kaj9n6/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47841",
        "title": "Stickman Hot Potato",
        "description": "This is a pretty simple game: Throw a flaming hot potato to burn your opponents' hands instead of yours! It's like playing catch, but with a fiery twist. Just don't get caught holding the potato when the timer reaches 0, or you'll be feeling the heat! Four fast modes await you, two of which are 2-player. Compete against friends or family, or take on the CPU if you're flying solo. First to 1,000 points wins! For a unique challenge, try Hot Rings mode and race to destroy your opponent's rings. Use the four unique power-ups - cloak, freeze, clone, and slow motion - but remember to use them wisely!",
        "instructions": "Use arrow keys to move to the potato and toss it off your court If it stays in your court for over 3 seconds you'll be scored on",
        "url": "https://html5.gamemonetize.com/ohvhay9yre82sin5djnn1tpddc4dqamp/",
        "category": "Stickman",
        "tags": ".io, 1 Player, 2D, Highscore, Hypercasual, Stickman",
        "thumb": "https://img.gamemonetize.com/ohvhay9yre82sin5djnn1tpddc4dqamp/512x384.jpg",
        "width": "1280",
        "height": "480"
    },
    {
        "id": "50007",
        "title": "My Farm Empire",
        "description": "My Farm Empire is a fun and relaxing game that lets you create your own farm paradise on a beautiful island. You will become a farmer and grow various crops, from fruits and vegetables to flowers and herbs. You will also enjoy the stunning graphics, the smooth gameplay, and the rewarding progression system that will make you feel like a real farmer. My Farm Empire is more than just a game, it's a lifestyle. Join the My Farm Empire today and start your farming adventure.",
        "instructions": "Drag and swipe move",
        "url": "https://html5.gamemonetize.com/jvki4swvrqyby0veutogi7b2bpx57c6u/",
        "category": "Stickman",
        "tags": "Boys, Casual, Collecting, Farm, Food, Fruit, Girls, Kids, Stickman",
        "thumb": "https://img.gamemonetize.com/jvki4swvrqyby0veutogi7b2bpx57c6u/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "49283",
        "title": "Stickman Ninja Way of the Shinobi",
        "description": "Stickman - Ninja from the clan of Black Panthers enters the battle. Help him drive the invaders out of his house! Defeat your enemies with lightning strikes and combo attacks. Dodge enemy attacks with a roll. Upgrade your character so that you have the strength to defeat all enemies and free your house.",
        "instructions": "Control - Movement WASD - Roll Space - Sword Strike Left mouse click - Combo Attack Right mouse click Phone Tablet Use interface buttons",
        "url": "https://html5.gamemonetize.com/bbvs6yc7da25q92ogll0m4cfmuo4ymox/",
        "category": "Stickman",
        "tags": "Action, Adventure, Battle, Best Games, Ninja, Stickman",
        "thumb": "https://img.gamemonetize.com/bbvs6yc7da25q92ogll0m4cfmuo4ymox/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49274",
        "title": "Stickman fall",
        "description": "Hang between two pillars with plungers on a bar. When you press space, the plungers touch the pillars, halting your descent. Navigate a path filled with obstacles, ensuring you don't collide. Your goal? See how far you can descend without hitting any barriers. Ready to take the challenge?",
        "instructions": "1 Attach to the bar Space on the keyboard Left Mouse Click or Long Press on mobile devices 2 Descend while avoiding obstacles 3 Upon reaching the finish stop within the marked area",
        "url": "https://html5.gamemonetize.com/4nsbkbsthace3imqxe11zdymbiwnc2bg/",
        "category": "Stickman",
        "tags": ".io, 3D, 3D Games, Action, Casual, Fall Guys, Hypercasual, Stickman",
        "thumb": "https://img.gamemonetize.com/4nsbkbsthace3imqxe11zdymbiwnc2bg/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "20654",
        "title": "Crowd Stack Race 3D",
        "description": "Introducing the captivating and addictive Crowd Stack Race 3D, an enthralling new arcade game. Your objective is to gather individuals of identical skin tones across the entire platform. In this trending and highly sought-after game, your goal is two-fold: continue running and partake in a historical and poetic running competition. Time your jumps flawlessly and strive to reach higher levels. Accumulate as many individuals as possible, evading both collisions with persons of other ethnicities and various obstacles to prevent losing a life by falling from the edifice. Stay vigilant in collecting rewards and stars embellishing each platform.",
        "instructions": "Slide to play",
        "url": "https://html5.gamemonetize.com/xpfnix9kopuvgjltnh68zj6ce4gzip0g/",
        "category": "Stickman",
        "tags": "3D, Avoid, Casual, Collecting, Girl, Kid, running, Simulation, Stickman",
        "thumb": "https://img.gamemonetize.com/xpfnix9kopuvgjltnh68zj6ce4gzip0g/512x384.jpg",
        "width": "440",
        "height": "750"
    },
    {
        "id": "48429",
        "title": "Skibidi Stick",
        "description": "Stretch the stick the more you can to reach and walk on the platforms. Beware! If the stick is not long enough, Skibidi will fall down! Get yourself in the ninja action! How far can you go?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/5zkgqwll2oosqwi47higgp0eogc03dmm/",
        "category": "Stickman",
        "tags": "Casual, HTML, Mobile, Puzzle, Skibidi, Skibidi Toilet, Stickman",
        "thumb": "https://img.gamemonetize.com/5zkgqwll2oosqwi47higgp0eogc03dmm/512x384.jpg",
        "width": "1024",
        "height": "600"
    },
    {
        "id": "46927",
        "title": "Silly Dancer",
        "description": "Get ready to bust a move and show off your dance skills in this high-energy hypercasual game! Tap to the rhythm and keep up with the catchy beats as you navigate through a variety of vibrant and visually stunning dance environments. With its addictive gameplay and lively music, this game will have you grooving and striving to achieve the highest score on the dancefloor",
        "instructions": "press keyboard arrow buttons when ui arrow in circle",
        "url": "https://html5.gamemonetize.com/zhthunzg2jyv86mnhyfqdbqj3n11v5wc/",
        "category": "Stickman",
        "tags": "Dancing, Music",
        "thumb": "https://img.gamemonetize.com/zhthunzg2jyv86mnhyfqdbqj3n11v5wc/512x384.jpg",
        "width": "540",
        "height": "960"
    }
]