[
    {
        "id": "52207",
        "title": "Guardians of the Dark Dungeon",
        "description": "Are you a true warrior? Put your shooting prowess to the test with war simulator games and delve into the realm of dungeons and dragons. Brace yourself for an exhilarating battle! Stay vigilant against enemy assaults and gear up for the ultimate showdown in war simulator games. Are you up for the most demanding fight of your existence in dungeons and dragons? Equip yourself and push your limits by engaging in war simulator games. Get ready for an adrenaline-fueled adventure. Are you in the mood for action? <a href='https://www.bestcrazygames.com/home/keyword/dinosaurs'>https://www.bestcrazygames.com/home/keyword/dinosaurs</a>",
        "instructions": "Mouse click to attack and use other buttons special to attack by clicking with the mouse in the game WASD is to walk ",
        "url": "https://html5.gamemonetize.com/myfjikexavuq54mb13hi89070p4qx7ja/",
        "category": "Action",
        "tags": "Dungeon, Fight, Mentolatux, unity, War, WebGL",
        "thumb": "https://img.gamemonetize.com/myfjikexavuq54mb13hi89070p4qx7ja/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "52200",
        "title": "Granny Returns Haunted House",
        "description": "Play this chilling 3D game Granny Returns Haunted House this game is the continuation of the famous Granny game, a horror game, escape, shoot, collect items. This time you will appear inside an abandoned asylum, you will have some clues to complete and survive. Move around the asylum, dont stop moving because they will find you at any moment. If you dont have time, you can hide in the closets and not make noises.",
        "instructions": "Controls W A S D to walk around Mouse to Look around Left Mouse Button to Fire Right Mouse Button to Aim Mouse Wheel To Change Weapons G for Grenades R to Reload F to Pickup Items Left Shift to Run Left CTRL to Crouch X to Prone V to Melee Space to Jump",
        "url": "https://html5.gamemonetize.com/pm5wjn3np4xl59y8ie3a85xqs1m1nyma/",
        "category": "Action",
        "tags": "Escape, Horror, run, Shooting",
        "thumb": "https://img.gamemonetize.com/pm5wjn3np4xl59y8ie3a85xqs1m1nyma/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "52154",
        "title": "Secret Key",
        "description": "you are a man have ur wife and daughter are gone but you dont know what happen it was you the reason of that ? or maybe you are just inside a dream ,, you cant know that but there a 3 since inside the game maybe you will understand what happen 2 of them are bad for you and the last maybe is just another mastery for another story line",
        "instructions": "WASD Move move mouse Space jump E interactions left ctrl crouch Q to hide puzzles or camera",
        "url": "https://html5.gamemonetize.com/cevjm8tbypn2u4i9kato9lwllqzowxjo/",
        "category": "Action",
        "tags": "1 Player, Action, Anime, Brain, First Person Shooter, House, Puzzle",
        "thumb": "https://img.gamemonetize.com/cevjm8tbypn2u4i9kato9lwllqzowxjo/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50000",
        "title": "Swordbattle.io",
        "description": "Swordbattle.io is a multiplayer game where players fight each other with different 2D swords, and try to gain coins. The more coins you have, the bigger and powerful you get! Try to become the biggest of them all. Upgrade your character, fight with friends, and rule the land!",
        "instructions": "Mouse mode default - click to swing right click to throw and move your mouse to move amp point Keyboard mouse - WASD or Arrow keys to move click and point mouse to swing and C to throw sword Enter - chat with other players please be nice ",
        "url": "https://html5.gamemonetize.com/m2yzvbmyf75dl11i5lrtzlykjkzrgb85/",
        "category": "Action",
        "tags": ".io, .io Games, 2 Player, 2D, Action, Adventure, Arcade, Arena, Battle, Boys, Clash, Fun, IO, Sword",
        "thumb": "https://img.gamemonetize.com/m2yzvbmyf75dl11i5lrtzlykjkzrgb85/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "52111",
        "title": "Car Smash",
        "description": "Let an action-packed driving pleasure begin in the Car Smash game! Choose your car. Go full throttle down the high ramp. After jumping off the cliff at the end of the ramp, you first rise into the clouds. After your car falls to the ground, you start drifting. The farther you drift, the more points you earn. Who knows how exciting it is to fly and drive all over the",
        "instructions": "Up Arrow Key Throttle Down Arrow Key Brake",
        "url": "https://html5.gamemonetize.com/h3b24m8uiyxmg3pz3vkfcea9887j53wm/",
        "category": "Action",
        "tags": "Action, Boy, Boys, Car, Cars, Racing",
        "thumb": "https://img.gamemonetize.com/h3b24m8uiyxmg3pz3vkfcea9887j53wm/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "51941",
        "title": "Nuke Continent Fight",
        "description": "In the adrenaline-pumping video game Nuke Continent Fight, players are thrust into a post-apocalyptic world where they must battle for survival in a desolate wasteland. Armed with an array of weapons and tactical skills, gamers engage in intense multiplayer combat as they vie for control of vital resources and strategic locations. With stunning graphics and immersive gameplay, Nuke Continent Fight offers an unparalleled gaming experience, where strategy and teamwork are key to victory in this dystopian battlefield. Website Developer <a href='https://www.game-plays.com/'>https://www.game-plays.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/9s15hu7763srdi2hfmsbu8tcpgjrfazs/",
        "category": "Action",
        "tags": "Action, Arcade, Fighting, Multiplayer, Shooting, Strategy",
        "thumb": "https://img.gamemonetize.com/9s15hu7763srdi2hfmsbu8tcpgjrfazs/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51301",
        "title": "Mass Sink",
        "description": "Will you rush to the end or will you prefer to clean everything up on your way? Move your character and make all the enemies fall down.",
        "instructions": "Use W AS D or Arrow Keys to Move and Space to Shoot ",
        "url": "https://html5.gamemonetize.com/u5hhlak7rg5b69uwako4v9cnw51nt2ge/",
        "category": "Action",
        "tags": "1 Player, 3D Games, Avoid, Kill, Stickman",
        "thumb": "https://img.gamemonetize.com/u5hhlak7rg5b69uwako4v9cnw51nt2ge/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48837",
        "title": "Head Soccer 2D 2023",
        "description": "In the world of 2D games, Head Soccer stands out as a unique and exciting Players take control of cartoonish characters with oversized heads as they engage in thrilling soccer matches. The objective is simple: use your head to score goals while preventing your opponent from doing the same. Its a fast-paced and entertaining game that combines soccer skills with wacky physics for hilarious results. Website Developer <a href='https://www.bestcrazygames.com/home/keyword/adventure'>https://www.bestcrazygames.com/home/keyword/adventure</a>",
        "instructions": "WASD move and SPACE to jump",
        "url": "https://html5.gamemonetize.com/t9wdukh7cv54thssreth3vmh6f6s120c/",
        "category": "Action",
        "tags": "2D, Android, Football, HTML5, Mentolatux, Mobile, Soccer, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/t9wdukh7cv54thssreth3vmh6f6s120c/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51247",
        "title": "StickMan Angle Fight ",
        "description": "Weapons at the ready, and away we go! This is Angle Fight 3D, and it&rsquo;s to you to fight the enemies and win the game. Grab your swords, weapons, and more and strike your best battle pose. Aim right and true, and you will win this fight and beat your enemy. Are you ready to take on the challenge in Angle Fight 3D? We bet you are!",
        "instructions": "Use Left Mouse Button To Set Points ",
        "url": "https://html5.gamemonetize.com/1r11ygneka6bu6iy7cnhj2x1wqznwree/",
        "category": "Action",
        "tags": "1 Player, Action, Adventure, Fight, Fighting, Kill, Skill, Sword",
        "thumb": "https://img.gamemonetize.com/1r11ygneka6bu6iy7cnhj2x1wqznwree/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51824",
        "title": "Boxing Gang Stars",
        "description": "The stars are in the boxing ring and it is time to fight! These funny boxing characters are trying to destroy each other either in 1 player or in 2 player mode. Start this boxing competition and become the king of the boxing rings! Super fun physics with fun characters is waiting for you! Let the box fights begin!",
        "instructions": "Player 1 Move W A S D or ARROW KEYS 1P Mode only Punch F G T Block E Player 2 Move ARROW KEYS Punch K L O Block I",
        "url": "https://html5.gamemonetize.com/e0wtz9mesz8tuebf28ykoggtieokpc74/",
        "category": "Action",
        "tags": "1 Player, 2 Player, 2 Player Games, 3D, Action, Best Games, Boxing, Fight, Fighting, HTML5",
        "thumb": "https://img.gamemonetize.com/e0wtz9mesz8tuebf28ykoggtieokpc74/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51799",
        "title": "Home Rush The Fish Fight",
        "description": "Engage in an epic battle between Human and The Fish. Your task is straightforward: drag and hold to guide the Human to the spot where they can defeat The Fish. Dodge obstacles and formidable foes on the way. Destroy the fish, and return to the starting point. Keep in mind, only humans of the same color can defeat The Fish. Enjoy numerous captivating levels with varying difficulty, impressive 3D graphics, diverse characters, and accessible controls for all ages. Sharpen your puzzle-solving skills while having fun! Website Developer <a href='https://www.bestcrazygames.com/updated'>https://www.bestcrazygames.com/updated</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ap5dut3zw93jv7d9lobil3vzb9qivuw6/",
        "category": "Action",
        "tags": "Action, Click, Fish, HTML, iPad, iPhone, Mentolatux, Mobile, Monster, Unity3D",
        "thumb": "https://img.gamemonetize.com/ap5dut3zw93jv7d9lobil3vzb9qivuw6/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51791",
        "title": "Western Fight",
        "description": "In this western themed game you can fight to the fullest with 8 different characters. With 2 player game mode you can fight with your friends, with 1 player game mode you can have fun with the AI in the game even if you are alone. The aim of the game is to win 2 rounds before your opponent. Fighting with the AI in the game is not as easy as you think, start playing and test yourself",
        "instructions": "---PLAYER 1--- Move WASD Punch V Kick B ---PLAYER 2--- Move Aroow Keys Punch O Kick P ",
        "url": "https://html5.gamemonetize.com/9f7qkh40776qe0qg8sac6rdfxqy78rag/",
        "category": "Action",
        "tags": "2 Player, 2 Player Games, 3D, 3D Games, Action, Fight, Fighting, free games for your website, free html5 games for your website, Street Fighting, WebGL",
        "thumb": "https://img.gamemonetize.com/9f7qkh40776qe0qg8sac6rdfxqy78rag/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "48961",
        "title": "Ant Flow",
        "description": "Introducing Ant Flow, a laid-back puzzle game where your creativity takes the lead. Put your finger to work as you sketch lines to construct a path guiding the industrious ants to their nourishment. Your mission? Assist these diligent ants in transporting their bounty back to their nest. Navigate the puzzle, sidestep obstacles, and claim victory. This game is your chance to put your intellect to the test and conquer the challenges that lie ahead.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/b1yo52tt3j7ddjz947m31yas14dnrcsw/",
        "category": "Action",
        "tags": "Android, Animal, HTML5, Mentolatux, Mobile, unity, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/b1yo52tt3j7ddjz947m31yas14dnrcsw/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51328",
        "title": "Vegas City Gangster 2024",
        "description": "Vegas City Gangster 2024 is an action-packed gaming experience set in the neon-lit streets of Las Vegas. Players become ruthless gangsters, armed with a vast array of weapons, stylish costumes, and exotic cars. Engage in intense shootouts, daring missions, and high-speed street races while collecting valuable loot. This open-world adventure lets you shape your criminal empire in the year 2024, where only the strongest survive in Sin City. Website Developer <a href='https://in.bestcrazygames.com/'>https://in.bestcrazygames.com/</a>",
        "instructions": "Game Controlls WASD Walk MouseLeft Fire MouseRight Aim TAB Menu F enter car",
        "url": "https://html5.gamemonetize.com/aannaasrcot1y6q0g667wiu0se7uw0vt/",
        "category": "Action",
        "tags": "Driving, gta, Mentolatux, Racing, Shooting, Unity3D",
        "thumb": "https://img.gamemonetize.com/aannaasrcot1y6q0g667wiu0se7uw0vt/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51187",
        "title": "Road Train Truck Driving",
        "description": "Embark on an epic journey with Road Train Truck Driving, a game that redefines the truck driving experience. Navigate through diverse landscapes, managing a road train with skill and precision. This game tests your driving prowess and strategic planning as you haul cargo across challenging routes. Perfect for enthusiasts of heavy vehicles and long-haul adventures. Website Developer <a href='https://pl.bestcrazygames.com/'>https://pl.bestcrazygames.com/</a>",
        "instructions": "wasd to drive and C change camera truck",
        "url": "https://html5.gamemonetize.com/5p2jc96vj1iob0u0gxy3bwimlg4uyu2v/",
        "category": "Action",
        "tags": "Driving, Level, Levels, Mentolatux, Truck, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/5p2jc96vj1iob0u0gxy3bwimlg4uyu2v/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51628",
        "title": "Flappy Helicopter 2 Player",
        "description": "Are you up for a two-player helicopter battle? To win in the helicopter battle, you must be the one who detonates the most. Engage in combat with your friend and emerge victorious. The one who detonates the most helicopters wins. The player who explodes 10 times loses. Remember, its not just bullets; if you fly too high and hit the ground or the sky, youll explode. Are you up for the duel with your friend?",
        "instructions": " To use the red helicopter press the W key To use the blue helicopter press the Up Arrow Key The first to reach 10 points wins ",
        "url": "https://html5.gamemonetize.com/e7vkuajbnz1xyubq4y7sx3onnwdd8vri/",
        "category": "Action",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Android, Helicopter, Mobile, Pixel",
        "thumb": "https://img.gamemonetize.com/e7vkuajbnz1xyubq4y7sx3onnwdd8vri/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51553",
        "title": "FoodHead Fighters",
        "description": "Select one of the characters in the game and control their movements to fight against other characters in the street. Each one has a stronger level; try to beat each one, and you will get many rewards that will help you improve your fighting skills or even buy new ones. skin. Beat each level, and you can increase the difficulty level of the game. Each new player has unique skills, but the levels are also much more dangerous. Website Developer <a href='https://kiz10.com/'>https://kiz10.com/</a>",
        "instructions": "Controls WASD or keyboard arrows to move Spacebar to jump z hit x grab c kick v Defend yourself",
        "url": "https://html5.gamemonetize.com/95rpyg86xtlqy4a68ahmdzbs8sgrwmfr/",
        "category": "Action",
        "tags": "3D Games, Fighting, kiz10, Street Fighting",
        "thumb": "https://img.gamemonetize.com/95rpyg86xtlqy4a68ahmdzbs8sgrwmfr/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48826",
        "title": "Ball Roll Color 2048",
        "description": "Immerse yourself in the enchanting world of 2048 Ball Roll and Color, a delightful casual game that promises simplicity and magic. Your mission is to guide the ball, rolling and skillfully merging it along the way, all in pursuit of the coveted 2048 target. With a staggering 256 levels to conquer, each filled with diverse terrains and cleverly placed obstacles, every moment presents a fresh challenge. As you embark on this captivating journey, you wont be alone&mdash;join fellow players from across the globe for a shared experience of fun and competition. Website Developer <a href='https://vi.bestcrazygames.com/'>https://vi.bestcrazygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/oywnmk73nvmuit0lg4cf1tzrnqz2hhix/",
        "category": "Action",
        "tags": "3D Games, Ball, Mentolatux, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/oywnmk73nvmuit0lg4cf1tzrnqz2hhix/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51327",
        "title": "City Idle Counter Terrorists",
        "description": "City Idle Counter Terrorists is an exhilarating mobile game that combines strategy and action. In this game, you take on the role of a skilled counter-terrorist operative tasked with neutralizing threats in various urban settings. With stunning graphics and realistic gameplay, youll engage in intense missions, defuse bombs, and outsmart terrorists. As you progress, unlock new weapons and equipment to enhance your capabilities. Join forces with friends or go solo to become the ultimate hero in the fight against terror. City Idle Counter Terrorists offers non-stop excitement and challenges for gamers seeking adrenaline-pumping adventures.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/j8bfd7sm70mulmgjpz4p42zxmziwo1j6/",
        "category": "Action",
        "tags": "Click, Hypercasual, Mentolatux, Shooting",
        "thumb": "https://img.gamemonetize.com/j8bfd7sm70mulmgjpz4p42zxmziwo1j6/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50594",
        "title": "Do it up!",
        "description": "Do it up! - and nothing else! If, at times, you don&rsquo;t understand what&rsquo;s going on around you, then here you&rsquo;ll definitely understand everything - this is the place for you! At your disposal is a small town in which you can run, jump and walk. Move, have fun and remember - only up!",
        "instructions": "The movements are simple and intuitive - space - jump - double space - jump higher - W - forward - A - left - D - right - S - back You can also control the direction of the character using the arrows on the keyboard ",
        "url": "https://html5.gamemonetize.com/uzfcnljj41esn7da6t7drxsm49542qcl/",
        "category": "Action",
        "tags": "3D, 3D Games, city, Highscore, jump, Jumping, OnlyUp, Physics, Race, run, running, unity, Unity3D",
        "thumb": "https://img.gamemonetize.com/uzfcnljj41esn7da6t7drxsm49542qcl/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51322",
        "title": "Digital Circus Run And Shoot",
        "description": "Digital Circus Run and Shoot is an exhilarating and fast-paced mobile game that combines the excitement of a circus with the thrill of endless running and intense shooting action. In this game, players step into the shoes of a fearless circus performer who must navigate a vibrant and dynamic digital circus world filled with challenging obstacles and relentless enemies. Website Developer <a href='https://tr.bestcrazygames.com/'>https://tr.bestcrazygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/rs8faex0q7ezzowpiebs6sc38p6694qu/",
        "category": "Action",
        "tags": "Ball, circus, digital circus, Mentolatux, run, running, Shooting",
        "thumb": "https://img.gamemonetize.com/rs8faex0q7ezzowpiebs6sc38p6694qu/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51138",
        "title": "Digital Circus Town Builder",
        "description": "Digital Circus Town Builder is a captivating simulation game that combines the charm of a circus with the excitement of urban planning. In this immersive virtual world, players take on the role of a town mayor tasked with creating a one-of-a-kind circus-themed town. Build and customize your towns infrastructure, from colorful big tops to thrilling amusement rides, all while managing resources and keeping your citizens entertained. Website Developer <a href='https://th.bestcrazygames.com/'>https://th.bestcrazygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/0dsaue1r2dagl67ozh94a6kl1ixpb6yh/",
        "category": "Action",
        "tags": "Android, build, builder, building, circus, digital circus, HTML5, html5 games, iPad, iPhone, Mentolatux, Mobile",
        "thumb": "https://img.gamemonetize.com/0dsaue1r2dagl67ozh94a6kl1ixpb6yh/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50841",
        "title": "Box Journey",
        "description": "Dive into the enchanting realm of Box Journey, a platformer masterpiece that seamlessly weaves together precision gameplay and an immersive storyline. Take control of a plucky box on a quest to unlock the secrets of a fantastical world. Navigate through beautifully crafted landscapes, each brimming with perilous platforms, ingenious traps, and mysterious portals.",
        "instructions": "Touch and keyboard arrow keys",
        "url": "https://html5.gamemonetize.com/ishxj3g645r21row09pmg5pz88qhgcc7/",
        "category": "Action",
        "tags": "1 Player",
        "thumb": "https://img.gamemonetize.com/ishxj3g645r21row09pmg5pz88qhgcc7/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "51027",
        "title": "Duel Time",
        "description": "Are you ready for a competitive duel? Fight against the computer with your friend or alone! Start the fun with multiple game modes and maps!",
        "instructions": "Player 1 W A D Movement S Block R Change Weapon Space Attack Player 2 Arrow Keys Movement Down Arrow Block O Change Weapon P Attack",
        "url": "https://html5.gamemonetize.com/fh2qwe2glfh2n9pqdo995mi1p8fe66ch/",
        "category": "Action",
        "tags": "1 Player, 2 Player, 2D, Action, Battle, Block, Pixel, Platform",
        "thumb": "https://img.gamemonetize.com/fh2qwe2glfh2n9pqdo995mi1p8fe66ch/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "45645",
        "title": "Circle Shooter Master",
        "description": "Circle Shooter Master is a cool and exciting game about destroying the boss in the circle. You run in circles, shoot the boss, get materials, build towers, defend roadblocks and grab things that fall on the circle. You have to watch out for the boss&rsquo;s attack and kill him before he hurts you. Join the game now!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/a858jiqhd9wu39oh88ckoc8alcydiw4k/",
        "category": "Action",
        "tags": "3D, Avoid, Boys, Kids, Shoot 'Em Up, weapons",
        "thumb": "https://img.gamemonetize.com/a858jiqhd9wu39oh88ckoc8alcydiw4k/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "50898",
        "title": "Digital Circus Hide And Seek",
        "description": "For the digital circus hide and seek scene, envision a whimsical, futuristic digital circus setting. In the foreground, a group of children, each with distinct, vibrant outfits, are playing hide and seek. One child, wearing a neon green hat and a bright blue coat, is counting against a futuristic, holographic carousel, eyes covered. Around the carousel, other children are hiding: one is crouched behind a digitally animated lion, another is peeking from behind a cluster of shimmering, holographic balloons, and a third. Website Developer <a href='https://tl.bestcrazygames.com'>https://tl.bestcrazygames.com</a>",
        "instructions": "WASD - walk MOUSE - look around SHIFT - run SPACE - jump On mobile use button from the screen to fun ",
        "url": "https://html5.gamemonetize.com/6c2s2pyxe65icdkse5t4svr0ihact3yi/",
        "category": "Action",
        "tags": "Android, circus, digital circus, First Person Shooter, fps, Hidden, Horror, HTML5, iPad, iPhone, Mobile, run",
        "thumb": "https://img.gamemonetize.com/6c2s2pyxe65icdkse5t4svr0ihact3yi/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "43911",
        "title": "Raccoon Retail",
        "description": "Oopsy! Clumsy customers are making a big mess and its your job to keep the supermarket clean. Drive around, collect trash and empty it in the dumpster. The faster you clean to more money you earn. Upgrade your retail store to increase your revenue.",
        "instructions": "Drive around with WASD or arrow keys You can switch the view by clicking the camera icon in the top ",
        "url": "https://html5.gamemonetize.com/uarwfpfzlcz414mq41kf3g82b5mpwxy1/",
        "category": "Action",
        "tags": "1 Player, 3D, 3D Games, Action, Animal, Arcade, Business, Cartoon, Casual, Cleaning, Driving, Funny, Hypercasual, Management, Mobile, Racing, Relaxation, Restaurant, Slither",
        "thumb": "https://img.gamemonetize.com/uarwfpfzlcz414mq41kf3g82b5mpwxy1/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50863",
        "title": "Duel of Builders",
        "description": "Duel of Builders is a great dueling game. You can fight with your friend or against the computer! Are you ready for this fun duel?",
        "instructions": "Player 1 W A S D Movement R Change Weapon Space Attack Player 2 Arrow Keys Movement O Change Weapon P Attack",
        "url": "https://html5.gamemonetize.com/hhqdm1lz6isab49dpaaaecxxkr465hs0/",
        "category": "Action",
        "tags": "1 Player, 2 Player, 2D, Action, Pixel, Platform",
        "thumb": "https://img.gamemonetize.com/hhqdm1lz6isab49dpaaaecxxkr465hs0/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "47257",
        "title": "Fruit Survivor",
        "description": "Fruit Survivor is a cool and exciting 3D cartoon survival arcade game. You play as a gardener who is attacked by fruit monsters. You have to fight your way out and destroy them with different weapons. I recommend choosing the blender and maxing it out first. It can deal with many strong enemies effectively. You can also experiment with different weapon combinations to challenge yourself with harder levels. Enjoy hunting fruit monsters!",
        "instructions": "On PC and Mobile Hold and drag move Tap the buttons select upgrade weapons",
        "url": "https://html5.gamemonetize.com/8wa28ov2va942vruzbs1nhsb677t9xek/",
        "category": "Action",
        "tags": "3D, Boys, Collecting, Food, Fruit, Monster",
        "thumb": "https://img.gamemonetize.com/8wa28ov2va942vruzbs1nhsb677t9xek/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "50876",
        "title": "Hide Yellow Monster Survivor",
        "description": "In Hide Yellow Monster Survivor the players objective is to evade the multicolored monster and avoid capture. The game challenges you to gather various items and return them to the safe haven before time runs out. Website Developer <a href='https://es.kizi10.org'>https://es.kizi10.org</a>",
        "instructions": "WASD walk SPACE jump TAB menu",
        "url": "https://html5.gamemonetize.com/cq9g5sy0znk698z5g2cveytmvootezvl/",
        "category": "Action",
        "tags": "Action, Baby, Baby Games, Collecting, Mentolatux, run, Skill, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/cq9g5sy0znk698z5g2cveytmvootezvl/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50663",
        "title": "Dangerous room",
        "description": "A game where you control with the arrow keys and jump with space and your objective is to get the most points (Tip: If you pick up the box the final value and time is multiplied by the number of boxes)",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/znwwsrbuw2zmgopa9a3m7obtil0tlqyg/",
        "category": "Action",
        "tags": "1 Player, 3D, HTML5",
        "thumb": "https://img.gamemonetize.com/znwwsrbuw2zmgopa9a3m7obtil0tlqyg/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50867",
        "title": "Flag War",
        "description": "Are you ready to fight with your friend? Fight with your friend and reach victory. The best player from the blue team and the red team wins. Swords are drawn; its time to kill each other. Kill your enemy and reach the flag. Capture the flag and win the victory. The one that stands by the flag the most wins. Drop the flag and win.",
        "instructions": " Use the WASD keys to move the red player Use the S key to attack with the sword Use the Arrow Keys to move the blue player Use the Down Arrow key to attack with the sword Wait in the flag area for 20 seconds and win ",
        "url": "https://html5.gamemonetize.com/myppy1v163f8jyz8krwxw15r9q9dr3r9/",
        "category": "Action",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Arcade, Arena, Battle, Interactive",
        "thumb": "https://img.gamemonetize.com/myppy1v163f8jyz8krwxw15r9q9dr3r9/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50854",
        "title": "Angry Goat Revenge HTML5",
        "description": "An open-world game where you embody an irate goat in a bustling city. Utilize wild goat abilities, headbutt foes, and fling them with incredible goat powers. Real Goat Simulator Free offers an action-packed adventure, smashing through the city as a genuine goat, leaping and causing chaos. Website Developer <a href='https://el.kizi10.org'>https://el.kizi10.org</a>",
        "instructions": "WASD control the goat TAB menu SPACE jump MOUSE LEFT attack and for mobile browser use the button UI from the screen",
        "url": "https://html5.gamemonetize.com/na0ipe33nzdxal7krux7bp8mkch2kwsw/",
        "category": "Action",
        "tags": "Action, Android, Animal, goat, HTML5, iPad, iPhone, Mentolatux, Mobile, run, running, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/na0ipe33nzdxal7krux7bp8mkch2kwsw/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50182",
        "title": "SuperHero 2023",
        "description": "Welcome to an exhilarating new adventure in the world of flying iron superheroes! Unlike other action games such as rope hero or flying hero games, this cutting-edge iron hero action game of 2023 stands out as the ultimate experience for mastering superhero skills to safeguard the crime-ridden streets of Vegas from menacing gangster mafias. In this immersive third-person game, navigate through the bustling gangster crime city environment, showcasing your prowess as you drive various stunt cars and sport bikes. Embark on a mission to rescue hostages, transform into a superhero, and thwart the nefarious plans of criminals across town.",
        "instructions": "Walk WASD Jump Space Block Enemy Mouse Left Click Minimap Open E Punch Mouse Right Click amp Number1 Fire Attack Number2 Trail Effect Number3 Sprite Right Shift Flying Jump x Rolling Q",
        "url": "https://html5.gamemonetize.com/jz7vv2ffyaeddghppumvm6la0bjov1i6/",
        "category": "Action",
        "tags": "Action, Adventure, Fighting, Fun, Super, Superhero",
        "thumb": "https://img.gamemonetize.com/jz7vv2ffyaeddghppumvm6la0bjov1i6/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50789",
        "title": "Ragdoll Arena 2 Player",
        "description": "Ragdoll Arena 2 Player consists of 14 super cool and challenging 2 player games. You can play these games in either 1 player or 2 player modes. Each game you will have a different goal but your main goal is to score three before your opponent. The games consist of fruit slicing, hammer challenge, chicken catching, rooftop shooting matches, and more. You can also customize your character from the shop. Earn coins from the matches and buy new costumes for your character.",
        "instructions": "Player 1 Move W A S D or ARROW KEYS If Playing Single Jump Shoot G Player 2 Move ARROW KEYS Jump Shoot P",
        "url": "https://html5.gamemonetize.com/ympogr90zckrhth1abu4t2c0j3f3c65w/",
        "category": "Action",
        "tags": "2 Player, 3D, Action, Arcade, Battle, Boxing, Casual, Chicken, Fight, Fighting, HTML5, hunter, Matching, Shooting",
        "thumb": "https://img.gamemonetize.com/ympogr90zckrhth1abu4t2c0j3f3c65w/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50206",
        "title": "Super Runner 3d Game",
        "description": "Super Runner 3d is a 3D running game. Take control of your stickman and race against the crowd. You can run, dash or jump from rooftop to rooftop! Run over the glowing speed bumpers to gain momentum and do vaults and flips to show off your style. There are daily challenges, power-ups, and even glamorous accessories for you to create a stickman that looks like no other. Take your running game to next level with Parkour Race!",
        "instructions": "Use A D or Left and Arrow Keys to Move",
        "url": "https://html5.gamemonetize.com/swov3o7f8jo3inwleep867xn3bzgf1y2/",
        "category": "Action",
        "tags": ".io, Action, Fun, Stickman, Stunts",
        "thumb": "https://img.gamemonetize.com/swov3o7f8jo3inwleep867xn3bzgf1y2/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50710",
        "title": "Bike Stunts Pro HTML5",
        "description": "Engage in thrilling super bike stunt races against friends or random online opponents &ndash; its an unmatched experience! Gain mastery over your bike, assess upcoming stunts or massive ramps, and stay vigilant of competitors aiming to overtake you for the ultimate biking triumph. Not all moments call for full-throttle action; some stunts demand careful deliberation and strategic thinking. Website Developer <a href='https://vi.kizi10.org'>https://vi.kizi10.org</a>",
        "instructions": "WASD Dive C camera and for mobile users use button from the game",
        "url": "https://html5.gamemonetize.com/v9jayb60n11w8sg409kifm8orsum76cf/",
        "category": "Action",
        "tags": "Action, Android, Bike, HTML5, iPad, iPhone, Mentolatux, Mobile, Motorcycle, Stunts, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/v9jayb60n11w8sg409kifm8orsum76cf/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50696",
        "title": "Scooter Brothers",
        "description": "Gather the keys of the scooter with your friend, collect the barrels, and escape from the police.Escape from the police, whatever you do, dont get caught by them.",
        "instructions": " Collect all the badges activate the Black Hole Playable on both desktop and mobile Jump by pressing the W key and the Arrow up key ",
        "url": "https://html5.gamemonetize.com/2ht1jwm5vwhx1s17iytiqmp27df8k7u4/",
        "category": "Action",
        "tags": "2 Player, 2 Player Games, Action, Adventure, Animal, Arcade, Arena",
        "thumb": "https://img.gamemonetize.com/2ht1jwm5vwhx1s17iytiqmp27df8k7u4/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50701",
        "title": "Building construction",
        "description": "A game where you have to stack building layers and make the tallest building in the city , and if youre good you can try to do 50 floors without ads.",
        "instructions": "Mouse click or space to place floor",
        "url": "https://html5.gamemonetize.com/0pxd94iawcq5djp4gga1xhn2z08vbbnq/",
        "category": "Action",
        "tags": "1 Player, 3D, Action",
        "thumb": "https://img.gamemonetize.com/0pxd94iawcq5djp4gga1xhn2z08vbbnq/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50676",
        "title": "Soccer Championship 2023 HTML5",
        "description": "Rewrite: Experience the thrill of football and soccer games as a budding hero in offline football matches. Take on the world football team manager and mobile football player role. In the exciting new football games 2023, test your skills in the Hero Tournament and the Club Football League Championship. Compete against your opponents in striking, passing, and scoring goals. After each challenging match in these offline football and soccer games in 2023. Website Developer <a href='https://www.bestcrazygames.com'>https://www.bestcrazygames.com</a>",
        "instructions": "WASD to walk K sprint N short pass press SPACE shoot M long pass On mobile device use the button from the game ",
        "url": "https://html5.gamemonetize.com/pcjz3wh0nk5vdc626avfw2qf8pq4vsk2/",
        "category": "Action",
        "tags": "Action, Android, Football, HTML5, iPad, iPhone, Mentolatux, Mobile, run, Skill, Soccer",
        "thumb": "https://img.gamemonetize.com/pcjz3wh0nk5vdc626avfw2qf8pq4vsk2/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49826",
        "title": "Merge Digital Circus vs Toilet",
        "description": "Explore the enchanting realm of Merge Digital Circus within the exciting Merge Toilet Monster Battle - a unique toilet gaming experience! Combine your apprehensive creatures to advance their forms and claim dominance with the most formidable army in your neighborhood. You must employ your strategic thinking and wit to triumph in the monster toilet battle games against the formidable Merge Digital Circus toilet. Swiftly evolving your monsters is imperative to amass a colossal army, ensuring your victory in this epic monster showdown! Website Developer <a href='https://tl.kizi10.org'>https://tl.kizi10.org</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/7czenc9qf3qtdyejc62009k9wat5xh87/",
        "category": "Action",
        "tags": "Action, Android, Click, HTML5, iPad, iPhone, Mentolatux, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/7czenc9qf3qtdyejc62009k9wat5xh87/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50637",
        "title": "Fish Stab Getting Big",
        "description": "This adventure takes place in the oceans depths with the dangerous fishes of all times in the Fish Stab Getting Big game! These fishes have knives in their mouth and they are trying to kill each other with it. Try to kill as many as fishes and try to make your fish the biggest in the ocean. Each kill will give you a score and you and your sword will grow according to it. You can embark on this adventure with your friend in 1 Player and 2 Player game mode. Pick your game mode and fish, and let the action begin in the ocean.",
        "instructions": "Player 1 Move W A S D Boost C Player 2 Move ARROW KEYS Boost L",
        "url": "https://html5.gamemonetize.com/s43t6t4u4vi2bxo4w061myb5jrbnr5e0/",
        "category": "Action",
        "tags": "2 Player, 2 Player Games, 2D, Action, Animal, Arcade, Arena, Battle, Casual, Fish, Fishing, HTML5, Skill",
        "thumb": "https://img.gamemonetize.com/s43t6t4u4vi2bxo4w061myb5jrbnr5e0/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49824",
        "title": "Bus Stunt 3D Simulator 2024",
        "description": "Bus Stunt 3D Simulator 2024 is a driving stunt game where you need to drive carefully and complete each level; for each new level, the difficulty will be increased, and more and more will go to the finish. This incredible stunt bus game will be fun with a quality, realistic environment and fun on PC, mobile, Android, or iPhone. Twenty levels are waiting for you to drive like crazy on this bus. Website Developer <a href='https://ar.kizi10.org'>https://ar.kizi10.org</a>",
        "instructions": "For pc use WASD and SPACE to drive and for mobile use the button inside the game ",
        "url": "https://html5.gamemonetize.com/6oast3vyx8wjv2o4c44tdsczn3kexdpq/",
        "category": "Action",
        "tags": "Android, bus, Driving, HTML5, iPad, iPhone, Mentolatux, Mobile, Simulator, Stunts, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/6oast3vyx8wjv2o4c44tdsczn3kexdpq/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50609",
        "title": "Island Battle 3D",
        "description": "Jump and survive in Island Battle 3D, a 3D IO game that will keep you on your toes. You will play as a jumper who must avoid falling off the island. You will also have to knock back your enemies and be the last one standing. You will face a strategic challenge, as the island&rsquo;s surface is constantly breaking and changing. You can use this to your advantage and push your rivals into the gaps. But watch out, they can do the same to you. You have to stay in the safe zones and avoid getting knocked off. Island Battle 3D is a game that will test your skills and reflexes. Don&rsquo;t miss this fun game!",
        "instructions": "On PC WASD move Space jump On Mobile Tap the buttons or swipe wheels on the screen",
        "url": "https://html5.gamemonetize.com/xt2j7aqkio7orm6km73231nh06tnmv9q/",
        "category": "Action",
        "tags": "3D, Arcade, Battle, Boys, Girls, Jumping, Kids",
        "thumb": "https://img.gamemonetize.com/xt2j7aqkio7orm6km73231nh06tnmv9q/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "49822",
        "title": "Bike Offroad Stunts 2024",
        "description": "Drive your bike offroad in an excellent environment; you can choose from 3 bikes and upgrade, finish levels by driving your motorcycle and gain coins to buy a powerful bike. Website Developer <a href='https://ko.kizi10.org'>https://ko.kizi10.org</a>",
        "instructions": "WASD drive you bike ",
        "url": "https://html5.gamemonetize.com/m2gbuldfl4myy3u4sb6j3wdk0ofzlbdg/",
        "category": "Action",
        "tags": "Android, Bike, iPad, iPhone, Mentolatux, Mobile, Moto, Motocross, Motorcycle, offroad, Unity3D",
        "thumb": "https://img.gamemonetize.com/m2gbuldfl4myy3u4sb6j3wdk0ofzlbdg/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49823",
        "title": "Bike Attack Race 2024",
        "description": "Revise your bike and aim at your rivals in thrilling racing battles. While you may have dabbled in various motorcycle racing games, this 3D endless bike race game is a truly challenging, captivating, and utterly addictive experience. It marks a fresh entry into endless drag racing, promising a level of seamless bike racing excitement that is hard to match. This free bike game delivers the most heart-pounding road racing adventure you could ever imagine. Take charge of your bike as you cruise down endless highway roads. Website Developer <a href='https://pl.kizi10.org'>https://pl.kizi10.org</a>",
        "instructions": "AD left and right drive NM kick left and right W Shotting and use button from the game to fight with other motorcycle ",
        "url": "https://html5.gamemonetize.com/11t28nnliejw8d7yde2fl8osjuai8zam/",
        "category": "Action",
        "tags": "Android, Bike, Driving, Fight, HTML5, iPad, iPhone, Mentolatux, Mobile, Moto, Motocross, Motorcycle, Racing, WebGL",
        "thumb": "https://img.gamemonetize.com/11t28nnliejw8d7yde2fl8osjuai8zam/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49792",
        "title": "Cargo Truck Offroad",
        "description": "Venture into the wild terrains with Cargo Truck Offroad! In this thrilling driving simulation game, players are put behind the wheel of a rugged cargo truck, tasked with delivering goods across challenging offroad landscapes. Navigate through muddy trails, steep mountain paths, and treacherous river crossings, all while ensuring your precious cargo remains intact. As you progress, earn rewards to upgrade your truck or unlock more challenging routes. With realistic physics, immersive graphics, and dynamic weather conditions, every journey promises a unique adventure. Website Developer <a href='https://de.kizi10.org'>https://de.kizi10.org</a>",
        "instructions": "Mobile controlls use button from the screen Pc controls WASD Drive C Change camera",
        "url": "https://html5.gamemonetize.com/bqypgh7mizibuctv597a3akm4cl3fd2d/",
        "category": "Action",
        "tags": "Android, Driving, HTML5, iPad, iPhone, Mentolatux, Mobile, offroad, Truck",
        "thumb": "https://img.gamemonetize.com/bqypgh7mizibuctv597a3akm4cl3fd2d/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49817",
        "title": "Bike Stunts 2024",
        "description": "Choose your bike and drive to this awesome game, Bike Stunts 2024; complete levels so you can buy a new bike; we have added 40 levels to the fun; the game can be played on mobile on the browser, so it is better optimized there. Website Developer <a href='https://ru.kizi10.org'>https://ru.kizi10.org</a>",
        "instructions": "WASD drive On mobile use button ",
        "url": "https://html5.gamemonetize.com/bmozm1zrhtvbe4d4us8whh6bywqmweam/",
        "category": "Action",
        "tags": "Android, Bike, Driving, HTML5, iPad, iPhone, Mentolatux, Mobile, Moto, Motorcycle, Stunts",
        "thumb": "https://img.gamemonetize.com/bmozm1zrhtvbe4d4us8whh6bywqmweam/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50254",
        "title": "Gang Brawlers",
        "description": "What about embarking on an adventure on the dangerous streets with the Gang Brawlers game? Destroy boxes pick some items from the ground and battle against evils on the streets. Besides fighting on the streets, you can embark on an adventure with your friend or fight against your friend in 2P fighting mode. Remember to pick the coins from the ground. You can make your characters more powerful by spending money on the store. Let the adventure begin!",
        "instructions": "Player 1 Move W A S D Jump SPACE Punch Pick Up F Kick G Defend T Player 2 Move ARROW KEYS Jump P Punch Pick Up K Kick L Defend O",
        "url": "https://html5.gamemonetize.com/dmjz4ty5drd9aww9yq588icmnenprlu6/",
        "category": "Action",
        "tags": "2 Player, 2 Player Games, 3D, Action, Adventure, Fight, Fighting, Shooting, Street Fighting, WebGL",
        "thumb": "https://img.gamemonetize.com/dmjz4ty5drd9aww9yq588icmnenprlu6/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "49386",
        "title": "Sumo Battle!",
        "description": "Sumo wrestlers break all the canons of the sport; they do not look slender, muscular and fit; on the contrary, they are large fat men who are more round than slender. These are the rules and requirements for sumo wrestlers. To gain weight, athletes follow a special diet in the game Sumo Battle! You will help your character collect as many pieces of sushi as possible in order to become larger in size. And that means stronger. The goal is to throw your opponents off the podium by approaching them and pushing them into targets attached to their fat bellies. Please note that they will also try to push your hero.",
        "instructions": "Desktop Use WASD or ZQSD to move Mobile Touch and move your finger to move ",
        "url": "https://html5.gamemonetize.com/7mdskoub4xtdgvith418pqnpxjv1ewx3/",
        "category": "Action",
        "tags": "3D, 3D Games, Arcade, Battle, Fight, Fighting, Funny, sumo",
        "thumb": "https://img.gamemonetize.com/7mdskoub4xtdgvith418pqnpxjv1ewx3/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49793",
        "title": "Army Vehicle Transporting",
        "description": "Army vehicle transporting refers to the specialized logistics and operations involved in moving military vehicles from one location to another. This can include the movement of tanks, armored personnel carriers, jeeps, and other ground vehicles, both within a countrys borders and internationally. Transporting these vehicles requires careful planning, as their size, weight, and the need for security can present unique challenges. Whether its for training exercises, deployment to conflict zones, or humanitarian missions. Website Developer <a href='https://tr.kizi10.org'>https://tr.kizi10.org</a>",
        "instructions": "Pc version uses WASD to drive and C to change the camera Mobile users use button UI from the screen ",
        "url": "https://html5.gamemonetize.com/9bs240ik4h7sx6u3ftzis7b6jrvz7nhj/",
        "category": "Action",
        "tags": "Android, Army, Driving, HTML5, iPad, iPhone, Mentolatux, Mobile, Simulator, transport, Truck, vehicle",
        "thumb": "https://img.gamemonetize.com/9bs240ik4h7sx6u3ftzis7b6jrvz7nhj/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49791",
        "title": "Peugeot 2008 Offroad Driving",
        "description": "Experience the thrill of the open trail with the Peugeot 2008, designed for offroad enthusiasts. This vehicle seamlessly blends the elegance and comfort Peugeot is known for with rugged durability to tackle challenging terrains. Whether youre navigating rocky paths, muddy tracks, or sandy dunes, the Peugeot 2008 ensures a smooth and powerful drive. Its advanced suspension system, high ground clearance, and robust engine make it a top choice for adventurers seeking the perfect offroad companion. Website Developer <a href='https://pt.kizi10.org'>https://pt.kizi10.org</a>",
        "instructions": "WASD - drive For mobile users use buttons UI ",
        "url": "https://html5.gamemonetize.com/aex8hojuz54uc98vfzrcfa4492jyz4mh/",
        "category": "Action",
        "tags": "Android, Cars, Driving, HTML5, iPad, iPhone, Mentolatux, Mobile, offroad, Parking, Racing, Supercars, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/aex8hojuz54uc98vfzrcfa4492jyz4mh/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49790",
        "title": "2d Car Parking 2023",
        "description": "2D Car Parking 2023 is a simple yet addictive parking game that tests your driving and parking skills. Navigate through different levels filled with obstacles, tight corners, and other challenges as you aim to park your car perfectly. Choose from various types of cars and take on increasingly difficult levels to prove your parking prowess. Key Features: Easy-to-learn controls for a smooth gameplay experience Variety of levels, each with unique layouts and challenges Selection of cars to suit your driving style Website Developer <a href='https://fr.kizi10.org'>https://fr.kizi10.org</a>",
        "instructions": "W forward and when press button UI gearbox will go back AD left and right Mobile can control from button from the screen ",
        "url": "https://html5.gamemonetize.com/9lx3p9zy4t1avawxsrutro46dulssm32/",
        "category": "Action",
        "tags": "1 Player, 2D, Android, Car, HTML5, iPad, iPhone, Mentolatux, Mobile, Parking",
        "thumb": "https://img.gamemonetize.com/9lx3p9zy4t1avawxsrutro46dulssm32/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50037",
        "title": "Mini Fighters Strike",
        "description": "8 talented mini fighters are ready to show their skills in the arena. Follow your opponent and try to win matches by making the right moves at the right time. Mini Fighters Strike can be played by 1 and 2 player. You can join the tournament and show who is the leader.",
        "instructions": "Player 1 Move W A S D Punch F G Special Hit H B Kick C or V Player 2 Move ARROW KEYS Punch U I Special Hit O L Kick J or K",
        "url": "https://html5.gamemonetize.com/try5tbigkk2s4hkx0azpr3ucxo24940r/",
        "category": "Action",
        "tags": "2 Player, 2 Player Games, Fight, Fighting, Street Fighting",
        "thumb": "https://img.gamemonetize.com/try5tbigkk2s4hkx0azpr3ucxo24940r/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49994",
        "title": "Super John Wick",
        "description": "Step into the shoes of John, a mysterious figure in the world of underground assassins, a masterful fighter with unparalleled accuracy and a burning desire for vengeance. Shoot and guide the bullet to the enemies to destroy them all! Website Developer <a href='https://kiz10.com/'>https://kiz10.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/5v9lcitp50ylhqzjxnf7w37n0q0dt78d/",
        "category": "Action",
        "tags": "1 Player, 3D, 3D Games, Action, Best Games, Casual, Cool, Hypercasual, Shoot, Shooting",
        "thumb": "https://img.gamemonetize.com/5v9lcitp50ylhqzjxnf7w37n0q0dt78d/512x384.jpg",
        "width": "800",
        "height": "480"
    },
    {
        "id": "49975",
        "title": "Ghostly Night Harvest",
        "description": "Welcome to Ghostly Night Harvest, a charming and action-packed game that blends the serenity of nighttime harvesting with the excitement of defending your crops from ghostly invaders. In Ghostly Night Harvest, you step into the shoes of a dedicated farmer. Your mission is to cultivate and grow a bountiful pumpkin harvest during the day and defend it from the ghostly invasion at night. Its a challenge that requires strategic prowess and management skills.",
        "instructions": "Move using the WASD keys or joystick for mobile devices You can shoot using the spacebar or the slingshot button on your mobile device To interact with certain objects press the corresponding action button or the key that appears next to the interactio",
        "url": "https://html5.gamemonetize.com/1h9grfehwwf24efl9f24ux2656bc57y7/",
        "category": "Action",
        "tags": "3D Games, Business, Farm, Ghost, Halloween, Stickman",
        "thumb": "https://img.gamemonetize.com/1h9grfehwwf24efl9f24ux2656bc57y7/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "48892",
        "title": "Police Clash 3D",
        "description": "Gather your elite squad of skilled individuals, each with their unique strengths and abilities, in order to embark on an epic journey. Your mission? To conquer each level with unparalleled efficiency. Assemble a team that complements one another, strategizing and coordinating your every move to perfection. Whether its navigating treacherous terrain, solving intricate puzzles, or engaging in intense combat scenarios, the key lies in teamwork and precision. By combining your squads talents and working together seamlessly, youll not only pass each level but do so with style and finesse, earning your place as true champions.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/cr8vj2mekjhpjfakxecw0gquwgii0nr1/",
        "category": "Action",
        "tags": "3D Games, Android, Click, HTML5, Mentolatux, Mobile, Mouse, Police, Unity3D",
        "thumb": "https://img.gamemonetize.com/cr8vj2mekjhpjfakxecw0gquwgii0nr1/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49784",
        "title": "Hungry Warrior Fight",
        "description": "This game is mobile-ready on the browser. Introducing the ultimate street combat game, Hungry Warrior Fight: a fresh gaming experience! Enjoy captivating visuals and high-quality combat mechanics as you play. The game features a user-friendly control system that makes gameplay a breeze. Utilize the joystick to manoeuvre your character in any direction. Execute a range of martial arts techniques with simple button commands. Website Developer <a href='https://www.bestcrazygames.com'>https://www.bestcrazygames.com</a>",
        "instructions": "WASD and Arrow walk Z Punch X Foot X Grab and push X to kick V Block SPACE jump For mobile use buttons from the game ",
        "url": "https://html5.gamemonetize.com/fwumbh5fj5obd6vho6p7ymv40xpm11hu/",
        "category": "Action",
        "tags": "Action, Android, Fight, Fighting, HTML5, iPad, iPhone, Mentolatux, Mobile, Street Fighting",
        "thumb": "https://img.gamemonetize.com/fwumbh5fj5obd6vho6p7ymv40xpm11hu/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49749",
        "title": "Mini Duels Battle",
        "description": "Super cool mini games are coming within a single game, in the Mini Duels Battle. These games consist of the Drunken Duel series, Drunken Boxing, Wrestling Games, Table games, and more. Just pick one of the games and try the challenge against your friend. You can play all of these popular games with your friend in 2 player game mode besides of single player game mode. The one who scores five before his/her opponent wins the battle. 16 games are ready to play. Lets begin!",
        "instructions": "Player 1 UP ARROW Player 2 W",
        "url": "https://html5.gamemonetize.com/o7ktob2oilxl4yot4ksso7svsoxz0udb/",
        "category": "Action",
        "tags": "2 Player, 2 Player Games, 2D, Action, Animal, Arcade, Arena, Ball, Ballon, Basketball, Battle, Best Games, Brain, Shoot",
        "thumb": "https://img.gamemonetize.com/o7ktob2oilxl4yot4ksso7svsoxz0udb/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "45945",
        "title": "Mega Car Crash Simulator",
        "description": "Here is a car-crashing simulation game. You are requested to drive a car to crash all target cars and survive at all levels. If you lose all HP or drive off the platform, you will lose the game. Complete the missions on time!",
        "instructions": "W gas S back A drive left D drive right Space handbrake",
        "url": "https://html5.gamemonetize.com/3uxkgiopjrkxmppgzgof64q5sgsc25rv/",
        "category": "Action",
        "tags": "3D, Car, crash, Driving, Mobile, Platform, Simulation, survival, Timing",
        "thumb": "https://img.gamemonetize.com/3uxkgiopjrkxmppgzgof64q5sgsc25rv/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "46417",
        "title": "Heavy Tractor Towing",
        "description": "Here is a tractor-driving simulation game. With 3D snow mountain roads, you need to transport the bus or cargo containers by driving a tractor on time. Try to keep balanced and drive stably. Have a good time!",
        "instructions": "WS or Up and Down arrows to speed up or brake AD to turn left or right",
        "url": "https://html5.gamemonetize.com/8vegqqzw0d9k0lj0e9y81afxv2wco261/",
        "category": "Action",
        "tags": "3D, Driving, Mobile, Parking, Simulation, Snow, Timing, Truck",
        "thumb": "https://img.gamemonetize.com/8vegqqzw0d9k0lj0e9y81afxv2wco261/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "48841",
        "title": "Car Parking Lot 2023",
        "description": "Car Parking Lot is an exciting and challenging mobile game that puts your parking skills to the test. Get ready to navigate a variety of vehicles through a maze of obstacles and tight spaces to reach the designated parking spots. With stunning 3D graphics and realistic physics, this game offers an immersive parking experience. Choose from a range of vehicles, from compact cars to large trucks, each with its unique handling characteristics. Can you master the art of precision parking and conquer every level? Website Developer <a href='https://www.bestcrazygames.com'>https://www.bestcrazygames.com</a>",
        "instructions": "WASD to drive ESC to menu c to cahnge camera",
        "url": "https://html5.gamemonetize.com/7t4u52tdicqex560gqzzkls0l5j55nhd/",
        "category": "Action",
        "tags": "3D Games, Car, Mentolatux, Parking, Super, Supercars, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/7t4u52tdicqex560gqzzkls0l5j55nhd/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49194",
        "title": "TankBattle 2 Player",
        "description": "Are you ready for the battle of tanks? Its duel time, the tanks are going to war. Two enemies must defeat each other. The player who maneuvers the fastest and the best wins. You fire first and destroy the enemy tank. Be the best player to defeat your opponent. Fight against your friend and defeat them.",
        "instructions": "To move the blue tank use the WASD keys Press the Q key to fire a shot To move the brown tank use the Arrow Keys keys Press the P key to fire a shot ",
        "url": "https://html5.gamemonetize.com/6iozl4kuor3xettbokhiadh8fcxai1pv/",
        "category": "Action",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Arcade, Battle, Tank, Tanks",
        "thumb": "https://img.gamemonetize.com/6iozl4kuor3xettbokhiadh8fcxai1pv/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49468",
        "title": "Five Nights at Shreks Hotel",
        "description": "After selling your house and relocating to a different city, you find yourself in need of a new place to stay. While youre gainfully employed, you havent yet accumulated enough funds to purchase a new home. As a temporary solution, youve chosen to spend five nights at Greks hotel in the hopes of saving up the necessary funds. Grek, the hotel manager, seems like a decent person, but theres something noticeably amiss about him. Website Developer <a href='https://www.kizi10.org'>https://www.kizi10.org</a>",
        "instructions": "When show ADS hit ESC then click skip then you can continue play the game Wasd - walk Arrow - walk E - Interact with any object When you close to any object you can interact once by pressing E then continue dialogue by clicking the mouse to exit",
        "url": "https://html5.gamemonetize.com/90npw9ketxil8j0c5vfuxcwv67djgita/",
        "category": "Action",
        "tags": "Android, Horror, Mentolatux, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/90npw9ketxil8j0c5vfuxcwv67djgita/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49391",
        "title": "Fighter Legends Duo",
        "description": "Epic fighting adventure is beginning with the Fighter Legends Duo game! The fighting adventure will be in various places like temples, military areas, deserts, caves, and many other places. The fighters are picked from legendary fighters of all time and this will be All Star fighting tournament. Pick the fighter take your place in the fighting arena and start fighting against these super-talented fighters.",
        "instructions": "Player 1 Move W A S D Punch F Kick G Special H Player 2 Move ARROW KEYS Punck K Kick L Special J",
        "url": "https://html5.gamemonetize.com/8nv3jd35egnqso4tamip9k8u04mdfgun/",
        "category": "Action",
        "tags": "1 Player, 2 Player, 2 Player Games, Action, Arcade, Arena, Fight, Fighting, Street Fighting",
        "thumb": "https://img.gamemonetize.com/8nv3jd35egnqso4tamip9k8u04mdfgun/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "48988",
        "title": "Ninja Stickman Warrior HTML5",
        "description": "The Stickman Ninja Warrior game presents a distinctive puzzle-solving experience. In this game, your mission is to liberate prisoners using the limited supply of shurikens at your disposal. Exercise caution and strategic thinking as you navigate through a series of unique and challenging levels. Website Developer <a href='https://www.crazygamesonline.com/'>https://www.crazygamesonline.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/qkf5109t7ye847az9c0p1jffbq031ikn/",
        "category": "Action",
        "tags": "Android, Arcade, HTML5, Mentolatux, Mobile, Shoot, Stickman, Warrior",
        "thumb": "https://img.gamemonetize.com/qkf5109t7ye847az9c0p1jffbq031ikn/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47878",
        "title": "Monsters Dungeon Battle",
        "description": "Fight against those monsters residing in the abandoned dungeon. Upgrade your stats, Collect classes, Wizard, Archer and more that can help you in your battle, and save the world by defeating them all!",
        "instructions": "Left Mouse Button Touch Screen",
        "url": "https://html5.gamemonetize.com/cb4lyqk01r8nugfoqxnaps191l2xvq9f/",
        "category": "Action",
        "tags": "2D, Arena, Battlegrounds, Enemies, Fantasy, Fighting, Magic, Mobile, RPG",
        "thumb": "https://img.gamemonetize.com/cb4lyqk01r8nugfoqxnaps191l2xvq9f/512x384.jpg",
        "width": "1080",
        "height": "720"
    },
    {
        "id": "48956",
        "title": "Grimace Shake Escape Skibidi and Cameraman",
        "description": "You wake up in Doctor Grimace Shake scary hospital and remember nothing. You should survive and escape - search for items and avoid Doctor Grimace terrifying guinea pigs - Dop Dop Skibidi Toilet in the sewer and Yes Yes Cameraman on the hospital grounds. Look for creepy items that are located in the hospital, open drawers, safes and do everything to leave this scary and unpredictable place. Grimace and Skibidi like to hide things in many different places, even in closets and small cupboards. Try not to make any noise, because otherwise any of the guinea pigs will come and knock you out, from Skibidi Toilet to Cameraman.",
        "instructions": "WASD - player movement E - use G - throw away item C - sit stand up Q - escape the hide place Left mouse click - shoot from the flare gun TAB - pause the game Search for the items and use them to open main door and escape",
        "url": "https://html5.gamemonetize.com/czx277alw1r9ff0nxtjqp5wujdyi88kz/",
        "category": "Action",
        "tags": "3D, 3D Games, Action, Adventure, Enemy, Game, Games, Grimace, Grimace Shake, Horror, HTML5, Skibidi, Skibidi Toilet, Unity3D",
        "thumb": "https://img.gamemonetize.com/czx277alw1r9ff0nxtjqp5wujdyi88kz/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49020",
        "title": "Skibidi vs Grimace Climber Race",
        "description": "The Skibidi vs Grimace Climber Race promises an epic showdown between two daring competitors. Skibidi, known for agility and finesse, faces off against Grimace, renowned for sheer strength and determination. As they ascend challenging cliffs and scale treacherous peaks, spectators hold their breath, unsure who will conquer natures obstacles. This thrilling race blends athleticism and strategy, captivating audiences with the suspense of this exhilarating competition. Website Developer <a href='https://www.kizi10.org/'>https://www.kizi10.org/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ea9pxc7sygkekcm4vwludyadcaweojhx/",
        "category": "Action",
        "tags": "Action, Android, Grimace, Grimace Shake, HTML5, iPad, iPhone, Mentolatux, Mobile, Race, Skibidi, Skibidi Toilet, Unity3D",
        "thumb": "https://img.gamemonetize.com/ea9pxc7sygkekcm4vwludyadcaweojhx/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49002",
        "title": "Toilet Monster Long Neck",
        "description": "Introducing Skibidi, a groundbreaking game featuring entirely unique gameplay mechanics. In this immersive experience, you take on the role of an endlessly extendable Skibidi Toilet. Utilize your intelligence and agility to outwit and defeat the CameraMan. The game offers an array of challenging yet engaging levels designed to captivate your attention. Website Developer <a href='https://www.crazygamesonline.com/'>https://www.crazygamesonline.com/</a>",
        "instructions": "Mouse click or tap to play Extend the neck of the Skibidi Toilet to accomplish various objectives Immerse yourself in this highly creative gameplay experience as you manipulate the elongated neck of the Skibidi Toilet to form amusing shapes ",
        "url": "https://html5.gamemonetize.com/utz8cejau7u57kg8jj5eqieyx6q98td2/",
        "category": "Action",
        "tags": "2D, Android, HTML5, iPad, iPhone, Mentolatux, Mobile, Skibidi, Skibidi Toilet, Skill",
        "thumb": "https://img.gamemonetize.com/utz8cejau7u57kg8jj5eqieyx6q98td2/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48968",
        "title": "Skibidi Toilet Only Up",
        "description": "In Skibidi Toilet Only Up, a young slum dweller aspires to break free from poverty. Embarking on a transformative journey, Skibidi Toilet seeks not only worldly knowledge but also self-discovery. Website Developer <a href='https://www.bestcrazygames.com/'>https://www.bestcrazygames.com/</a>",
        "instructions": "WASD walk TAB menu SPACE jump",
        "url": "https://html5.gamemonetize.com/pnvv4xtk5ga8bny4140oyg4henh6pi9d/",
        "category": "Action",
        "tags": "jump, Jumping, OnlyUp, run, running, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/pnvv4xtk5ga8bny4140oyg4henh6pi9d/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48824",
        "title": "Skibidi Toilet Hide And Seek",
        "description": "In the thrilling game Skibidi Toilet Hide and Seek, players embark on a heart-pounding adventure where stealth is their greatest ally. Set in a mysterious environment, you must outsmart vigilant enemy AI cameramen by staying hidden while simultaneously hunting them down. Your objective? Eliminate these watchful foes and clear your path to victory. But the challenge doesnt stop there. To progress further, youll need to access a control console strategically placed within the level. Website Developer <a href='https://www.bestcrazygames.com/'>https://www.bestcrazygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/pjys7avy5ex96in3w92s5xf3eq4b4coe/",
        "category": "Action",
        "tags": "3D Games, Android, HTML5, Mentolatux, Mobile, Skibidi, Skibidi Toilet, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/pjys7avy5ex96in3w92s5xf3eq4b4coe/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48776",
        "title": "Sausage Run",
        "description": "Experience the thrill of survival in Sausage Run! This exciting adventure running game allows you to guide your little sausage to sprint for as long as possible with simple controls. Stay vigilant as danger lurks around every corner. The games difficulty depends entirely on your reaction speed. How durable is your sausage? Want to give it a try? Various fun obstacles will make you love this game! Can you become the champion? Give this game a try! Have fun playing!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/pvgq9muc866itgvcy741foa0a2okfvhm/",
        "category": "Action",
        "tags": "3D, Avoid, fly, Girl, jump, Kid, run, Sport",
        "thumb": "https://img.gamemonetize.com/pvgq9muc866itgvcy741foa0a2okfvhm/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "48790",
        "title": "Skibidi Toilet Hunter",
        "description": "In Skibidi Toilet Hunter, assume the role of a determined Skibidi armed with WASD controls and mouse left-click attacks. Your mission: hunt down AI cameramen lurking in toilets. This comically unique world is filled with twists and turns. Click anywhere on the screen to look around, uncovering hidden enemies. Embark on this quirky adventure and become the ultimate Skibidi Toilet Hunter in a hilarious quest where toilets are battlegrounds, and cameramen are your targets. Website Developer <a href='https://www.bestcrazygames.com/'>https://www.bestcrazygames.com/</a>",
        "instructions": "WASD walk ARROw walk MOUSE LEFT attack CLICK MOUSE look around",
        "url": "https://html5.gamemonetize.com/yjuaf7eewx4fe5tsn44pdnni5q60f34b/",
        "category": "Action",
        "tags": "3D Games, Mentolatux, Science, Skibidi, Skibidi Toilet, Space, Top Down, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/yjuaf7eewx4fe5tsn44pdnni5q60f34b/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48830",
        "title": "Skibidi Toilet TopDown Survival",
        "description": "In the game Skibidi Toilet TopDown Survival, players take on the role of a resourceful cameraman faced with an unusual challenge. Their mission? To survive in a map infested with mischievous Skibidi Toilets. These peculiar adversaries must be eliminated to progress. As players explore the map, they have the opportunity to find upgrades, enhancing their arsenal and abilities. By accumulating more firepower or duplicating their character, they can increase their chances of survival and expedite level completion. Website Developer <a href='https://www.bestcrazygames.com'>https://www.bestcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/24qjjyp87cdcqmru239v2md7zu6630mf/",
        "category": "Action",
        "tags": "Action, Android, HTML5, iPad, iPhone, Levels, Mentolatux, Mobile, Skibidi, Skibidi Toilet, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/24qjjyp87cdcqmru239v2md7zu6630mf/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47742",
        "title": "Real Airplane Simulator",
        "description": "Here is an airplane-driving simulation game. There are many different airplanes to unlock and select in the garage. Following the green arrow and lines, adjust the instantly. More practice will help you complete all levels.",
        "instructions": "Switch views for better driving sense Follow the hints",
        "url": "https://html5.gamemonetize.com/l2mrm0gwkvuj1g0qy0acw6fj7xnzxmas/",
        "category": "Action",
        "tags": "3D, airplane, Driving, Mobile, Parking, Simulation, Timing",
        "thumb": "https://img.gamemonetize.com/l2mrm0gwkvuj1g0qy0acw6fj7xnzxmas/512x384.jpg",
        "width": "1079",
        "height": "615"
    },
    {
        "id": "48622",
        "title": "Craft Doors: Horror Run",
        "description": "Can you escape the craft doors alive? Joining Craft Doors: Horror Escape Run where you can experience the most petrifying escape challenge of your life! Get ready to feel the real horror and goosebumps, open all doors and find the way out of this nightmare. But remember to look around! Who knows what&rsquo;s hiding in the dark... The end objective of this game is to get through all craft doors without being killed by the entities. Find the next door, escape the thrilling maze filled with terrifying entities, use buttons/joystick to run and collect keys, coins &amp; useful tools. Your life skills, bravery and reflexes will be tested through endles",
        "instructions": " WASD - move mouse- camera space- jump E - Select P-pause ",
        "url": "https://html5.gamemonetize.com/hmehhcx22pfqp8nrqqw54srznwsbrkml/",
        "category": "Action",
        "tags": "Craft, Horror, Minecraft, Skibidi",
        "thumb": "https://img.gamemonetize.com/hmehhcx22pfqp8nrqqw54srznwsbrkml/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46834",
        "title": "Master Crazy Damage",
        "description": "A war has begun in the world of Stickmen and you are in a new exciting online game Master Crazy Damage take part in it. In front of you on the screen you will see the location in which your character and his opponent will be located. Both of them will be armed with firearms. On a signal, you, controlling your character, will have to quickly throw up your weapon and aim to open fire to kill. If your aim is accurate, then the bullets will hit your opponent and destroy him. As soon as this happens, Master Crazy Damage will give you points in the game and you will move on to the next level of the game.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/7a51z9rfrfc0najspxjmxpayslc0dfyh/",
        "category": "Action",
        "tags": "Best, Boys, Fun, Gun, Mobile, Shooting, Stickman",
        "thumb": "https://img.gamemonetize.com/7a51z9rfrfc0najspxjmxpayslc0dfyh/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "47978",
        "title": "Commandos Battle for Survival 3D",
        "description": "Destroy the enemy forces with stealth attack and render their weapons useless. Go quietly and infiltrate your sole. Use your sneaky skills and avoid the radar because it is not even an option for the soldier to get caught! Yes! This army action based games is a unique blend with commando adventure, bringing you a whole new concept of secret services Agent operations. Spy and Drivers under the radar, welcome to the secret agent arena, moving places around enemy areas to complete stealth army missions. Agent Shadow Jill is recruited and trained by the army secret service agency to keep your territory safe. Become a spy and operate under the r",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/51q2ocu5l2tn4tj7ojd3axb0a38zmlwr/",
        "category": "Action",
        "tags": "1 Player, 3D, Action, Adventure, Army",
        "thumb": "https://img.gamemonetize.com/51q2ocu5l2tn4tj7ojd3axb0a38zmlwr/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48085",
        "title": "Real Drone Simulator",
        "description": "Here is a drone driving simulation game with 3D game art animations. You are able to drive the drone in three different modes. There are many different drones for you to use. You can scan building parts or pass checkpoints.",
        "instructions": "WASD fly to four directions Up and Down arrows fly high and low Left and Right arrow turn left and right",
        "url": "https://html5.gamemonetize.com/l6njclu75ig1nm323wh9hfda9vhf0kox/",
        "category": "Action",
        "tags": "3D, airplane, Driving, HTML5, Mobile, Simulation, Timing",
        "thumb": "https://img.gamemonetize.com/l6njclu75ig1nm323wh9hfda9vhf0kox/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "47616",
        "title": "Clown Park Hide and Seek",
        "description": "Clown Park - Hide And Seek is a camp against camp arcade game. It has beautiful graphic design and 3D space design. There are 3 modes: Survivor camp, and Chaser camp. Survivors need to collect enough keys to open the escape door within the time limit and escape successfully to win. On the contrary, the pursuer is to stop the survivors pace. Are you ready? Clown Park Hide and Seek: A Thrilling and Fun-Filled IOS Game In the world of mobile gaming, Clown Park Hide and Seek has emerged as a unique and captivating game that offers hours of entertainment to players of all ages. Developed for IOS platforms, this game has gained popularity due",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/x89je06j8zmspnm8azsllfiylp8ervox/",
        "category": "Action",
        "tags": ".io, .io Games, 3D, Action, Boys, Crazy",
        "thumb": "https://img.gamemonetize.com/x89je06j8zmspnm8azsllfiylp8ervox/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48267",
        "title": "SurvivalPixel.io",
        "description": "We need you in a popular survival game. Help the Warrior survive and assist them in battling tougher monsters at each level. Be cautious, as monsters are coming from everywhere and you need to stay alive. Grab your sword, and eliminate all the monsters. The monsters you defeat will grant you health and power. Keep getting stronger and defeat the boss monsters.",
        "instructions": " Move back and forth with the WASD keys to play Mobile control buttons available ",
        "url": "https://html5.gamemonetize.com/vbf4xpvfzbh03r17mnu662ifpwojhfvx/",
        "category": "Action",
        "tags": ".io, .io Games, 1 Player, 2D, Action, Adventure, Android, Arcade, Arena, Mobile",
        "thumb": "https://img.gamemonetize.com/vbf4xpvfzbh03r17mnu662ifpwojhfvx/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "40612",
        "title": "Stumble   Survival Guys ",
        "description": "Stumble-Survival Guys is a very hot adventure elimination game. A variety of fun levels await your challenge, and the time has come to test your memory and dexterity! Run, sprint, and slide to overtake your opponents and dodge the obstacles that keep popping up. Can you survive to the end? Invite your friends to join you and kill them all! Stumble-Survival Guys: An Exciting Mobile Gaming Experience for iOS Users In the world of mobile gaming, Survival Guys has emerged as an exciting and addictive game that has captivated iOS users worldwide. Developed by a team of skilled game developers, Survival Guys offers a unique and challenging gaming",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ebzhf7uwcukpaeb1z4ma3yu0mm2g0hrm/",
        "category": "Action",
        "tags": ".io, .io Games, 3D, 3D Games, Action, Adventure, Boy, Boys, Fall Boys, Fall Guys, Fantasy, Kid, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/ebzhf7uwcukpaeb1z4ma3yu0mm2g0hrm/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "48365",
        "title": "Face Punch.io",
        "description": "Step onto the ring to knock out all champions with your brutal punches for real boxing experience in io game universe! BECOME A CHALLENGER BOXER NOW! Attack with fierce face punches and combos to knock out others. Can you become the champion fighter of the boxing io game arena? EASY IO GAME CONTROLS! Smash everyone with your hits and make combos to knockout with only one button in the world of fighting! ULTIMATE FIGHTER SKILLS! Each hero has different special move to use in epic combat to knock out other fighting boxers.",
        "instructions": "COLLECTIBLES Achieve objectives to unlock amazing heroes with skills and skins Step onto the classical fighting ring with your favorite hero to survive the longest make maximum combos or a great number of knockouts ",
        "url": "https://html5.gamemonetize.com/akub1gx5xgvtbhp6ozi3adxmwmmm6ej2/",
        "category": "Action",
        "tags": ".io, .io Games, 1 Player, 2D, Android, Arcade, Battle, Cool, Hot",
        "thumb": "https://img.gamemonetize.com/akub1gx5xgvtbhp6ozi3adxmwmmm6ej2/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "48341",
        "title": "Skibidi Toilet vs Cameramans",
        "description": "Kill toilet enemies with your friend. Hunt down all the toilet enemies. Unite with your friend and only kill the monsters that belong to you. The blue cameraman can kill the blue toilet monster, so work together with your friend to kill the toilet monsters of your own color. Toilet monsters are everywhere.",
        "instructions": " Played with WASD Arrow Keys Mobile touch control is available double jump available jump on it to kill ",
        "url": "https://html5.gamemonetize.com/bep9445b7vx5b3jjzojwsti679u76ck8/",
        "category": "Action",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Android, Arcade, Arena, Minecraft, Mobile, Pixel, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/bep9445b7vx5b3jjzojwsti679u76ck8/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48287",
        "title": "Cyber Surfer Skateboard",
        "description": "Do you like cyberpunk? Do you like skateboarding? Then this game is for you! Welcome to the world where skateboarding belongs! In Cyber Surfer Skateboard, you can show off your skateboarding skills! Exciting music, fun obstacles, and sound effects will make you love this game! If you are a fan of skateboarding games, dont miss it! Have fun!",
        "instructions": "Move your finger to control",
        "url": "https://html5.gamemonetize.com/wplw5n1rp93fzw0o90xu88c1q4o3bw5o/",
        "category": "Action",
        "tags": "3D, Action, Arcade, Casual, Girl, Kid, running, Simulation, Skateboard",
        "thumb": "https://img.gamemonetize.com/wplw5n1rp93fzw0o90xu88c1q4o3bw5o/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "48211",
        "title": "Only Up! Forward",
        "description": "Meet Jackie, a determined teenager hailing from the gritty streets of the ghetto. Jackie yearns to break free from the shackles of poverty, igniting an inner fire to explore both the vast world and the depths of their own identity. In a world perpetually in flux, Jackie senses an opportunity amidst the chaos. The current global upheaval is a call to arms, a chance to take bold strides towards transformation. Yet, the allure of progress is tempered by the daunting prospect of setbacks &ndash; every move forward could potentially thrust them several steps back.",
        "instructions": "WASD run-walk space jump",
        "url": "https://html5.gamemonetize.com/v7qy34ruk7kvsikgs57dmo5m78c5tvuy/",
        "category": "Action",
        "tags": "jump, Jumping, Mentolatux, OnlyUp, run, running, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/v7qy34ruk7kvsikgs57dmo5m78c5tvuy/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48190",
        "title": "Weapon Duel",
        "description": "Weapon Duel is a combat gamePlayers can control character attacks and throw missiles to knock opponents off the platformThis game supports players and Ai to play and players and players,You can play with your friends at the party.",
        "instructions": "computer Touch Key ldquo A D larr rarr rdquo to control Inhale and Blow phone Touch virtual button to control Inhale and Blow ",
        "url": "https://html5.gamemonetize.com/177chanqfwt2tvf8e977m6evaa427vwb/",
        "category": "Action",
        "tags": "2 Player Games, Action, weapons",
        "thumb": "https://img.gamemonetize.com/177chanqfwt2tvf8e977m6evaa427vwb/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "48188",
        "title": "Car Stunts 2050",
        "description": "Engage in exhilarating car stunts and adrenaline-pumping action as you take the wheel in this high-octane racing game. Push your driving skills to the limit as you execute jaw-dropping stunts that defy gravity and logic. Leap through flaming hoops, perform barrel rolls, and execute breathtaking jumps over ramps. The game offers a variety of challenging levels, each designed to test your mastery of the wheel and your audacity for stunts. Website Developer",
        "instructions": "WASD to drive ",
        "url": "https://html5.gamemonetize.com/ogu1hx06a2bkppkqulsyv99qk1tcu5po/",
        "category": "Action",
        "tags": "3D Games, Android, Cars, Driving, HTML5, Mentolatux, Mobile, Racing, Stunts, Supercars, WebGL",
        "thumb": "https://img.gamemonetize.com/ogu1hx06a2bkppkqulsyv99qk1tcu5po/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47516",
        "title": "Stick Arena 3D",
        "description": "Embark on an unforgettable adventure through 40 different levels in this exciting 3D platform game! Test your skills by defeating enemies and explore the mysterious world. A visually impressive and strategically challenging experience awaits you. Are you ready? Your adventure begins!",
        "instructions": "You can use the ARROW KEYS or W A D to move You can use the LEFT CLICK button on your mouse to shoot ",
        "url": "https://html5.gamemonetize.com/x1jqtjkh9s1xfmzfe1wnv5j88b5szgmy/",
        "category": "Action",
        "tags": "3D, Action, Adventure, Shoot, Shooting, Stickman",
        "thumb": "https://img.gamemonetize.com/x1jqtjkh9s1xfmzfe1wnv5j88b5szgmy/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "48045",
        "title": "Fall Boys Skibidi Toilet",
        "description": "Prepare for a whirlwind of whimsical chaos in Fall Boys Skibidi Toilet! This vibrant and addictive multiplayer game catapults you into a hilarious obstacle course where jellybean-like characters compete for victory. Dive into a world where physics-defying challenges and zany races await at every corner. Website Developer <a href='https://www.bestcrazygames.com'>https://www.bestcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/8k16174hl3bg8ec1lk08thh3em9b6q0v/",
        "category": "Action",
        "tags": "Android, Fall Boys, Fall Guys, HTML5, Mobile, run, running, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/8k16174hl3bg8ec1lk08thh3em9b6q0v/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48019",
        "title": "Skibidi Toilet Bullet",
        "description": "Skibidi Toi is an exhilarating and addictive mobile game that plunges players into a world of precision aiming, strategic thinking, and physics-based challenges. Set in a stylish and cartoonish environment, the game combines puzzle-solving and action gameplay elements to create a unique and engaging experience. Website Developer <a href='https://www.bestcrazygames.com'>https://www.bestcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/qt42nkifuxtcht0iqueutwx075evc257/",
        "category": "Action",
        "tags": "2D, Android, Bullet, HTML5, Mobile, Shoot, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/qt42nkifuxtcht0iqueutwx075evc257/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47777",
        "title": "Helix Skibidi Toilet Jump",
        "description": "Helix Skibidi Toilet Jump is a whimsical and unique mobile game that blends the thrill of Helix Jump and the catchy rhythm of the Skibidi dance. In this innovative game, players guide a bouncing ball through a maze-like helix structure while jamming to the infectious beat of the Skibidi song. To reach the bottom, the goal is to navigate the ball through the twisting paths, avoiding obstacles and holes. The game offers a vibrant and colorful design with captivating visuals that change as players progress through various levels. <a href='https://www.bestcrazygames.com/'>https://www.bestcrazygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/v7qltxk0bu7v83kycu8anrrmub1nmtxr/",
        "category": "Action",
        "tags": "Android, Helix, HTML5, iPad, iPhone, jump, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/v7qltxk0bu7v83kycu8anrrmub1nmtxr/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48024",
        "title": "Skibidi Snake.io",
        "description": "Skibidi Snake.io is a fast-paced, action-packed snake game that will test your reflexes and strategy skills. In this game, you control a snake that must eat as many Skibidi as possible to grow in size. The longer your snake gets, the more difficult it will be to control, but the more points you will score. Website Developer <a href='https://naptechgames.com/'>https://naptechgames.com/</a>",
        "instructions": "Desktop Use the Mouse left click button on the screen to Move Anywhere on the Screen Mobile Tap on the screen to Move Anywhere on the Screen ",
        "url": "https://html5.gamemonetize.com/88kisw889g91pa7fv6hwqzi0v3g2dbkw/",
        "category": "Action",
        "tags": ".io, .io Games, 2D, Action, Adventure, Fun, Game, Games, HTML, HTML5, Number, Online, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/88kisw889g91pa7fv6hwqzi0v3g2dbkw/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "46309",
        "title": "Space Adventure: Noobiks Battle vs Zombies",
        "description": "Introducing Space Adventure: Noobiks Battle vs Zombies, an exciting game where players control a Minecraft Noob on platforms within a space station. In this action-packed game, your mission is to unlock doors by obliterating crystals while fending off waves of cosmic zombies. Explore various levels of the spacecraft, hopping from platform to platform, collecting weapons, and power-ups to combat the enemies. Each platform presents a unique challenge, with new obstacles and crystals to destroy in order to progress and unveil the next door.",
        "instructions": "Keywords A - Left D - Right W - Up S - Down amp Mouse - Fire",
        "url": "https://html5.gamemonetize.com/5dnl5edam018ab0ojzoanvld7k3x9nr1/",
        "category": "Action",
        "tags": "3D, Battle, Minecraft, Zombie",
        "thumb": "https://img.gamemonetize.com/5dnl5edam018ab0ojzoanvld7k3x9nr1/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "48018",
        "title": "Agent Cameraman Skibidi Toilet",
        "description": "Hey agent! Quickly grab your weapon and be ready for the mission. The monsters are coming, and their bosses are here too. Eliminate all the restroom monsters! Agent cameraman, if youre ready for the mission, lets begin. Start from the difficulty level you prefer; some missions are harder than others. The monsters can be very powerful. You also need a better weapon to kill the monsters. Get the best weapon and defeat all the restroom monsters. Many costumes are waiting for you as well. Put on the costume you want and start the adventure yourself.",
        "instructions": " Use the WASD keys to move Click with the mouse to shoot Mobile joystick controls are available Tap to shoot Mobile playability 10 different missions 10 different difficulties ",
        "url": "https://html5.gamemonetize.com/6zstdny5gv6yo1evvxxy80ov0uwsvw2w/",
        "category": "Action",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Alien, Android, Arcade, Arena, Interactive, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/6zstdny5gv6yo1evvxxy80ov0uwsvw2w/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48017",
        "title": "Monster Trucks Stunts",
        "description": "Monster Trucks Stunts is an adrenaline-pumping, action-packed mobile game that puts you in the drivers seat of powerful, roaring monster trucks. Get ready to unleash your inner daredevil as you embark on an exciting journey of stunt-filled mayhem! Take on various challenging levels across diverse landscapes, from sprawling urban cities to rugged off-road terrains, each designed to test your driving skills to the limit. Perform jaw-dropping stunts like gravity-defying jumps, thrilling flips. Website Developer",
        "instructions": "WASD drive your monster truck Customize your ride with a wide array of paint jobs decals and",
        "url": "https://html5.gamemonetize.com/p6y6szhufhrmdrpwkdclke8hqhj7oasw/",
        "category": "Action",
        "tags": "Driving, monstertruck, Stunts, Truck, unity, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/p6y6szhufhrmdrpwkdclke8hqhj7oasw/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47849",
        "title": "Street Car Race Ultimate",
        "description": "Here is a car avoid-racing driving simulation game. With 3D modern art animations, you need to follow the missions and complete them at all levels. The coins are used to upgrade accelerations and buy better cars.",
        "instructions": "W gas S back A drive left D drive right Space handbrake",
        "url": "https://html5.gamemonetize.com/0h23x5drvwyehgkx28zhf7lvkb9fdhsl/",
        "category": "Action",
        "tags": "3D, Avoid, Car, Driving, Mobile, Racing, Simulation, Timing",
        "thumb": "https://img.gamemonetize.com/0h23x5drvwyehgkx28zhf7lvkb9fdhsl/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "47977",
        "title": "Skibidi Fight",
        "description": "Hey buddy! Are you up for a showdown with your friend? Guns are drawn, its the perfect time to fire. Shoot right away and claim victory. The toilet guys need to battle it out. There are no obstacles in the arena, all you need to do is make swift moves left and right. Dodge the bullets, fire as fast as you can. Collect the boost boxes to win. The boxes will contain power-ups and weapons. Grab your weapon, aim at your enemy, and win.",
        "instructions": "Use the WASD keys to move the Blue Player Press the T key to shoot Use the Arrow Keys to move the Red Player Press P to shoot Mobile devices are also supported for gameplay ",
        "url": "https://html5.gamemonetize.com/mz962cwg9dkhtmttz4xml9wspku1aa3o/",
        "category": "Action",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Arcade, Arena, Gun",
        "thumb": "https://img.gamemonetize.com/mz962cwg9dkhtmttz4xml9wspku1aa3o/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47861",
        "title": "Rescue Master",
        "description": "Rescue Master is a role-playing 3D gamePlayers will play the role of a rescue master using various tools to save peopleThe game includes speedboats and helicoptersThe background is the world after the floods",
        "instructions": "computer control speedboat Player can use W S A D to control boat Moving helicopter Player can use W S A D L Ctrl Space to control helicopter Moving phone control speedboat Click on the screen button to control helicopter Click on the screen button to c",
        "url": "https://html5.gamemonetize.com/uk7y1arjjsnxoq5262fjbes4jmkhy10f/",
        "category": "Action",
        "tags": "Rescue",
        "thumb": "https://img.gamemonetize.com/uk7y1arjjsnxoq5262fjbes4jmkhy10f/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "8728",
        "title": "Choo Choo Charles Revenge",
        "description": "The time of terror has arrived with this incredible horror, shooting, survival game! Enjoy and play for free Choo Choo Charles Revenge a new exclusive game on kiz10.com. A terrible demonic train is loose and will seek to eliminate anyone in its path but your goal will be to complete each level and destroy it. Search for the keys on each map. Follow the steps. Shoot all your enemies, move and run around the map so they dont catch you.",
        "instructions": "controls Move with the keyboard arrows or the WASD keys Jump with Spacebar Crouch with the CTRL key Run with Shift Shoot with the right click and move the camera with the mouse",
        "url": "https://html5.gamemonetize.com/b56yhj6qofvbdsx2qll581bihogt15cc/",
        "category": "Action",
        "tags": "Escape, kiz10, Monster, Shooter, survival",
        "thumb": "https://img.gamemonetize.com/b56yhj6qofvbdsx2qll581bihogt15cc/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "47890",
        "title": "Freehead Skate",
        "description": "Freehead Skateis a fast-paced, arcade-style game that challenges players to jump over obstacles using only their characters head. With simple controls and addictive gameplay, players must time their head-jumps perfectly to conquer increasingly challenging levels and achieve high scores. Dive into the exciting world of Freehead Skateand put your head-jumping skills to the test! on R1Games.com",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/museimxpj23qgd30oirvj1xlmc0vouem/",
        "category": "Action",
        "tags": "1 Player, 2D, Action, Fun, Games, Highscore, HTML5, jump, Jumping, Kids, Obstacle, Play",
        "thumb": "https://img.gamemonetize.com/museimxpj23qgd30oirvj1xlmc0vouem/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46601",
        "title": "Bicycle Rush 3D",
        "description": "Here is a bicycle riding racing arcade game that is made from 3D cartoon game art animation. In normal racing mode, you can crash other AI riders and win first place. In Challenge mode, you need to avoid all obstacles and arrive at the finish line. Have a good time in the first-person view!",
        "instructions": "Drag to move left and right to dodge all kinds of obstacles",
        "url": "https://html5.gamemonetize.com/wox48iadsukskgrs1fk9i5o2hxwm5azg/",
        "category": "Action",
        "tags": "3D, Avoid, Bike, Mobile, Obstacle, Race, Simulation",
        "thumb": "https://img.gamemonetize.com/wox48iadsukskgrs1fk9i5o2hxwm5azg/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "47739",
        "title": "Car Racing: 3D Drive Mad",
        "description": "Here is a car racing arcade game. You have a chance to control a car equiped with nitro system. You can collect the fuel to charge it. Try to defeat other AI players by avoiding obstacles and using nitro items. Have a good time!",
        "instructions": "PC AD move The other functions tap the buttons Mobile Tap the buttons",
        "url": "https://html5.gamemonetize.com/u92w5m8oarc9vrcbaya824qonh7lgij3/",
        "category": "Action",
        "tags": "3D, Avoid, Car, Collecting, Driving, Mobile, Racing, Simulation, Stunts",
        "thumb": "https://img.gamemonetize.com/u92w5m8oarc9vrcbaya824qonh7lgij3/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "47729",
        "title": "Skibidi Toilet Friends",
        "description": "Are you ready for the adventure of two friends? Achieve victory with teamwork. You should move with your friend. You should support your friend. two toilet men need to reach the door. proceed in order. Reach the door in this fun for two. Watch out for moving obstacles. You must reach the door before you die. neither of you should die.",
        "instructions": " Blue player use Arrow keys to move Red player use WASD to move Mobile Touch Control",
        "url": "https://html5.gamemonetize.com/jvgcmyn4aqpf23w7gmww6x8cdo9nzefi/",
        "category": "Action",
        "tags": "2 Player, 2 Player Games, 2D, Adventure, Android, Arcade, Mobile, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/jvgcmyn4aqpf23w7gmww6x8cdo9nzefi/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "45882",
        "title": "Bus Parking Cityscape Depot",
        "description": "Bus Parking is an exciting game that puts players in the drivers seat of a virtual bus, challenging them to navigate and park the vehicle in various locations. The game offers a realistic simulation of the bus driving experience, with stunning graphics on https://www.bestcrazygames.com and immersive sound effects that enhance the gameplay.",
        "instructions": "Drive WASD C - change camera ESC - MENU In Bus Parking players face a series of increasingly difficult parking scenarios testing their skills and precision They must maneuver the bus through tight spaces avoid obstacles and park within designated",
        "url": "https://html5.gamemonetize.com/q1njcj2p3xvtvvd5zw5nm4lj2mig6871/",
        "category": "Action",
        "tags": "1 Player, 3D Games, bus, Driving, Parking, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/q1njcj2p3xvtvvd5zw5nm4lj2mig6871/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47498",
        "title": "Deads On The Road",
        "description": "Zombies have surrounded this place! The struggle to escape has never been so difficult. On dark roads, a zombie that suddenly appears in front of you can destroy you! Be very careful not to get caught by zombies while trying to escape. You must be on your guard at every moment. How many meters can you run? Click for a breathless fight!",
        "instructions": "Movement A-D Speed Up W Slow Down S Fire Mouse Left Click Sword-Katana Right Click of the Mouse",
        "url": "https://html5.gamemonetize.com/vlu85s3libx4w9xxlda5rwtktzu1g8hg/",
        "category": "Action",
        "tags": "Shoot, Shooter, Skill, Zombie",
        "thumb": "https://img.gamemonetize.com/vlu85s3libx4w9xxlda5rwtktzu1g8hg/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "1906",
        "title": "Parking Supercar Unlocking Skills",
        "description": "Mastering the art of parking and driving a supercar requires precision, skill, and a deep understanding of the vehicles capabilities. In the exhilarating world of supercar enthusiasts, parking is not merely a mundane task but an opportunity to showcase finesse and control https://www.bestcrazygames.com",
        "instructions": "drive with WASD and Space for a break Supercar Skills invites enthusiasts to embark on a journey of discovery where they can learn the secrets to navigating tight spaces with ease while exhibiting their mastery of the supercar ",
        "url": "https://html5.gamemonetize.com/b2en4jdgzx3qhbtnt2l9pbtvgnagg3ps/",
        "category": "Action",
        "tags": "Car, Driving, Forest, Parking, Supercars, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/b2en4jdgzx3qhbtnt2l9pbtvgnagg3ps/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47439",
        "title": "Garten Of Rainbow Monsters",
        "description": "Embark on an epic journey in Garten of Rainbow Monsters. Choose heroes Jack or Sara and battle fearsome foes like BanBan, Blue, Captain Fiddes, Cat, Huggy Wuggy, Jumbo Josh, and NabNab. Unleash powerful attacks, defeat monsters, and progress through stages. Reach the final stage for an ultimate showdown against a formidable boss. Save the garden from the Rainbow Monsters. The fate of the garden is in your hands!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/5mv8c9ym2sod7trmhxna4818oyf0auxb/",
        "category": "Action",
        "tags": "Action, Battle, Battlegrounds, Fighting, Monster",
        "thumb": "https://img.gamemonetize.com/5mv8c9ym2sod7trmhxna4818oyf0auxb/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47428",
        "title": "Fight Bros",
        "description": "Have you ever thrown a stone with a slingshot before? shoot and beat your friend with slingshot. It is a game that can be played for 2 players. Fight with each other with your friend. You have 3 lives. 3 lifeless dies and loses. fight to win. There are 3 different maps. Superpowers are falling because of the sky. Get the gift box and get your power. Kill your opponent with fish oranges and stars.",
        "instructions": " Player 1 can move with the WASD keys You can shoot with the S key Player 2 can move with the Arrow Keys keys You can shoot with the Down Arrow key Mobile play is available ",
        "url": "https://html5.gamemonetize.com/c0z600ozef8ao5r4r4d3nh5mzgsnab3n/",
        "category": "Action",
        "tags": "2 Player, 2 Player Games, 2D, Action, Arcade, Arena, Battle, Fight, H5",
        "thumb": "https://img.gamemonetize.com/c0z600ozef8ao5r4r4d3nh5mzgsnab3n/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47378",
        "title": "Noob Shooter Zombie",
        "description": "You are facing an exquisite action experience! In this unique and addictive game, you have to fight against swarms of cube zombies that appear as you move along the way. Your quick reflexes and sharp shooting will be your greatest weapons for survival. At each step, you will face cube zombies armed with various weapons. Bullet chests will appear in front of you on your journey and will allow you to collect bullets that will feed your weapon. If you run out of bullets, dont worry! By attacking the katana with your weapon, you can destroy the zombies. Your goal is to destroy the entire zombie army and move on! there are 8 different exciting ma",
        "instructions": "Run W Walk S Left A Right D Shoot LEFT CLICK Sword - Katana RIGHT CLICK Bomb F Destroy all the zombies Enter into a tough competition to get the highest scores on all unlocked maps ",
        "url": "https://html5.gamemonetize.com/88m7kpxmeiot3pk2m0knnzk1kfxfoion/",
        "category": "Action",
        "tags": "1 Player, Shoot, Skills, Zombie",
        "thumb": "https://img.gamemonetize.com/88m7kpxmeiot3pk2m0knnzk1kfxfoion/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "47338",
        "title": "Skibidi Toilet Maze",
        "description": "You can only enter forward, backward, right, left or east with the arrow keys. It cannot be controlled by any other key. In a labyrinth filled with Skibidi Toilets, you only need to be able to survive by escaping. Think you can escape from Skibidi Toilets? This is something impossible. But how about you try it anyway? If you lose, remember that you have the right to try again. We wish you good luck in the maze!",
        "instructions": "Move the Player with the ARROW Keys To play again you must right click on the Play Again button ",
        "url": "https://html5.gamemonetize.com/oha7j6w9safr5whk73kmo567mtveip5t/",
        "category": "Action",
        "tags": "1 Player, 3D, 3D Games, Action, endless, Escape, Ghost, HTML, HTML5, Maze, Monster, run, running, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/oha7j6w9safr5whk73kmo567mtveip5t/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "45893",
        "title": "Zombie Area",
        "description": "The numbers of zombies keep increasing day by day and the zombies have started to invade the house, you need to find the exit by clearing them all and surviving!",
        "instructions": "Touch Screen With Mouse",
        "url": "https://html5.gamemonetize.com/9n6r71bt2anodx733obqb4rtfvqi8byl/",
        "category": "Action",
        "tags": "Defense, Escape, Shooter, Zombie",
        "thumb": "https://img.gamemonetize.com/9n6r71bt2anodx733obqb4rtfvqi8byl/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "45918",
        "title": "Realistic Wheelbarrow",
        "description": "Think of a mountain and a wheelbarrow and a track with challenging obstacles, you should be able to climb that mountain with the wheelbarrow so balanced that you can reach the destination and enjoy the view!",
        "instructions": "Arrow Keys W A S D Keys And Touch Screen With Mouse",
        "url": "https://html5.gamemonetize.com/bbxkyuh2uii2h15ex5lyv50qvxlbrpn7/",
        "category": "Action",
        "tags": "Android, Balance, Mobile, Simulation",
        "thumb": "https://img.gamemonetize.com/bbxkyuh2uii2h15ex5lyv50qvxlbrpn7/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "47193",
        "title": "Zombie Day",
        "description": "Zombie Day is a Zombies gameThe player will play the role of an officerthe player cane knock down zombies to obtain resourcesand upgrade various base equipment Feature: 1Player can shoot down the zombie 2: The game&lsquo;s weapon include the UAV Mine, And many firearms 3: Defeating boss can challenge higher difficulty",
        "instructions": "computer you can click on the screen to control the protagonists movement by you mouse phone you can click on the screen to control the protagonists movement by you hand ",
        "url": "https://html5.gamemonetize.com/auoime421spx19so4r9bvghillz15sm8/",
        "category": "Action",
        "tags": "1 Player, 3D, Zombie",
        "thumb": "https://img.gamemonetize.com/auoime421spx19so4r9bvghillz15sm8/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "1909",
        "title": "Police Supercar Parking Mania",
        "description": "Police Chase Supercar Park is not your typical parking game. Here, youre a law enforcement officer driving a supercar, chasing after outlaws and parking to catch them in thrilling high-speed pursuits. The stakes are high and so is the thrill. In the game Park in Supercar Forest, the players task is to park a supercar in a dense forest, with the beautiful yet potentially distracting environment adding a unique twist to the gameplay. Narrow paths and sudden animals crossing your path keep you on your toes, ensuring each parking attempt is a new adventure.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/4g9mk8my1dstafnobami3xqn53ttnxms/",
        "category": "Action",
        "tags": "Android, Cars, Driving, Forest, HTML5, Mobile, Parking, Police, Supercars",
        "thumb": "https://img.gamemonetize.com/4g9mk8my1dstafnobami3xqn53ttnxms/512x384.jpg",
        "width": "800",
        "height": "600"
    }
]