[
    {
        "id": "52241",
        "title": "Hill Climb Race",
        "description": "Hill Climb Race is a hill climbing game where you will drive your car through bumpy road. Take control on acceleration to avoid accident. Cover the maximum distance and make a record. Good Luck",
        "instructions": "On Desktop - Use D Right key to accelerate and A Left key to accelerate in opposite direction On Mobile - Use GUI buttons to control your car ",
        "url": "https://html5.gamemonetize.com/90elpauvjgnduskqynactsd2k0il1ktl/",
        "category": "Adventure",
        "tags": "Action, Car, Cars, Driving, Mobile, Physics, Race, Racing",
        "thumb": "https://img.gamemonetize.com/90elpauvjgnduskqynactsd2k0il1ktl/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "51993",
        "title": "Nubik Dungeon",
        "description": "Immerse yourself in the exciting world of dungeons, where incredible adventures and dangers await you. In this game you have to go through a variety of dungeons full of traps and riddles. Your task is to survive and reach the exit, overcoming all obstacles on the way. Each dungeon will be unique, with its own set of traps and puzzles. You will have to use your wits and reflexes to overcome all obstacles.",
        "instructions": "A move to the left D move to the right W jump Mobile control is enabled in the settings ",
        "url": "https://html5.gamemonetize.com/pmef0eq7dabr91vbvc7o6ywzhlolfvn2/",
        "category": "Adventure",
        "tags": "2D, Android, Arcade, Jumping, Kids, Levels, Pixel, unity",
        "thumb": "https://img.gamemonetize.com/pmef0eq7dabr91vbvc7o6ywzhlolfvn2/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "52147",
        "title": "Tank Transporter",
        "description": "Embark on a thrilling journey in Tank Transporter, where you take charge of an armored convoy on a mission to deliver powerful tanks to the front lines. Maneuver through dynamic battlefields, outsmart enemy ambushes, and upgrade your convoy to ensure a safe and successful transport. With realistic physics and stunning graphics, Tank Transporter offers an immersive experience where every decision counts. Are you ready to navigate the chaos of war and deliver victory on wheels? Command your convoy and become the ultimate Tank Transporter!",
        "instructions": "WASD or Arrow keys",
        "url": "https://html5.gamemonetize.com/c8c92mz9gp6vr917rypq6vn18txm8993/",
        "category": "Adventure",
        "tags": "Adventure, Car, Cars, Casual, Tank, transport, Truck, vehicle",
        "thumb": "https://img.gamemonetize.com/c8c92mz9gp6vr917rypq6vn18txm8993/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "51578",
        "title": "Pocong and Kuntilanak Terror Horror ",
        "description": "pocong and kuntilanak, a horror folk from indonesia make terror again. in abandoned restrict area!",
        "instructions": "WASD move ",
        "url": "https://html5.gamemonetize.com/u3u07l5fq0oxiwsoda90p4svt367cul2/",
        "category": "Adventure",
        "tags": "Horror, HTML5, Prison",
        "thumb": "https://img.gamemonetize.com/u3u07l5fq0oxiwsoda90p4svt367cul2/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51873",
        "title": "Devil Flip",
        "description": "Devil Flip is a fun ragdoll based platform game aiming to fall vertically from high platforms to marked areas on the ground. In our game, customize the game by purchasing special items with the money saving feature. Play a game suitable for all age groups and descend victorious platforms.",
        "instructions": "It is a game played by clicking the left mouse button at the right time and in the right place If you do not earn enough points you cannot pass the level ",
        "url": "https://html5.gamemonetize.com/argbycbbk4u03ujoxd2nue4ero5s9wif/",
        "category": "Adventure",
        "tags": "3D, Adventure, Arcade, Casual, Click, Clicker, Crazy, Fun, Funny, html games for your website, jump, Jumping, Physics, Platform",
        "thumb": "https://img.gamemonetize.com/argbycbbk4u03ujoxd2nue4ero5s9wif/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "50732",
        "title": "Safety Pin Couple",
        "description": "In Safety Pin Couple, embark on a whimsical adventure where safety pins unite! Guide two endearing pins through puzzling levels, navigating obstacles and hazards as they strive to reunite. Utilize their unique abilities to overcome challenges, coordinating their movements to conquer each stage. With charming visuals and cleverly designed puzzles, unravel the story of these inseparable pins. Explore their world, filled with surprises, as you assist them in their heartwarming journey towards togetherness. Website Developer <a href='https://www.vitalitygames.com/new-games.html'>https://www.vitalitygames.com/new-games.html</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/899s34075xbiz51jo9rtyh2h7pgy1j4n/",
        "category": "Adventure",
        "tags": "Adventure, Android, Arcade, HTML5, iPhone, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/899s34075xbiz51jo9rtyh2h7pgy1j4n/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51882",
        "title": "Steve and Alex vs Fnaf",
        "description": "Steve and Alex need to escape from the FNAF monsters in their adventure. They must evade the FNAF monsters everywhere, or eliminate them all. Collect all the gold and become the owner of the keys. The red player should collect the red key, and the blue player should collect the blue key.",
        "instructions": " Played with WASD Arrow Keys Mobile touch control is available double jump available jump on it to kill ",
        "url": "https://html5.gamemonetize.com/q8db8jrdjop99pn1b201dr9qgxd3qreh/",
        "category": "Adventure",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Arcade, Horror",
        "thumb": "https://img.gamemonetize.com/q8db8jrdjop99pn1b201dr9qgxd3qreh/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51778",
        "title": "Mind Games for 2 3 4 Player",
        "description": "Mind Games is a huge game where you can find 2-3-4 player games while playing. The game consists of 27 games under various categories like skill games, Brain Games, matching games, pop-it games, mancala, ludo, and Tic Tac Toe games. Each of these games is fun and made for kids and it is safe to play. Most of these games can be played 2 player, 3 player or 4 player. Website Developer <a href='https://www.twoplayergames.org/'>https://www.twoplayergames.org/</a>",
        "instructions": "Player 1 W A S D and E Player 2 ARROW KEYS and BACKSPACE Player 3 I J K L and O Player 4 T F G H and Y OR Use MOUSE and LEFT-CLICK in turn ",
        "url": "https://html5.gamemonetize.com/vy4op79gbqwnlfzovlh95qinta3gvact/",
        "category": "Adventure",
        "tags": "2 Player, 2D, Action, Brain, Casual, Classic, Mind, Puzzle, puzzleblock, WebGL",
        "thumb": "https://img.gamemonetize.com/vy4op79gbqwnlfzovlh95qinta3gvact/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51714",
        "title": "Lows Adventures 3",
        "description": "Embark on an exhilarating journey with &ldquo;Low&rsquo;s Adventures 3,&rdquo; a captivating 2D pixel art platformer that elevates the franchise to new Featuring 32 meticulously crafted levels, this installment introduces innovative gameplay elements not seen in its predecessors. Join Low in a visually stunning world, filled with challenges. Master new abilities, encounter unique foes, immerse yourself in the nostalgia of pixel art while experiencing the thrill of fresh adventures. Low&rsquo;s Adventures 3 promises an unforgettable gaming experience that combines classic charm with exciting new features!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/qt0u9nkviwxoos4p4fe3lqnlcos823jo/",
        "category": "Adventure",
        "tags": "1 Player, Action, Arcade, Collecting",
        "thumb": "https://img.gamemonetize.com/qt0u9nkviwxoos4p4fe3lqnlcos823jo/512x384.jpg",
        "width": "640",
        "height": "480"
    },
    {
        "id": "51783",
        "title": "Gunshot Odyssey",
        "description": "Gunshot Odyssey is an exciting platform adventure set in a world full of action and challenges. Team up with a hero and immerse yourself in vibrant, detailed environments where dexterity and strategy are key.",
        "instructions": "left up right down a s",
        "url": "https://html5.gamemonetize.com/geyl72kjiftukky63ftxjuht362wpzql/",
        "category": "Adventure",
        "tags": "1 Player, 2D, Action, Adventure, Arcade, free html5 games for your website, Game, games for your website, Gun, html5 games for your site, Shoot, Shooter, Shooting",
        "thumb": "https://img.gamemonetize.com/geyl72kjiftukky63ftxjuht362wpzql/512x384.jpg",
        "width": "800",
        "height": "400"
    },
    {
        "id": "51302",
        "title": "Army Sink",
        "description": "Participate in competitions? gather the biggest crowd and defeat your rivals in a multiplayer game. Become a leader and dont let yourself fall!",
        "instructions": "Use W A S D or Arrow Keys to Move or Use Mouse Left Click to move the character",
        "url": "https://html5.gamemonetize.com/f8xrvmmgxc6flu7nl2srw4n1f1ecmpow/",
        "category": "Adventure",
        "tags": "1 Player, 3D Games, Adventure, Best Games, Fall Boys, Fall Guys, Fun, Multiplayer, Superhero, War",
        "thumb": "https://img.gamemonetize.com/f8xrvmmgxc6flu7nl2srw4n1f1ecmpow/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51625",
        "title": "Jump Or Lose",
        "description": "The water level is rising every second, the best will win. The one who survives the most wins. You have 5 lives. Winning or losing is up to you. Compete and win with your friend. If you want to beat your friend, reach the highest level.Choose a red or blue player color and start the game. Win and buy yourself a hat with the coins.",
        "instructions": " Use the WASD keys to move the red player Use the Arrow Keys to move the blue player Water level is slowly rising Last one standing wins ",
        "url": "https://html5.gamemonetize.com/z4553wb3el16c4rue86hd81070q8oeu4/",
        "category": "Adventure",
        "tags": "2 Player, 2 Player Games, 2D, Adventure, Android, Arcade, Best, Best Games, Mobile",
        "thumb": "https://img.gamemonetize.com/z4553wb3el16c4rue86hd81070q8oeu4/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51518",
        "title": "Grand Crime Auto VI",
        "description": "Welcome to the city of sin&mdash;the place where you can drown yourself in riches! Be prepared to live a new life and experience a limitless world where you make the rules. Do whatever it takes to quickly rake in a vast fortune and become a billionaire. In a world where there is no law, be ready to defend yourself at the drop of a hat.",
        "instructions": "WASD - move F - fly Space - jump",
        "url": "https://html5.gamemonetize.com/cqo9vdf1tjfjhhkpo3urpgsosa7tdtbv/",
        "category": "Adventure",
        "tags": "Car, gta",
        "thumb": "https://img.gamemonetize.com/cqo9vdf1tjfjhhkpo3urpgsosa7tdtbv/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "51581",
        "title": "Moon Adventure",
        "description": "Are you ready for a great moon adventure? Skip the levels before your oxygen tank runs out and be careful because there will be challenging tracks!",
        "instructions": "W A S D or Arrow Keys Movement When you enter the game from a mobile device you can use the touch controls on the screen ",
        "url": "https://html5.gamemonetize.com/rkhyom6f6cg91gmm0yn1f51iq58bbsdh/",
        "category": "Adventure",
        "tags": "1 Player, 2D, Adventure, Arcade, Pixel",
        "thumb": "https://img.gamemonetize.com/rkhyom6f6cg91gmm0yn1f51iq58bbsdh/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "51541",
        "title": "Lava Escape",
        "description": "Lava Escape is a very fun and never-ending game. The objective of the game is to get as far as you can through a maze of rooms and traps, where lava chases you through every room.",
        "instructions": "Use mouse or touch on the screen ",
        "url": "https://html5.gamemonetize.com/jmh2i9gl857veempk9qdtal357y0evro/",
        "category": "Adventure",
        "tags": "1 Player, Avoid, Best, Escape, Fun, Mobile, Obstacle, Skill",
        "thumb": "https://img.gamemonetize.com/jmh2i9gl857veempk9qdtal357y0evro/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "40016",
        "title": "Mad fish 2",
        "description": "This is a game in which you play with piranha. The goal of the game is to grow big fish. You must eat smaller fish than you and not come across big fish yourself. Otherwise you too can be eaten! Play in 1 to 3 players",
        "instructions": "keyboard and mouse click or tap ",
        "url": "https://html5.gamemonetize.com/hblcrg4ea2ypbve0h8m4pjo9j7ye109g/",
        "category": "Adventure",
        "tags": "1 Player, 2 Player, 2 Player Games, Animal, Arcade, Fish, Kids, Shark",
        "thumb": "https://img.gamemonetize.com/hblcrg4ea2ypbve0h8m4pjo9j7ye109g/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "51472",
        "title": "Value Multiplier",
        "description": "Value Multiplier is an exhilarating puzzle game that challenges your strategic thinking and number-crunching skills. Dive into a world of colorful blocks, each with a unique value, and stack them strategically to multiply their worth. As you combine and match these blocks, your score multiplies, but watch out for tricky obstacles that can hinder your progress. With addictive gameplay and engaging challenges, Value Multiplier offers endless fun as you strive to become the ultimate multiplier master. Are you ready to multiply your gaming excitement? Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/eirgpyqi04wacu3djdv9ela82tcmfxjg/",
        "category": "Adventure",
        "tags": "Adventure, Arcade, Fashion, Fun, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/eirgpyqi04wacu3djdv9ela82tcmfxjg/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51382",
        "title": "Digital Circus:Parkour Game",
        "description": "Digital Circus : Parkour Game. Try to pass unique parkour levels. Pass the fun levels prepared by Caine inside the circus and try to escape from the Digital Circus. Try to escape from the digital circus. Dont forget to find the exit. Its up to you to help Pomni. Come on, try to pass the unique tracks and save Pomni from the Digital circus.",
        "instructions": "Mouse or right joystick - Look around WASD or left joystick - Movement Space or jump button - Jump Focus Mouse right click on the screen",
        "url": "https://html5.gamemonetize.com/ygvjmgb91wppx82qphz4o2teukwlftpz/",
        "category": "Adventure",
        "tags": "1 Player, 3D, 3D Games, Action, Adventure, amazing, Best, Best Games, Casual, circus, digital circus, jump, Jumping, Unity3D",
        "thumb": "https://img.gamemonetize.com/ygvjmgb91wppx82qphz4o2teukwlftpz/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51251",
        "title": "Barbarian Clash",
        "description": "Fight your way to victory! Play and fight against other warriors who will fight for your soul and steal them and become more Powerful! Be careful of your surroundings because there can be multiple enemies at a time to take you on! Collect souls to become more powerful and defeat them! Use your awesome boosts to help you in troublesome situations! Buy new and more weapons as you fight your way through the arenas. What side will you take? Can you defeat them all?",
        "instructions": "Use the W A S D Key or Mouse Left Button To Move the Character ",
        "url": "https://html5.gamemonetize.com/9s0wz22xkh9vb1duy05p2do0segv4ign/",
        "category": "Adventure",
        "tags": "1 Player, Action, Adventure, Clans, Clash, Fun, Multiplayer, Shoot",
        "thumb": "https://img.gamemonetize.com/9s0wz22xkh9vb1duy05p2do0segv4ign/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51404",
        "title": "Backrooms: Skibidi Escape",
        "description": "Backrooms: Skibidi Escape is a horror game where you are trapped in the backrooms chased by skibidi toilet and your mission is to find the exit or given number of video tapes to successfully complete each level.",
        "instructions": "WASD - Move Space - Jump ",
        "url": "https://html5.gamemonetize.com/378uq8hqrfbe0sxl4g1sptqj1h938q0c/",
        "category": "Adventure",
        "tags": "3D, 3D Games, Action, Adventure, Escape, Horror, Skibidi, Skibidi Toilet, Unity3D",
        "thumb": "https://img.gamemonetize.com/378uq8hqrfbe0sxl4g1sptqj1h938q0c/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "51340",
        "title": "Parkour Craft Noob Steve 2",
        "description": "Try to escape from drowning in the deserted ocean! Complete all levels. Jump over the blocks and dont fall into the cold water. Compete with your friends. Its time to show your parkour skills! + Show your skill by completing 10 different levels that get progressively harder + Try to reach the portal at the end of each level.",
        "instructions": "Mouse or right joystick - Look around WASD or left joystick - Movement Space or jump button - Jump Focus Mouse right click on the screen",
        "url": "https://html5.gamemonetize.com/241b6j3retr7a0ex0m6i7it0pjx8khdf/",
        "category": "Adventure",
        "tags": "1 Player, 3D, 3D Games, Adventure, Arcade, Best Games, jump, Jumping, Minecraft, Skill, Skills",
        "thumb": "https://img.gamemonetize.com/241b6j3retr7a0ex0m6i7it0pjx8khdf/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51162",
        "title": "Worms Arena iO",
        "description": "A great Snake IO game is beginning with the Worms Arena IO game! The baits are all around the map and collect them to make your snake the largest of the arena. Make strategic moves and trap your opponents to make them fail. Try to achieve the highest score and wear the crown. Unlock new snakes at the marketplace with coins. Let the super snake adventure begin!",
        "instructions": "Move MOUSE or LEFT-RIGHT ARROWS or A D Boost SPACE or LEFT-CLICK",
        "url": "https://html5.gamemonetize.com/kd06w83c3m9ljk56i72bxumj18dd93in/",
        "category": "Adventure",
        "tags": ".io, .io Games, 1 Player, Animal, HTML5, Kids, Skill, Slither, Snake, WebGL",
        "thumb": "https://img.gamemonetize.com/kd06w83c3m9ljk56i72bxumj18dd93in/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51252",
        "title": "StickMan Stunt Race 3D",
        "description": "StickMan Stunt Race 3D is an action-packed game that combines parkour and racing in a fun and exciting way. You will compete with opponents on hundreds of unique levels full of obstacles and traps, such as swinging hammers, spinning saws, giant balls, and more. To win races and reach the finish line, you will need to use your speed, skill, and strategy.",
        "instructions": "Mouse click or Use W and UP Arrow Keys to Move ",
        "url": "https://html5.gamemonetize.com/s6zckm939j3keajynqdlhlt86x3zr5h0/",
        "category": "Adventure",
        "tags": "1 Player, 3D, Fantasy, Fun, Person, Physics, Stickman, Stunts",
        "thumb": "https://img.gamemonetize.com/s6zckm939j3keajynqdlhlt86x3zr5h0/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51203",
        "title": "Blocky Universe",
        "description": "In Blocky Universe, you set out on an adventure in a world full of monsters! With your trusty bow and your ax, its up to you to defeat hordes of zombies, skeletons and other enemies. To do that, you will have to get strong! Cutting wood will help you become a better and faster archer, while spending coins will help you cut wood faster. By upgrading both, youll become the best combination of a lumberjack and an archer in no time! Can you defeat all the bosses, fix the portal and make it back home?",
        "instructions": "click to play",
        "url": "https://html5.gamemonetize.com/4jrlnti5w2xgmx9k80m1a8i130e8qoxa/",
        "category": "Adventure",
        "tags": "3D Games",
        "thumb": "https://img.gamemonetize.com/4jrlnti5w2xgmx9k80m1a8i130e8qoxa/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51158",
        "title": "Parkour Blockcraft",
        "description": "Welcome to the world of Blockcraft! Jump over the blocks to reach the portals! Be careful you may fall down. Finish the game quickly and share your score with your friends! Have fun!",
        "instructions": "Mouse - Look around WASD - Movement Space - Jump",
        "url": "https://html5.gamemonetize.com/7bpo1yed3hi1p1jdodkfjeqs8du9wbae/",
        "category": "Adventure",
        "tags": "3D, 3D Games, Adventure, Block, Minecraft",
        "thumb": "https://img.gamemonetize.com/7bpo1yed3hi1p1jdodkfjeqs8du9wbae/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51032",
        "title": "Parkour Craft Noob Steve",
        "description": "Try to escape from the snowy area! Complete all levels and share your achievements with your friends. Jump over the snow blocks and avoid falling into the icy cold. Its time to show off your parkour skills during Christmas! + Show your skill by successfully completing 8 challenging levels + Aim to reach the portal at the end of each level.",
        "instructions": "Mouse or right joystick - Look around WASD or left joystick - Movement Space or jump button - Jump Focus Mouse right click on the screen",
        "url": "https://html5.gamemonetize.com/8mkc1eq0noitttklorxjpoe5epn9mafv/",
        "category": "Adventure",
        "tags": "1 Player, 3D, 3D Games, Adventure, jump, Jumping, Minecraft, Santa, Santa Claus, Skill, Skills, Snow",
        "thumb": "https://img.gamemonetize.com/8mkc1eq0noitttklorxjpoe5epn9mafv/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48932",
        "title": "Rescue Girl",
        "description": "This is an interesting puzzle in the genre of Pin Pull! There are many modes, go through unique levels with varying difficulty, solve difficult quests, pull a pin or choose the right way to develop the adventure. Find a way to Help the Girl!",
        "instructions": "The left mouse button is to make a choice either remove or move the pin Hold down the left mouse button to start drawing the line then release the button to finish The currency can be earned during the game or as a reward for ads ",
        "url": "https://html5.gamemonetize.com/p6g9mx5rh65xml5zwbhrxp1rn5v0qmfk/",
        "category": "Adventure",
        "tags": "Barbie, Boys, Girls, HTML5, Magic, Princess, Puzzle",
        "thumb": "https://img.gamemonetize.com/p6g9mx5rh65xml5zwbhrxp1rn5v0qmfk/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50891",
        "title": "AntiVirus / War Virus",
        "description": "Introducing the adrenaline-pumping Anti-Virus Game! Arm yourself with epic tools, dive into the virtual world, and take down diabolical viruses. Embark on a mission to safeguard your digital domain, showcasing your tactical prowess and lightning-fast reflexes. Unleash your inner hero and ensure your devices stay virus-free in this thrilling gaming experience.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/hrm17c127o6nlljqcmc8lokhtpyh07xc/",
        "category": "Adventure",
        "tags": "Action, Adventure, Air, airplane, Best Games, Clicker, free games for your site, free html5 games for your website, HTML, Kids, War",
        "thumb": "https://img.gamemonetize.com/hrm17c127o6nlljqcmc8lokhtpyh07xc/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51034",
        "title": "Santa Flight Game",
        "description": "Play as Santa and his reindeer by flying Santas sleigh. Tap the game screen or use the mouse to make Santa fly. Collect candy canes and stockings to score points. Collect stars to obtain a temporary sheild around Santa and his reindeer. Avoid Christmas Ghosts, Snowflakes, and Aliens.",
        "instructions": "Mouse click or tap to play to make Santa and his reindeer fly on the sleigh Collect candy canes and stockings to score points Collect stars to obtain a temporary sheild around Santa and his reindeer Avoid Christmas Ghosts Snowflakes and Aliens ",
        "url": "https://html5.gamemonetize.com/zxyubxptcimejvgebqja9oxjnxzr1tfu/",
        "category": "Adventure",
        "tags": "Action, Christmas, Clicker, Flight, Holiday, Santa Claus",
        "thumb": "https://img.gamemonetize.com/zxyubxptcimejvgebqja9oxjnxzr1tfu/512x384.jpg",
        "width": "1366",
        "height": "768"
    },
    {
        "id": "50975",
        "title": "Mini Grand Thef City",
        "description": "Free game of Mini Grand Thef City, an entertaining game based on the famous GTA game in a minimalist world!! In this entertaining game, you can walk, run through the streets, and assault passersby to create new buildings!!! In this incredibly fun little world, you will have the freedom to enter homes or businesses to steal furniture or sell it to get more money to build!! It sounds fun. Have fun with this game on your favorite device in your favorite browser.Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "Controls Use the mouse or touch the screen to play ",
        "url": "https://html5.gamemonetize.com/3io73p9kwkkyxwssbkxzsngkh34vpenv/",
        "category": "Adventure",
        "tags": "3D Games, Fighting, kiz10, Unity3D",
        "thumb": "https://img.gamemonetize.com/3io73p9kwkkyxwssbkxzsngkh34vpenv/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51070",
        "title": "Awesome Tanks2",
        "description": "Get ready for explosive tank warfare in the adrenaline-pumping action of Awesome Tanks 2! Command your heavily armored vehicle through enemy territory, blasting through obstacles, and obliterating enemy tanks. Upgrade your arsenal, customize your tank, and strategize your way to victory in this addictive and action-packed tank battle game!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/bjy8mnr90x3tc8wu8b8ogy0fzyc2uvyp/",
        "category": "Adventure",
        "tags": ".io, 1 Player, Action, Adventure, Army, Boys, free games for your site, free html5 games for your website",
        "thumb": "https://img.gamemonetize.com/bjy8mnr90x3tc8wu8b8ogy0fzyc2uvyp/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50827",
        "title": "Crazy Extreme Truck Parking Simulation 3d",
        "description": "If you think that you are a best driver and want to test your driving skills that you have learnt in driving school, then you are in the right place.Crazy Extreme Truck Parking Simulation 3d Game 2023 brings you the most challenging hard parking levels. Become a legend driver and start your trucker carrier from driving school where you will learn classical car driving and parking skills. This modern truck drive parking 3D is a perfectly planned truck games for those admirers who love to play the latest modern era futuristic cars parking games of 2023 and 2024.Do you have parking mania and are you ready for modern Truck driving Game test.",
        "instructions": "Use KeyBoard Button T0 Controll Crazy Extreme Truck Parking Simulation 3d ",
        "url": "https://html5.gamemonetize.com/pasaxog8swaef17hvn4gchz552pawuwv/",
        "category": "Adventure",
        "tags": "3D, 3D Games",
        "thumb": "https://img.gamemonetize.com/pasaxog8swaef17hvn4gchz552pawuwv/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50943",
        "title": "Amazing Circus Adventure",
        "description": "Embark on a captivating 2D adventure in Amazing Circus Adventure. Swing, jump, and navigate through whimsical landscapes, encountering quirky circus performers and solving puzzles. Collect coins power-ups and become the star of the greatest show on Earth. A delightful experience with enchanting visuals and lively music awaits you!",
        "instructions": "keyboard JUMP and RUN through exciting levels ",
        "url": "https://html5.gamemonetize.com/l0knmblv4y7etinnt2nh8h4gf3m2afgs/",
        "category": "Adventure",
        "tags": "1 Player, 2D, Platform",
        "thumb": "https://img.gamemonetize.com/l0knmblv4y7etinnt2nh8h4gf3m2afgs/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "50845",
        "title": "Penguin Adventure 2",
        "description": "Join the penguin&rsquo;s adventure in Penguin Adventure! You will play as a penguin who must reach the castle in each level. You will explore three worlds, each with its own challenges and surprises. You will also have to control the penguin&rsquo;s actions. You will collect stars and hearts along the way, which will affect your score and rewards. You will need enough yellow stars to unlock the next world. Penguin Adventure is a game that will test your reaction and strategy. Don&rsquo;t miss this fun game!",
        "instructions": "On PC Up and Down arrows jump and move down J Throw bullets On Mobile Tap buttons move ",
        "url": "https://html5.gamemonetize.com/0moizrof18ozv73qcg41djoene3rpfcq/",
        "category": "Adventure",
        "tags": "2D, Animal, Collecting, Fruit, jump, running",
        "thumb": "https://img.gamemonetize.com/0moizrof18ozv73qcg41djoene3rpfcq/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "50812",
        "title": "Farming Life",
        "description": "Start afresh in a small town with a tiny farm. Build it up and sell your goods on the local market. Become the most popular local farmer with the biggest and best farm around!",
        "instructions": "Tend to the crops and animals so they yield produce which you can sell on the market Use the money to unlock new seeds buildings and grow your farm Upgrade your equipment for better and more efficient yields ",
        "url": "https://html5.gamemonetize.com/q8w2r79771yeqx2v37xqdqwn9oh0bkmo/",
        "category": "Adventure",
        "tags": "Farm, Simulation",
        "thumb": "https://img.gamemonetize.com/q8w2r79771yeqx2v37xqdqwn9oh0bkmo/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49359",
        "title": "Space Junk",
        "description": "The astronaut accidentally found himself in the space junk room. Keep him alive for as long as you can with the joystick or arrows. Collect the blue lights to have more air to breath in space Good luck!",
        "instructions": "Arrows to move and Space to jump",
        "url": "https://html5.gamemonetize.com/0sri22s0hdrvbfl6r900de4f8y2wk7gl/",
        "category": "Adventure",
        "tags": "Space, Spaceship, Unity3D",
        "thumb": "https://img.gamemonetize.com/0sri22s0hdrvbfl6r900de4f8y2wk7gl/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "39958",
        "title": "Santa Runner",
        "description": "Santa Runner - the online endless runner game thats perfect for gift collecting! With simple controls and addictive gameplay, Santa Runner is the perfect game for anyone who loves a challenge. Collect as many gifts as you can and see how far you can run!",
        "instructions": "tap to play",
        "url": "https://html5.gamemonetize.com/oyvl9kewf9sp0p1qehlfnqyyg4ko9bqw/",
        "category": "Adventure",
        "tags": "Collecting, Collection, Fun, Funny, HTML, HTML5, NapTech Games, Online, run",
        "thumb": "https://img.gamemonetize.com/oyvl9kewf9sp0p1qehlfnqyyg4ko9bqw/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "50460",
        "title": "Lorenzo the Runner",
        "description": "Lorenzo the Runner is a 2D Mario-like platformer that takes you on an exhilarating adventure through a vibrant cityscape The game features 4 levels set in 3 distinct environments. Bounce through the levels with slick controls and face a variety of enemies!",
        "instructions": "Arrow keys or A D to move bull W or Up Arrow to jump",
        "url": "https://html5.gamemonetize.com/8eyu67wvt74w2m9kptlk58brx2bhkniy/",
        "category": "Adventure",
        "tags": "1 Player, 2D, Casual, Mario, Pixel, Platform",
        "thumb": "https://img.gamemonetize.com/8eyu67wvt74w2m9kptlk58brx2bhkniy/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "50802",
        "title": "Christmas Land Adventure",
        "description": "Christmas Land Adventures invites you to the magical world of Christmas, where youll assist Santa in overcoming challenges across exciting platformer levels.",
        "instructions": "Mobile Utilize on-screen buttons to control the character Desktop Move using arrow keys and press A to throw snowballs ",
        "url": "https://html5.gamemonetize.com/s9587erz18um7r0od046fcj0z3px7y0o/",
        "category": "Adventure",
        "tags": "2D, Adventure, Christmas, Platform, Snow",
        "thumb": "https://img.gamemonetize.com/s9587erz18um7r0od046fcj0z3px7y0o/512x384.jpg",
        "width": "800",
        "height": "480"
    },
    {
        "id": "50576",
        "title": "Collect Balloons",
        "description": "Are you ready to fight with your friend? But this time, speed wins rather than weapons. Collect the balloons as quickly as possible to defeat your friend. Gather all the balloons and bring them to the balloon machine. The one who collects 20 balloons in the shortest time wins. Be on the red or blue team and gather all the balloons. Jump and catch them, then bring them to the machine.",
        "instructions": "The red player moves using the WASD keys The blue player moves using the arrow keys Collect the balloon and bring it to the balloon machine ",
        "url": "https://html5.gamemonetize.com/ta36mfw10y4h8k6z149q60gnuk4ijqvw/",
        "category": "Adventure",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Arcade, Arena, Boys",
        "thumb": "https://img.gamemonetize.com/ta36mfw10y4h8k6z149q60gnuk4ijqvw/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50570",
        "title": "Extreme Crazy Car Stunt Race Mega Ramps",
        "description": "Playing vertical ramp car racing stunts on your mobile device and living on the edge is always thrilling fun and adventurer&rsquo;s fantasy. If you are bored of playing games or any other games of racing games Then get ready for Extreme Crazy Car Stunt Race Mega Ramps, because we bring you the ultimate super car vertical ramp impossible crazy tracks pro driver one of the best car racing airplane stunts game of 2023. Fasten your seat belt; don&rsquo;t take your hands off the steering wheel in this Extreme Crazy Car Stunt Race Mega Ramps. Mega ramp New Car Racing game has exciting impossible tracks. Mega car jump game with ramp stunts",
        "instructions": "Use Keyboard Button To Controll Extreme Crazy Car Stunt Race Mega Ramps ",
        "url": "https://html5.gamemonetize.com/jlclvndc95fdn0k0atwsazukcwy0r7o5/",
        "category": "Adventure",
        "tags": "3D, Adventure, Best Games, Car, drift, drifting, Driving, Memory, Race, Racing",
        "thumb": "https://img.gamemonetize.com/jlclvndc95fdn0k0atwsazukcwy0r7o5/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50511",
        "title": "City Construction  Games 3D",
        "description": "Construction Simulator: City Building Games you will not only drive a snow excavator to remove snow but also there is one more mode in which you have to take part to build a house from the design home in the construction simulator in the city construction games. In the Excavator Simulator you will have to use a dumper truck with a snow coach and Excavator Driver&rsquo;s main task is to load materials from markets for City Island in the city construction games and deliver them to the construction sites for Building construction in City Construction: Excavation Simulator Game. In the city building games and city-construction games, perform multiple.",
        "instructions": "Use Keyboard Button To Controll The City Construction Games 3D ",
        "url": "https://html5.gamemonetize.com/c50p3g5yp5jri8r8dv3y4m7mrrlj8sw8/",
        "category": "Adventure",
        "tags": "3D, 3D Games, Adventure, Best Games, Bricks, city, Crazy",
        "thumb": "https://img.gamemonetize.com/c50p3g5yp5jri8r8dv3y4m7mrrlj8sw8/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50506",
        "title": "Sky Stunts Rolling Ball 3D",
        "description": "Your mission is to control the ball to the destination, collect coins while driving, reach the goal, collect coins, and finish will gain coins to buy new character balls. Website Developer <a href='https://ja.kizi10.org'>https://ja.kizi10.org</a>",
        "instructions": "WASD - CONTROLL THE BALL FROM THE PC on mobile browser use button UI from the game",
        "url": "https://html5.gamemonetize.com/gxmu4frhxdm6iyrdu16vl2trc7o0hy2y/",
        "category": "Adventure",
        "tags": "Adventure, Android, Ballon, Driving, HTML5, iPad, iPhone, Mentolatux, Mobile, Skill, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/gxmu4frhxdm6iyrdu16vl2trc7o0hy2y/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50513",
        "title": "Friends Pug",
        "description": "Collect all the food with your dog friend and return to your nest. Both friends need to collect their respective foods, overcome obstacles, and reach the nest together. Reach the nest with your friend. Catch the bone to gain special powers and have a superpower.",
        "instructions": " Use the Arrow Keys to move the Brown Dog Use the WASD to move the Grey Dog both mobile and desktop playability ",
        "url": "https://html5.gamemonetize.com/wqwz5h5ri70ifll576ui3sieztueokdb/",
        "category": "Adventure",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Animal, Arcade",
        "thumb": "https://img.gamemonetize.com/wqwz5h5ri70ifll576ui3sieztueokdb/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46112",
        "title": "Box Challenge",
        "description": "Solve engaging puzzles and master the Box Challenge! Train your brain with this addictive game. The ultimate puzzle game that will put your problem-solving skills to the test! Prepare to embark on a captivating journey filled with challenging puzzles and addictive gameplay. In the Box Challenge, your goal is simple yet intriguing: move the colored boxes to their designated target positions. Sounds easy, right? Think again! As you progress through the levels, the puzzles become increasingly complex, requiring strategic thinking and careful planning. Get ready to stretch your mental muscles and overcome each brain-teasing obstacle in your path",
        "instructions": "Box Challenge game controlling is Tap to click Easy to play ",
        "url": "https://html5.gamemonetize.com/piufx90w8nb1w4l86p3i1543tdhd59t7/",
        "category": "Adventure",
        "tags": "2D, Arcade, Casual, Click, Clicker, Fun, Funny, Game, Games, HTML5, Hypercasual, NapTech Games, Online",
        "thumb": "https://img.gamemonetize.com/piufx90w8nb1w4l86p3i1543tdhd59t7/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "50393",
        "title": "Public City Transport Bus Simulator",
        "description": "Bus Driving Games have gotten better over time, and so has Public City Transport Bus Simulator. There are over 3 different vehicles, you will find your favorite to drive around in the immersive and detailed world. All vehicles are fully modeled and have realistic interior and exterior views with freelook feature. Exciting missions and challenges to complete Reward system for upgrades and new destinations Beautiful graphics and immersive sound effects Download Bus Pick and Drop today and start your journey to becoming the ultimate bus driver.",
        "instructions": "Use Keyboard Button To Controll The Public City Transport Bus Simulator ",
        "url": "https://html5.gamemonetize.com/kv7hc5tczxs5bet5g4w44jhbp96qsfnn/",
        "category": "Adventure",
        "tags": "Adventure, Driving, Simulation",
        "thumb": "https://img.gamemonetize.com/kv7hc5tczxs5bet5g4w44jhbp96qsfnn/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50314",
        "title": "Ghostly Spikes",
        "description": "This Halloween season, Jhurr Games is bringing you a unique game called Ghostly Spikes. Help this adorable ghost fly around without hitting the spikes so that it can survive for as long as can. It&rsquo;s a bizarre and deadly place. Reach great scores and set a challenge for your friends to surpass you. Enjoy this Halloween season by playing the hilarious game Ghoslty Spikes. Website Developer <a href='https://jhurr.com/'>https://jhurr.com/</a>",
        "instructions": "Tap to Fly",
        "url": "https://html5.gamemonetize.com/zb5irqol5moia70jk4g3w4romdjwbrwl/",
        "category": "Adventure",
        "tags": "1 Player, Clicker, fly, Ghost, Halloween",
        "thumb": "https://img.gamemonetize.com/zb5irqol5moia70jk4g3w4romdjwbrwl/512x384.jpg",
        "width": "350",
        "height": "6263"
    },
    {
        "id": "50118",
        "title": "Golden Sword Princess",
        "description": "Golden Sword Princess is an adventure game with multiple levels, great graphics and addictive gameplay. Help the Golden Princess make her way and meet the characters in her huge world. Guaranteed hours of fun in this unique platform game.",
        "instructions": "Desktop On the keyboard press the C key to attack Press the X key to jump Press Spacebar or Enter to pause unpause Mobile Use the touch keys on the screen ",
        "url": "https://html5.gamemonetize.com/v70xpf0cxx33jbylvojvilrj63dcoxz2/",
        "category": "Adventure",
        "tags": "1 Player, 2D, Adventure, Girl, Platform, Princess, Sword",
        "thumb": "https://img.gamemonetize.com/v70xpf0cxx33jbylvojvilrj63dcoxz2/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "43031",
        "title": "Line Pixel Adventure",
        "description": "Embark on a great adventure with your pixel character in the Line Pixel Adventure game! Destroy the enemies, improve yourself and win the game!",
        "instructions": "W A S D or Arrow Keys Movement Space Attack If you enter the game from mobile you can use the touch controls ",
        "url": "https://html5.gamemonetize.com/4vv07faztutgjbusp5qhpz1q4jvglqop/",
        "category": "Adventure",
        "tags": "1 Player, 2D, Action, Adventure, Arcade, Fun, jump, Monster, Music, Pixel, Platform",
        "thumb": "https://img.gamemonetize.com/4vv07faztutgjbusp5qhpz1q4jvglqop/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "50069",
        "title": "Modern Tuk Tuk Rickshaw Game",
        "description": "Get Ready to the thrilling world of Auto Rickshaw Adventures! Buckle up and get ready to embark on a fast-paced, action-packed journey through the bustling streets of a vibrant city. This unique and exciting game lets you take on the role of an auto rickshaw driver, navigating through challenging traffic and completing various missions to become the ultimate auto rickshaw champion!",
        "instructions": "USE KEYBOARD BUTTONS TO CONTROLL THE RIKSHAW ",
        "url": "https://html5.gamemonetize.com/ahfni0cfellvd7wiqlcobdd0nnn0i0ft/",
        "category": "Adventure",
        "tags": "3D, 3D Games, Adventure, Driving, Simulation",
        "thumb": "https://img.gamemonetize.com/ahfni0cfellvd7wiqlcobdd0nnn0i0ft/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46267",
        "title": "Rocket Odyssey",
        "description": "Rocket Odyssey is a simple yet addictive game where you control a rocket ship as it flies through a series of obstacles. The goal of the game is to get as far as possible without crashing. The obstacles in the game include pipes, trees, and other objects.",
        "instructions": "Desktop tap the left button of mouse to fly Mobile Tap on thescreen to fly ",
        "url": "https://html5.gamemonetize.com/bztzrhcukbxmyk8to680q2s5ozd9eyqx/",
        "category": "Adventure",
        "tags": "Adventure, HTML, HTML5, Interactive, NapTech Games, Online, sky, Spaceship",
        "thumb": "https://img.gamemonetize.com/bztzrhcukbxmyk8to680q2s5ozd9eyqx/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "48502",
        "title": "Lode Retro Adventure",
        "description": "Relive the classic fun of Lode Retro Adventure, a 2D pixel game that will make you dig for gold. You will play as a gold miner who must collect a certain amount of gold coins in each level. You will use your shovel to break the ground tiles and trap the purple monsters, but be careful, they can escape and chase you. You will also find other treasures such as golden bananas that will boost your score. Lode Retro Adventure is a game that will test your strategy. Can you collect all the gold coins?",
        "instructions": "PC WASD to move Space to dig a hole Mobile Tap buttons to move and dig holes",
        "url": "https://html5.gamemonetize.com/hzkv6puazafel4j5jroq5e250frz78p7/",
        "category": "Adventure",
        "tags": "2D, Boys, Collecting, Cute, Girls, Kids, Mine, Pixel",
        "thumb": "https://img.gamemonetize.com/hzkv6puazafel4j5jroq5e250frz78p7/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "50281",
        "title": "One Bit",
        "description": "Start overcoming the tracks with your one-bit character in the One bit game! Dont forget to get a checkpoint in the game and win the game by completing the obstacles!",
        "instructions": "W A S D or Arrow Keys Movement C Checkpoint When you enter the game from a mobile device you can use the touch controls on the screen ",
        "url": "https://html5.gamemonetize.com/bhgysistyfih290cgcv3vsoamvlrk99t/",
        "category": "Adventure",
        "tags": "1 Player, 2D, Adventure, Pixel, Platform",
        "thumb": "https://img.gamemonetize.com/bhgysistyfih290cgcv3vsoamvlrk99t/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50055",
        "title": "Super Frog Adventure",
        "description": "Super Frog Adventure is a great platformer that takes you into the world of classic Super Mario style games. The game features 8 incredible and challenging levels, each offering unique obstacles and challenges. Control the super frog, overcome obstacles, fight enemies and collect coins on your way to the finish line. Dynamic gameplay and vivid graphics will make your journey exciting and memorable. This game is designed for both beginners and experienced players, thanks to different difficulty levels and interesting gameplay mechanics. If you love classic platformers and are ready for a new adventure, Super Frog Adventure is waiting for y",
        "instructions": "Desktop Left Right or A D keyboard keys to move the character Up arrow or W keyboard key to make the character jump Mobile Use touch screen buttons Press jump button in the air to perform a double jump Collect all the fruits to pass the level ",
        "url": "https://html5.gamemonetize.com/uhisirdejvmyuohajyblfo6i2v045qsa/",
        "category": "Adventure",
        "tags": "1 Player, Adventure, Animal, Fruits, jungle, Platform",
        "thumb": "https://img.gamemonetize.com/uhisirdejvmyuohajyblfo6i2v045qsa/512x384.jpg",
        "width": "480",
        "height": "270"
    },
    {
        "id": "50054",
        "title": "Battle Farmer   2 Player",
        "description": "Have you ever caught runaway chickens before? You must catch all the chickens. To catch the runaway chickens, you need to act fast. Farmers are competing. The red and blue farmers must win the race. Be any farmer and win the race. Play with your friend and collect the chickens as quickly and early as possible. You must catch all the runaway chickens. The one who collects 10 chickens the fastest wins.",
        "instructions": " Use the WASD keys and Arrow keys to move The fastest to collect 10 chickens wins Collect all the chickens in 120 seconds ",
        "url": "https://html5.gamemonetize.com/32zitzr1ulno5raigyq36fxntfk0l7gl/",
        "category": "Adventure",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Animal, Arcade, Battle, Minecraft, Mobile",
        "thumb": "https://img.gamemonetize.com/32zitzr1ulno5raigyq36fxntfk0l7gl/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50082",
        "title": "Gold Miner Challenge",
        "description": "The challenge begins at the minings with the Gold Miner Challenge game! These mines are located in different places worldwide and you will try to find the most precious stones, gold, diamonds, and more. During your adventure you may encounter some difficulties during mining, if you could aim well, you can collect all of the precious stones within a limited time. You can also challenge a friend in 2-player mode and collect precious stones together!",
        "instructions": "Player 1 Hook S or DOWN ARROW IN 1P MODE ONLY Bomb G Player 2 Hook DOWN ARROW Bomb UP ARROW",
        "url": "https://html5.gamemonetize.com/0jbcu95bveubvxsl4hrh3ovfsm7f3pqy/",
        "category": "Adventure",
        "tags": "1 Player, 2 Player, 2 Player Games, Adventure, Casual, Gold, Mine, Miner, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/0jbcu95bveubvxsl4hrh3ovfsm7f3pqy/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "49916",
        "title": "Spiderman 2 Web Shadow",
        "description": "find mysteries between spiderman 2",
        "instructions": "mouse only",
        "url": "https://html5.gamemonetize.com/e427vwcyt159xm6cr75qerc3julzxhew/",
        "category": "Adventure",
        "tags": "Adventure, Spiderman",
        "thumb": "https://img.gamemonetize.com/e427vwcyt159xm6cr75qerc3julzxhew/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49929",
        "title": "Event Space",
        "description": "Adventure Park: World of Joy is an exciting 3D game that allows players to explore and experience a vibrant and fun-filled amusement park. In this game, you will step into a world of magic and happiness, where there are countless exciting mini-games waiting for you to discover and participate in .",
        "instructions": "Mouse and Keyboard ",
        "url": "https://html5.gamemonetize.com/m0e6thbp7mjuo03vlfl6v1ez16r25cdu/",
        "category": "Adventure",
        "tags": "3D",
        "thumb": "https://img.gamemonetize.com/m0e6thbp7mjuo03vlfl6v1ez16r25cdu/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "49878",
        "title": "Super Maksim World",
        "description": "Control Maxim in this classic little platformer game. A fun and challenging platformer game based on the greatest classic of its kind. Help Maxim to pass 4 difficult levels. Collect coins and get more points! Website Developer <a href='https://onduck.com/'>https://onduck.com/</a>",
        "instructions": "Mobile Devices touch control Desktop devices the A key is for running the S key is for jumping and the arrows are for moving ",
        "url": "https://html5.gamemonetize.com/d521nwdn7vhdzq5z7gios694y7bkut42/",
        "category": "Adventure",
        "tags": "1 Player, 2D, Adventure, Mario, Pixel, Platform",
        "thumb": "https://img.gamemonetize.com/d521nwdn7vhdzq5z7gios694y7bkut42/512x384.jpg",
        "width": "320",
        "height": "180"
    },
    {
        "id": "49821",
        "title": "Firefight Upgrader",
        "description": "Gear up for an intense firefighting experience in Firefight Upgrader! Take on the role of a courageous firefighter, battling towering flames and saving lives. Customize your firefighter with an array of powerful upgrades, from advanced hoses to high-tech gear. Strategize your approach, prioritize missions, and rescue civilians in perilous situations. With realistic fire physics and dynamic environments, every blaze is a new challenge. Can you rise through the ranks, upgrading your skills and gear to become the ultimate hero? Website Developer <a href='https://www.coolcrazygames.com/'>https://www.coolcrazygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/rbzwddvgyqelskvqrhtiofy7ru4nvcc0/",
        "category": "Adventure",
        "tags": "1 Player, Adventure, Arcade, Fighting, Fire, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/rbzwddvgyqelskvqrhtiofy7ru4nvcc0/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "49284",
        "title": "Offroad Army Transporter",
        "description": "If you like to play car driving simulation games, you will like this vehicle driving simulation game called US Army Vehicle Transporter Truck. It is managed for you to transport both tanks and cars to the pointed military base with a provided truck at each level. Before transporting missions, you usually need to drive the tanks and cars on or off the truck. Keep",
        "instructions": "WASD or Arrow keys ",
        "url": "https://html5.gamemonetize.com/pfguvprgeyctw1wsrqdozw1dajz3ldui/",
        "category": "Adventure",
        "tags": "1 Player, 3D, Adventure, Arcade, Army, Boy, Car, Driving, Parking, Simulation, Tank, Truck, vehicle, WebGL",
        "thumb": "https://img.gamemonetize.com/pfguvprgeyctw1wsrqdozw1dajz3ldui/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "49742",
        "title": "Paper Pixel Adventure",
        "description": "Paper Pixel Adventure is a very fun adventure game. You have to destroy the sweet monsters in the game and get the right to move on to other levels! No doubt you will have a lot of fun!",
        "instructions": "W A S D or Arrow Keys Movement Space Attack When you enter the game from a mobile device you can use the touch controls on the screen ",
        "url": "https://html5.gamemonetize.com/4n0azlphf9zxu1heg0hdbgu7vst212va/",
        "category": "Adventure",
        "tags": "1 Player, 2D, Adventure, Arcade, Block, Pixel, Platform",
        "thumb": "https://img.gamemonetize.com/4n0azlphf9zxu1heg0hdbgu7vst212va/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "49548",
        "title": "Pond Story",
        "description": "Are you ready for a pond story? In this story you must save your friend and win the game! You can buy new equipment by collecting gold from the enemies you have destroyed and the environment!",
        "instructions": "W A S D or Arrow Keys Movement R Change Weapon Space Attack When you enter the game from a mobile device you can use the touch controls on the screen ",
        "url": "https://html5.gamemonetize.com/2pqg3dvo5m20pzuxkqmk6o751361j2aq/",
        "category": "Adventure",
        "tags": "1 Player, 2D, Adventure, Arcade, Monster, Pixel, Platform",
        "thumb": "https://img.gamemonetize.com/2pqg3dvo5m20pzuxkqmk6o751361j2aq/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49297",
        "title": "Zoo Tycoon",
        "description": "Zoo Tycoon is a captivating simulation game that lets you become the ultimate zookeeper. Build and manage your dream zoo, carefully selecting animals, creating immersive habitats, and keeping your visitors happy. Whether you want to nurture endangered species, design thrilling exhibits, or maximize profits, the choice is yours. With stunning graphics and realistic gameplay, Zoo Tycoon offers endless hours of fun and challenges. Will you create a world-renowned animal haven or a bustling wildlife attraction? Website Developer <a href='https://www.brightygames.com'>https://www.brightygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/kb4nylf2luxv6nnde2x449ypxtjlodmu/",
        "category": "Adventure",
        "tags": "1 Player, Adventure, Animal, Arcade, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/kb4nylf2luxv6nnde2x449ypxtjlodmu/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49415",
        "title": "Hunter Steve",
        "description": "Hunter Steven needs to hunt down all the monsters. Take your weapon and hunt down all the monsters. Be careful, some monsters are stronger, and its harder to kill them. But, of course, you can buy a more powerful weapon and kill them all. Go to the store, get a stronger weapon, and hunt down all the monsters.",
        "instructions": "To move use the WASD keys To fire use the Mouse left-click Kill all the zombies and complete the missions ",
        "url": "https://html5.gamemonetize.com/852ewedojj3c6omk2fwf07mccv01pb0b/",
        "category": "Adventure",
        "tags": "1 Player, 2D, Action, Adventure, Alien, Arcade, Arena, Army, Battle, Best, Boy, Interactive",
        "thumb": "https://img.gamemonetize.com/852ewedojj3c6omk2fwf07mccv01pb0b/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49409",
        "title": "Ragdoll Step",
        "description": "Ragdoll Step is an exciting physics-based adventure that will test your reflexes and creativity. Step into a whimsical world where you control a lovable ragdoll character on a quest to navigate treacherous obstacles. With precise timing and clever moves, guide your ragdoll through challenging levels filled with traps, puzzles, and surprises. Whether youre leaping through the air or wobbling your way to victory, Ragdoll Step offers hours of hilarious and addictive gameplay. Get ready to step into a world where every move counts in this thrilling ragdoll escapade!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/9zbxubkl0wk2zbpe2jrblcqwmqi71faa/",
        "category": "Adventure",
        "tags": "1 Player, Adventure, Arcade, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/9zbxubkl0wk2zbpe2jrblcqwmqi71faa/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49329",
        "title": "Guns Zombie",
        "description": "Hey soldier, quickly grab your weapon and protect the world; there are zombies everywhere, killing people. Take your weapon and grab your ammunition. Shoot at the zombies quickly. Your mission is to kill all the zombies. Eliminate the zombies and collect their gold. The best and most powerful weapons should be yours.",
        "instructions": "To move use the WASD keys To fire use the Mouse left-click Kill all the zombies and complete the missions ",
        "url": "https://html5.gamemonetize.com/55t6rjnj66zcw1xjynwlmd7wb8p20n0z/",
        "category": "Adventure",
        "tags": "2D, Action, Alien, Animal, Arcade, Best, Best Games, Gun",
        "thumb": "https://img.gamemonetize.com/55t6rjnj66zcw1xjynwlmd7wb8p20n0z/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49183",
        "title": "Spooky Forest Run",
        "description": "You went for a walk in the forest, but suddenly a creepy skeleton starts chasing you. Run through the forest to get away from the skeleton. Tap the screen to jump over objects and other characters. If the skeleton catches you its game over!",
        "instructions": "Mouse click or tap to play Double tap to double jump ",
        "url": "https://html5.gamemonetize.com/wp27gdq9i9gmo4c8rez4t1wlbulaftq9/",
        "category": "Adventure",
        "tags": "Forest, Ghost, Halloween, Mobile, running",
        "thumb": "https://img.gamemonetize.com/wp27gdq9i9gmo4c8rez4t1wlbulaftq9/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49250",
        "title": "Battling Zombies",
        "description": "A plant synthesis game where synthetic plants automatically attack monsters. There are various plants appearing, and there are also various bosses waiting for you to challenge!",
        "instructions": "A plant synthesis game where synthetic plants automatically attack monsters There are various plants appearing and there are also various bosses waiting for you to challenge ",
        "url": "https://html5.gamemonetize.com/alsuvgzub2esy875yu3gddlgxu7ze1i6/",
        "category": "Adventure",
        "tags": "1 Player, 2D",
        "thumb": "https://img.gamemonetize.com/alsuvgzub2esy875yu3gddlgxu7ze1i6/512x384.jpg",
        "width": "720",
        "height": "1252"
    },
    {
        "id": "49304",
        "title": "Circuitry of the Dead",
        "description": "About the game In &ndash; Circuitry of the Dead &ndash; a post-apocalyptic world is overrun by zombies and robots, and you&rsquo;re the last line of defense. Survive against relentless waves of undead and high-tech foes by strategically choosing weapons, deploying automated turrets, and using precision shurikens. Earn currency to upgrade your gear and prove your survival skills in a world on the brink of extinction. How long can you survive in this relentless struggle for humanity&rsquo;s last hope?",
        "instructions": "Touch and mouse control Desktop - Move Left Click - Shoot Mobile Touch the to Move Click the target icon To Shoot",
        "url": "https://html5.gamemonetize.com/7zu7r6uev92d5p2et3e0h4qzlgicimlq/",
        "category": "Adventure",
        "tags": "1 Player, Action, Adventure, Android, Arcade, Best Games, Robot, Zombie",
        "thumb": "https://img.gamemonetize.com/7zu7r6uev92d5p2et3e0h4qzlgicimlq/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49272",
        "title": "Robot Car Transform 2 ",
        "description": "Are you ready for Robot Car Transform 2, the most fun and exciting simulation game ever? It&rsquo;s not just about robots and cars, it&rsquo;s about transforming robots and awesome cars! You can drive all kinds of amazing robots and transform them into cool robots with different abilities! Do you like red, black, or blue? Choose your favorite color and style! Do you have what it takes to complete all the missions? Use your intelligence and the two forms of your robot to overcome them! How big is the 3D world? You won&rsquo;t believe it until you see it! Don&rsquo;t miss this chance to have the best robot car adventure of your life!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/bsheuaymtm3v25ulbbpn6l6aezq5rstt/",
        "category": "Adventure",
        "tags": "Avoid, Boys, Car, Collecting, Robot, Simulation",
        "thumb": "https://img.gamemonetize.com/bsheuaymtm3v25ulbbpn6l6aezq5rstt/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "49197",
        "title": "Jungle Jim",
        "description": "Have fun with this entertaining new 2D platformer game. Jungle Jim will need all your jump and run skills to reach the treasure chest at the end of each level. Along the way, break blocks, pick up fruits and collect coins to increase your score while avoiding enemies, spikes, and exploding blocks. Note that big mushrooms can serve as trampolines. There are 7 levels to play and the difficulty increases as you proceed.",
        "instructions": "Press LEFT or RIGHT arrow to move UP arrow to jump On desktop you can also use WAD keys or a gamepad Start the game by touching clicking the Play button On desktop you can also start by pressing the D key or pressing START on a gamepad ",
        "url": "https://html5.gamemonetize.com/65d55f59mcc4vfrzase41skntrokkorr/",
        "category": "Adventure",
        "tags": "2D, Action, Adventure, Arcade, Cartoon, Casual, Collecting, Forest, jump, jungle, Mario, Platform, run, Side Scrolling",
        "thumb": "https://img.gamemonetize.com/65d55f59mcc4vfrzase41skntrokkorr/512x384.jpg",
        "width": "960",
        "height": "540"
    },
    {
        "id": "49201",
        "title": "Autumn Endless Runner",
        "description": "You went out for a walk in a wooded area to view the beautiful autumn scenery, but then a creepy pumpkin ghost started chasing you. Run down the path to escape the pumpkin ghost. Tap the game screen to jump over obstacles and animals you encounter. Dont let the pumpkin ghost catch you!",
        "instructions": "Tap the game screen to jump Double tap to double jump Avoid all obstacles and animals ",
        "url": "https://html5.gamemonetize.com/wbkkipl2cqoy1a9isgajuovum40ruz0g/",
        "category": "Adventure",
        "tags": "Action, Animal, Arcade, endless, Forest, Halloween, running",
        "thumb": "https://img.gamemonetize.com/wbkkipl2cqoy1a9isgajuovum40ruz0g/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "48769",
        "title": "Raft Evolution",
        "description": "Sea Survival is an open sandbox where there is no civilization, only wildlife, build a raft, get resources, fish and cook, and then explore the islands. The objective of the game is to survive as long as possible while facing various obstacles and challenges. Use the grappling hook to collect lost chests, boards and other resources nearby.Build and upgrade your raft, craft a workbench, a bowler hat, a bed, unlock new items. The game features a day and night cycle, and player will have to balance their activities during the day and night.",
        "instructions": "Movement - WASD Jump - Spacebar Weapon - Left mouse button Select Hook - Right Mouse Button Inventory - T Craft -Y Cancel building - Right mouse button Rotate building - Q ",
        "url": "https://html5.gamemonetize.com/axvy68jw3vbd632xu4yxin9u8kd5uw08/",
        "category": "Adventure",
        "tags": "Action, Adventure, Craft, Crafting, Sandbox, Shark, Simulator, survival",
        "thumb": "https://img.gamemonetize.com/axvy68jw3vbd632xu4yxin9u8kd5uw08/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "49143",
        "title": "Dragon Ball Treasure Hunter",
        "description": "Hunt all dragon ball in the scene. Find them all! Beyond the epic battles, experience life in the DRAGON BALL Z world as you fight",
        "instructions": "mouse only",
        "url": "https://html5.gamemonetize.com/b6j0kxmgizy8pdg4t1gjuc1riw0hwxba/",
        "category": "Adventure",
        "tags": "Dragon Ball Z, Kid, Puzzle",
        "thumb": "https://img.gamemonetize.com/b6j0kxmgizy8pdg4t1gjuc1riw0hwxba/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49118",
        "title": "Steve Hardcore",
        "description": "Are you ready for Steves exciting adventure? There are green monsters everywhere, and you need to collect all the obsidian pieces. Gather all the pieces and reach the opened black hole. Go through the black hole and reach the portal in the cave. You must reach the portal safely. Remember, youre in hardcore mode. You have three chances to die. If you die more than three times, all levels will be deleted, and youll start from scratch.",
        "instructions": " Played with WASD Arrow Keys Mobile touch control is available ",
        "url": "https://html5.gamemonetize.com/qs38bf20ttu1xfe0ky02ta1guhwp9jwk/",
        "category": "Adventure",
        "tags": "1 Player, 2D, Action, Adventure, Arcade, Best, Best Games, Minecraft, Miner, Pixel",
        "thumb": "https://img.gamemonetize.com/qs38bf20ttu1xfe0ky02ta1guhwp9jwk/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49042",
        "title": "Assassin Ninja Rush",
        "description": "Experience high-octane ninja action in Assassin Ninja Rush! Take control of an assassin ninja, sprinting and dodging through enemies. Strategically eliminate foes to reach new levels. Unlock characters and weapons by completing levels or using gold coins in the in-game store. Dodge bullets, smash crates for health, and hone your skills to become the ultimate ninja assassin! Assassin Ninja Rush delivers an immersive, arcade-style 3D adventure that will put your ninja abilities to the test.",
        "instructions": "Tap and drag to aim rush route release to let the ninja move",
        "url": "https://html5.gamemonetize.com/4u0xi4xzgenklu3n77ikfb0ra7rztbzo/",
        "category": "Adventure",
        "tags": "2D, Avoid, Collecting, Platform, run, Stickman",
        "thumb": "https://img.gamemonetize.com/4u0xi4xzgenklu3n77ikfb0ra7rztbzo/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "47806",
        "title": "Little Dino Returns 2023",
        "description": "Join Little Dino in an exciting adventure as he returns in the all-new game, Little Dino Adventure Returns 2023! This delightful 2D platformer offers a thrilling and challenging experience across 06 vibrant levels that will put your skills to the test. Embark on a colorful journey through the valley of fear, where our little hero encounters numerous obstacles and challenges. Your mission is to help Little Dino collect all the precious golden eggs scattered throughout each stage to earn three stars and conquer every level. Play this game exclusively on gamehippy.com",
        "instructions": "Whether youre using arrow keys or touch buttons on your phones screen the gameplay is smooth and responsive making it perfect for both desktop and mobile gaming ",
        "url": "https://html5.gamemonetize.com/ygy1welodkrvbuxb7j2976hwytu87as9/",
        "category": "Adventure",
        "tags": "2D, Adventure, dino",
        "thumb": "https://img.gamemonetize.com/ygy1welodkrvbuxb7j2976hwytu87as9/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49076",
        "title": "Grimace Shake Hidden Skibidi Toilet",
        "description": "Find skibidi toilet between Grimace Shake",
        "instructions": "use mouse",
        "url": "https://html5.gamemonetize.com/jqg4ayajsoadoejvqdna1gw6m559p1sm/",
        "category": "Adventure",
        "tags": "Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/jqg4ayajsoadoejvqdna1gw6m559p1sm/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49027",
        "title": "Jetpack Meteorfall",
        "description": "About the game In the midst of a meteor shower, your spacecraft malfunctions, leaving you with no choice but to make a daring escape. Take to the skies in this high-flying endless adventure! Soar through a world filled with danger and excitement as you collect coins and avoid oncoming drones and rockets. Customize your experience with money-collecting magnets, shield systems for protection, and a team of loyal drones that fly by your side, strategically shooting down oncoming threats. Will you rise to the challenge and become the ultimate airborne daredevil?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/y2k8uz9k1cisv7ydugmsa8vda0kg33v0/",
        "category": "Adventure",
        "tags": "Action, Adventure, Best Games, endless, Hypercasual",
        "thumb": "https://img.gamemonetize.com/y2k8uz9k1cisv7ydugmsa8vda0kg33v0/512x384.jpg",
        "width": "630",
        "height": "360"
    },
    {
        "id": "46356",
        "title": "Red Moon",
        "description": "Once a decade, the moon shines Red... on that day, we, the Red Samurais, gain its immense power. Can you feel it? With its power, we will seize this kingdom. Are you ready to unleash the fury? Join Eivana on a grand adventure to overthrow the king. Play through 20 action packed levels, engage in 2 wild boss battles, while unlocking 13 medals as well as various concept art and music.",
        "instructions": "Use the arrow keys to move and Z Y to attack You can make double-jumps if you jump again while in the air The Red meter shows your health and the Blue meter shows your power You need power to perform special attacks which you do with the Spacebar ",
        "url": "https://html5.gamemonetize.com/l5w737qbz4h8lkrw5boo6r6dzp66n4q6/",
        "category": "Adventure",
        "tags": "1 Player, 2D, Adventure, Game, Games, HTML, HTML5, Online, Red, Samurai",
        "thumb": "https://img.gamemonetize.com/l5w737qbz4h8lkrw5boo6r6dzp66n4q6/512x384.jpg",
        "width": "960",
        "height": "550"
    },
    {
        "id": "48645",
        "title": "Forest Survival Simulator: Animal Evolution",
        "description": "Dive into the captivating world of Forest Simulator: Animal Evolution. Begin as a small, vulnerable creature and fight for survival against hunger and predators. Accumulate experience and coins daily to advance. Unlocking new animals is your key to progress. Enhance skills like speed, strength, and defense to overcome challenges. Evade predators or become one. Tailor your strategy to your style.",
        "instructions": "Movement - WASD Camera - Mouse Control Attack - Left Mouse Button Eat - F or E",
        "url": "https://html5.gamemonetize.com/rdylnlvekzcuq9077imjy9lse8w77r11/",
        "category": "Adventure",
        "tags": "1 Player, 3D Games, Action, Adventure, Animal, Fighting, Forest, Simulation, Simulator, survival",
        "thumb": "https://img.gamemonetize.com/rdylnlvekzcuq9077imjy9lse8w77r11/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "48679",
        "title": "Merge Fighting 3d",
        "description": "Do you enjoy fighting? Do you want to eliminate your enemies using various weapons? Merge Fighting 3d satisfies your needs! It is a fighting game! In Merge Fighting 3d, you need to merge in order to obtain powerful weapons! Only by using these weapons can you defeat more and more enemies! How many levels can you complete under enemy siege? Give this game a try! Have fun playing!",
        "instructions": "Swipe to play",
        "url": "https://html5.gamemonetize.com/7jjkdne5qe96pq0a06xqfb9h8b7xemul/",
        "category": "Adventure",
        "tags": "Battle, Fight, Monster, Simulation, Stickman, Sword, weapons",
        "thumb": "https://img.gamemonetize.com/7jjkdne5qe96pq0a06xqfb9h8b7xemul/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "48553",
        "title": "Dino Evolution 3d",
        "description": "Welcome to the cruel world of dinosaurs! This is a gladiatorial arena! You can only win by becoming the final victor! How do you make yourself strong? Collect various fruits and become the highest-ranked dinosaur! Can you survive the siege of enemies? The time to test you has come! Try this game! Have fun!",
        "instructions": "Swipe to play",
        "url": "https://html5.gamemonetize.com/5784nfm11ntd1qqtxzmbwkm87ey94mu0/",
        "category": "Adventure",
        "tags": ".io, Animal, Collecting, Dinosaur, Fruit, Simulation",
        "thumb": "https://img.gamemonetize.com/5784nfm11ntd1qqtxzmbwkm87ey94mu0/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "47495",
        "title": "Survive the Sharks",
        "description": "You were out on a boat and accidentally fell overboard into the ocean. Unfortunately no one noticed and the boat left you there in the middle of the ocean. There are sharks in the water and you have not choice but to try to swim for land to save yourself as there doesnt seem to be any boats in the area. Swim for land which will appear in a random location each game and try to avoid the sharks if you can. There are also harmless fish in the ocean, but these fish wont harm you. Good luck!",
        "instructions": "On a mobile device touch the game screen to move the player On a desk top you can either use the mouse or the arrow keys ",
        "url": "https://html5.gamemonetize.com/jvycvhbuw0mfnyi1zkqfi6wnwlb746mw/",
        "category": "Adventure",
        "tags": "Action, Adventure, Island, Shark",
        "thumb": "https://img.gamemonetize.com/jvycvhbuw0mfnyi1zkqfi6wnwlb746mw/512x384.jpg",
        "width": "1366",
        "height": "768"
    },
    {
        "id": "37107",
        "title": "Grimace Birthday Escape",
        "description": "Run across the maze and find your way out before you got spotted by the grimace monster. Find the door to unlock the next level. collect lives and the grimace shake jus. attack the monster by shoot jus to destroy him. Enjoy",
        "instructions": "Follow the game",
        "url": "https://html5.gamemonetize.com/zfi43hwcd7th9zlgr1occj1oi6b6ccg3/",
        "category": "Adventure",
        "tags": "Grimace",
        "thumb": "https://img.gamemonetize.com/zfi43hwcd7th9zlgr1occj1oi6b6ccg3/512x384.jpg",
        "width": "1200",
        "height": "720"
    },
    {
        "id": "44225",
        "title": "Honey Trouble",
        "description": "Honey Trouble is a free HTML5 online game taking the principle of the famous Zuma genre. In this version of classic Zuma, you have to help a bear looking for honey. Match like-colored marbles and get many ounces so he can be ready for winter!",
        "instructions": "To shoot the marbles down aim and press the left mouse button Press Spacebar to swap between the 3 marbles held by the bear ",
        "url": "https://html5.gamemonetize.com/1wroywqayrk0edo7v2jv2ex9e6ey41js/",
        "category": "Adventure",
        "tags": "1 Player, Adventure, Arcade, Ball, Game, Games, HTML, HTML5, Play, Zuma",
        "thumb": "https://img.gamemonetize.com/1wroywqayrk0edo7v2jv2ex9e6ey41js/512x384.jpg",
        "width": "840",
        "height": "600"
    },
    {
        "id": "46903",
        "title": "Super Megabot Adventure",
        "description": "Here is a robot shootem up side-scrolling adventure game. You are able to use different armed robots who are able to transform. You can learn powerful skills and buy more weapons in the store. Glad you will complete all Mission Mode levels with all difficulties. Then you can also challenge survival mode. Have a good time!",
        "instructions": "PC controls W jump A move left D move right QE change weapons Mobile controls Tap buttons on the screen",
        "url": "https://html5.gamemonetize.com/y1q7g5rntp9zsw1vaniyvzk71mzchs1h/",
        "category": "Adventure",
        "tags": "3D, Adventure, Bomb, Car, Gun, Mobile, Robot, Shoot 'Em Up, Shooting, Side Scrolling",
        "thumb": "https://img.gamemonetize.com/y1q7g5rntp9zsw1vaniyvzk71mzchs1h/512x384.jpg",
        "width": "889",
        "height": "500"
    },
    {
        "id": "42813",
        "title": "ChooChoo Charles Friends Defense",
        "description": "If youre looking for a heart-pounding, time-sucking online action game, go no farther than Choo-Choo Charles Friends Defense! Players of this engrossing game will find themselves immersed in a terrifying realm of train games. Defend the train as the courageous Choo-Choo Charles from the terrifying Rainbow Monster and its terrible henchmen. There is a lot at risk, so your reflexes and ability to strategize will be tested to the limit. Defeat wave after wave of foes by strengthening your defenses and gaining access to devastating powers.",
        "instructions": "PC controls Use the mouse to shoot Touch controls touch the screen to shoot",
        "url": "https://html5.gamemonetize.com/5bsheg26uutci2x11kw4s9enwmse2kuh/",
        "category": "Adventure",
        "tags": "Highscore, kiz10, Shooting, survival",
        "thumb": "https://img.gamemonetize.com/5bsheg26uutci2x11kw4s9enwmse2kuh/512x384.jpg",
        "width": "800",
        "height": "550"
    },
    {
        "id": "48443",
        "title": "Nooby And Obby 2 Player",
        "description": "Are you ready for the mind-boggling parkour adventure of two inept siblings? Its extremely funny and they are totally unskilled. They are referred to as the newbie brothers. One is nooby, the other is obby, and both are equally unskilled. Help them navigate through the courses. Assist them in completing the courses using their skills without touching the red blocks, and ensure they finish the course.",
        "instructions": " Noob Player Use WASD to move and Space to jump Noob Baby Player Use Arrow Keys to move and P to jump Mobile Control Available ",
        "url": "https://html5.gamemonetize.com/7o2r1nnkrca24oc9h932i15zjomny6ts/",
        "category": "Adventure",
        "tags": "2 Player, 2 Player Games, 3D, 3D Games, Adventure, Arcade, Minecraft",
        "thumb": "https://img.gamemonetize.com/7o2r1nnkrca24oc9h932i15zjomny6ts/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48426",
        "title": "Only UP Skibidi toilet",
        "description": "Going up as far as possible, as sikibidi toilet jump around to be the top",
        "instructions": "WASD - move mouse- camera space- jump",
        "url": "https://html5.gamemonetize.com/m94o7xfqoo6l3zzznk2gx2sqrnlz0cy3/",
        "category": "Adventure",
        "tags": "Action, Adventure, jump, Jumping, OnlyUp, Skibidi, Skibidi Toilet, Skill",
        "thumb": "https://img.gamemonetize.com/m94o7xfqoo6l3zzznk2gx2sqrnlz0cy3/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48369",
        "title": "Navesco V",
        "description": "O CAPITAO GLORKTAR E SEUS COMPANHEIROS ROUBARAM PROJETOS PARA A MAQUINA DE GUERRA DEFINITIVA LOCALIZE-O E RETIRE-OS ANTES QUE SEJA TARDE!",
        "instructions": "TOUCH - mobille A - LEFT W - UP S - DOWN D - RIGTH SPACE - START",
        "url": "https://html5.gamemonetize.com/po9oy8i8378ci9mrpe7b2reo628fo198/",
        "category": "Adventure",
        "tags": "1 Player, 2D, Action, Adventure, Android",
        "thumb": "https://img.gamemonetize.com/po9oy8i8378ci9mrpe7b2reo628fo198/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "48275",
        "title": "Grimace Shake Burn or Die ",
        "description": "An epic battle between you and Grimace, burn or be killed! No more Grimace Terror. Its time to put him into eternal flame of death. You have your guts, you have the will. This is too much! Grimace Must DIE! Lock and load! Revenge is MY NAME! Kill or be killed! If you like survival horror game you gonna love this! You came to investigate strange happenings at the abandoned Cave. There are rumors that Grimace is behind them. Try getting out alive! Good Luck!",
        "instructions": "WASD - move Space - grab and throw",
        "url": "https://html5.gamemonetize.com/9d6c6u0w8ot1j6qxu2c44jous4d8fnp1/",
        "category": "Adventure",
        "tags": "Battle, Best Games, Bomb, Casual, Enemy, Escape",
        "thumb": "https://img.gamemonetize.com/9d6c6u0w8ot1j6qxu2c44jous4d8fnp1/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48381",
        "title": "Magic heroes",
        "description": "Magic heroes &eacute; um jogo de rpg onde o personagem principal &eacute; um feiticeiro que luta contra diferentes tipos de inimigos. Melhore suas maestrias com ouro que voc&ecirc; recolhe nas fases e fique mais forte. Jogo na vers&atilde;o demo.",
        "instructions": "Move Arrow keys - Attack Z - Jump Space",
        "url": "https://html5.gamemonetize.com/6h08ne6j5o3samt8dc8l7r35ymewua8e/",
        "category": "Adventure",
        "tags": "Action, Adventure, Magic, RPG, Shooter",
        "thumb": "https://img.gamemonetize.com/6h08ne6j5o3samt8dc8l7r35ymewua8e/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48193",
        "title": "Shoots Skibidi Dop Dop Yes Yes",
        "description": "Shoots Skibidi Dop Dop Yes Yes Tap Down is the most addictive shooting game. With its simple yet challenging gameplay, youll be hooked from the first time you play. Tap down to shoot the enemies as they come at you from all sides. Use your powerups to take down the bosses and progress to the next level. There are endless hours of fun to be had with Shoots Skibidi Dop Dop Yes Yes Tap Down.",
        "instructions": "Desktop Use the left click buttons of the mouse to move around the enemy and shoot at the enemy by also clicking the left button of the mouse Mobile Tap and drag the screen to move characters around the enemy and shoot at the enemy by randomly clicking ",
        "url": "https://html5.gamemonetize.com/doa6191qwhmf1z1amlr2l3job9cwkkpv/",
        "category": "Adventure",
        "tags": "Action, Adventure, Best, Best Games, Games, HTML, HTML5, NapTech Games, Shoot, Shooting, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/doa6191qwhmf1z1amlr2l3job9cwkkpv/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "47974",
        "title": "Careening Though Space",
        "description": "You were on a spaceship transporting some gold when it blew up and left you careening through space. Collect airtanks so you dont run out of air and also collect coins. Avoid all other objects, especially the black holes at the bottom of the game screen.",
        "instructions": "On a mobile device tap the screen to move the astronaut so he can collect air tanks and coins Avoid the asteroids flying saucers and black holes On a desktop use the mouse to click to move the astronaut ",
        "url": "https://html5.gamemonetize.com/cqwp2dwhgim6cu4ewxtwbqnc0vminygn/",
        "category": "Adventure",
        "tags": "Action, Adventure, Air, Aircraft, Alien, Arcade, Avoid, Space",
        "thumb": "https://img.gamemonetize.com/cqwp2dwhgim6cu4ewxtwbqnc0vminygn/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "47738",
        "title": "Challenge 456: Squid Game 3D",
        "description": "Survival Squid Game Offline 3D theme is like an invasion squad for players of realistic squad players. Start as a squad global player game of redlight which is actually like a squid game and more like a puzzle survival game in which a squad saga along with the red light green light game is fun and adventure to play.",
        "instructions": "Enjoy challenge puzzle games 456 Enjoy shoot games 2022 and do an attack on game 3d players share experience of these free games for fire in Puzzle Survival games Its not a freeway game and state of decay of survival multiplayer war games overall our ",
        "url": "https://html5.gamemonetize.com/l8pr66v9kw8t4kxm15ivd78hfhsqajut/",
        "category": "Adventure",
        "tags": "1 Player, 3D, Action, Adventure, Arcade, Fight, Fighting, Gun, Shooting, WebGL",
        "thumb": "https://img.gamemonetize.com/l8pr66v9kw8t4kxm15ivd78hfhsqajut/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "46712",
        "title": "SQUID TOILET",
        "description": "SQID SKIBIDI is mixed game between each of squid game and squibidi its a really fun game where you have to drag your mouse when the green light is on to run and stand without making any move when the red light is on. For more games you can check my friend website <a href='https://www.bestcrazygames.com/'>https://www.bestcrazygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ahoa0oon9n159miyhxiif8d5dd6k7tum/",
        "category": "Adventure",
        "tags": ".io, 3D, Android, HTML5, iPhone, Mobile, Puzzle, Skibidi, Skibidi Toilet, Skill",
        "thumb": "https://img.gamemonetize.com/ahoa0oon9n159miyhxiif8d5dd6k7tum/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "47951",
        "title": "skibidi toilet terror",
        "description": "Night Skibidi Toilet Simulator plays your role for a man named CameraHead Skibidi Night Toilet Simulator takes place in an old house, you yourself have to get all the clues by visiting all the rooms one by one, observe them for coins. Night Skibidi Toilet Simulator plays your role for a man named CameraHead. You come to the underworld environment which is placed next to a scary haunted warehouse. Take them all and escape, but your quest is not easy, because the Skibidi Toilet wants to haunt you. Enjoy playing Night Skibidi Toilet Simulator horror game. Have you ever faced Skibidi Toilet, otherwise lets escape Skibidi Toilet chase",
        "instructions": "WASD - move Space - grab",
        "url": "https://html5.gamemonetize.com/deyvl0sbpyeavj02rfcgf46xs7381b2m/",
        "category": "Adventure",
        "tags": "1 Player, 3D, Dungeon, Ghost, Halloween, HTML5, Skibidi, Skibidi Toilet, WebGL, Zombie",
        "thumb": "https://img.gamemonetize.com/deyvl0sbpyeavj02rfcgf46xs7381b2m/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47646",
        "title": "Search for Treasure 2",
        "description": "You heard that recently there was a shipwreck and a bunch of gold coins were spilled out into the ocean so you decided to go scuba diving and see if you could collect some coins. Collect as many coins as you can while avoiding sharks and jellyfish. There are other fish present but they wont hurt you.",
        "instructions": "If on a mobile device tap the game screen to move the player so he can collect coins and avoid the sharks and jelly fish If playing on a desktop device left click the mouse to move the player ",
        "url": "https://html5.gamemonetize.com/f0rvyccy7y73cu9nstkj8ihnjz7h6zmq/",
        "category": "Adventure",
        "tags": "Adventure, Animal, Fish, Mobile, Shark",
        "thumb": "https://img.gamemonetize.com/f0rvyccy7y73cu9nstkj8ihnjz7h6zmq/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "47888",
        "title": "Sewage",
        "description": "Sewage is a very fun adventure game! You have to cross the tracks and guns to escape the sewers! You can collect gold and strengthen your character!",
        "instructions": "Move using the W A S D or arrow keys When you enter the game from the mobile device the touch controls will appear on the screen ",
        "url": "https://html5.gamemonetize.com/ntdsljm8ylanzgpyknccm59brmdvnk7r/",
        "category": "Adventure",
        "tags": "2D, Adventure, Arcade, Gun, Pixel",
        "thumb": "https://img.gamemonetize.com/ntdsljm8ylanzgpyknccm59brmdvnk7r/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "46096",
        "title": "ALONE II",
        "description": "Welcome to Alone 2, a gripping story-driven horror game that will test your wits and bravery. In this intense experience, your main objective is to solve intricate puzzles and escape the area as quickly as you can. Immerse yourself in the chilling atmosphere as you navigate through a series of challenges, uncovering clues and collecting essential items along the way. Your ultimate goal is to unlock the mysterious house and locate the key that will allow you to reach your friend&rsquo;s town by car. Playtime: 30 - 60 mins! Storyline. UltraHD Graphics.",
        "instructions": "ASWD Move E Intrect F FlashLight Q Quit windows ESC Pause In-Game tutorial ",
        "url": "https://html5.gamemonetize.com/2xwp4d9e9dmhhewg323ob6m67xnlduj1/",
        "category": "Adventure",
        "tags": "1 Player, 3D, Action, Adventure, Color, Ghost, House, Room, survival, Unity3D",
        "thumb": "https://img.gamemonetize.com/2xwp4d9e9dmhhewg323ob6m67xnlduj1/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "47911",
        "title": "Skibidi Toilet Vs Zombies",
        "description": "Skibidi Toilet Slaughter: Zombie Annihilation is a fun mobile game where players must protect a magical toilet from hordes of zombies using hilarious bathroom-themed weapons on R1Games.com",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/bnuzvnrxzudpgvg0ls0xdlblw1x5fhs6/",
        "category": "Adventure",
        "tags": ".io, Fun, Games, HTML5, Kill, Killing, Skibidi, Skibidi Toilet, Zombie",
        "thumb": "https://img.gamemonetize.com/bnuzvnrxzudpgvg0ls0xdlblw1x5fhs6/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47389",
        "title": "NextBoot Horror Online",
        "description": "Next Boot Horror Online takes players on a chilling journey where they find themselves trapped in a nightmarish scenario. As the games protagonist, your objective is to outsmart and outrun the relentless boots that lurk around every corner. The suspenseful gameplay keeps you on the edge of your seat, while the immersive graphics and sound effects create an atmosphere of dread and tension.Website Developer <a href='https://kiz10.com'>https://kiz10.com</a> For fans of casual games and action games, NextBoot Horror Online offers a perfect blend of both genres. Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "controls Use the arrows or the WASD keys to move shift to run Use the mouse to look around you",
        "url": "https://html5.gamemonetize.com/yr9mf562kof41vm1emecwl7ddfpth8oi/",
        "category": "Adventure",
        "tags": "Escape, kiz10, run, survival",
        "thumb": "https://img.gamemonetize.com/yr9mf562kof41vm1emecwl7ddfpth8oi/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47824",
        "title": "Escape The TEMPLE",
        "description": "Have you ever survived in temple with your friend? so join this adventure with your friend now. survive in the temple! There are puzzles in the temple. The temple is filled with poison. watch out for the poison in the temple. watch out for the dangers in the temple, you can die at any moment. Solve puzzles with your friend. Collaborate with your friend. Progress by teamwork.",
        "instructions": " Player 1 use WASD Keys to move Player 2 use Arrow Keys Keys to move Press the E and L keys to open the valve or move the box Mobile Touch Control",
        "url": "https://html5.gamemonetize.com/cghe4n12cdycngnqvmz9d6l3ythnvipw/",
        "category": "Adventure",
        "tags": "2 Player, 2 Player Games, 2D, Adventure, Android, Arcade",
        "thumb": "https://img.gamemonetize.com/cghe4n12cdycngnqvmz9d6l3ythnvipw/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47660",
        "title": "Bus Simulator Ultimate 3D",
        "description": "In this thrilling simulation game, you will take on the role of a skilled bus driver and navigate through the city streets, picking up and dropping off passengers at various stops along the way. With realistic graphics and challenging gameplay, youll feel like youre really behind the wheel of a bus as you explore the city and transport passengers to their destinations.",
        "instructions": "As you progress through the game youll encounter more challenging routes and obstacles keeping you engaged and on the edge of your seat With intuitive controls and realistic physics youll feel like youre in complete control of your bus as you navigate",
        "url": "https://html5.gamemonetize.com/40a4agdkzlq3kehzacbfsg9b2mijjrml/",
        "category": "Adventure",
        "tags": "3D Games, bus, Level, Levels, Taxi",
        "thumb": "https://img.gamemonetize.com/40a4agdkzlq3kehzacbfsg9b2mijjrml/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "47846",
        "title": "Epic Skibidi Toilet Clash part 1",
        "description": "Epic Skibidi Toilet Clash part 1 is the first story of galactic superhero to fight skibidi toilet in space. This war is so epic and no one can match this skibidi toilet epic war!",
        "instructions": "Arrow keys - move Z - punch X - kick",
        "url": "https://html5.gamemonetize.com/8wtom8jhlcwh16l3a2q1bzv20uvra2pq/",
        "category": "Adventure",
        "tags": "Brawl, Casual, Fight, Skibidi, Skibidi Toilet, Space, Spaceship, Street Fighting, Superhero",
        "thumb": "https://img.gamemonetize.com/8wtom8jhlcwh16l3a2q1bzv20uvra2pq/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "47398",
        "title": "Afroman Dinofriends",
        "description": "Join Afroman and his Dinofriends on an exciting platform adventure in this coin-collecting game! Explore mesmerizing landscapes, overcome tricky obstacles, and gather as many coins as you can. Unleash the power of your dragon companions, customize their appearance, and compete for the highest scores. Embark on an epic journey filled with fun, challenges, and treasures in Afroman Dinofriends!",
        "instructions": "D Forward A Backward W Jump K Fire You can use these controls to play this excited game ",
        "url": "https://html5.gamemonetize.com/7e7jyqx6255yd4jtyq25f7d5c1ypi8n0/",
        "category": "Adventure",
        "tags": "Action, Adventure, Arcade, dino, Dinosaur, Dragon",
        "thumb": "https://img.gamemonetize.com/7e7jyqx6255yd4jtyq25f7d5c1ypi8n0/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47631",
        "title": "Sakura School Girl Yandere Simulator",
        "description": "Sakura School Girl Yandere Simulator is a fight simulator, where you have to fight all school girl in your school. Most fun to fight with your enemies. You finally find out who is steeper in all the school fights without rules. Please enjoy high school life in Japan. Addicting and interactive battle game Apply your strategy to win the great high school battle Be ready to meet furious girl in Yandere FEATURED: -20 exciting levels -hundred of character shown in game -Cool fighting mission each level",
        "instructions": "WASD move mouse cursor aim Left mouse button shoot",
        "url": "https://html5.gamemonetize.com/e9t2cmcjznwp5rngpscfb70c5uo9dpli/",
        "category": "Adventure",
        "tags": "Brawl, Fighting, Girl, School, Simulation",
        "thumb": "https://img.gamemonetize.com/e9t2cmcjznwp5rngpscfb70c5uo9dpli/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "46193",
        "title": "Portal Adventures",
        "description": "Help the green and blue brothers steal all the emeralds from the worlds most sheltered bank.Try not to touch guard bugs and thorns and teleport between portals.Finish 4 different tiers and become the richest brothers in the world",
        "instructions": "Green Movement - WASD Keys Blue Movement - Arrow Keys",
        "url": "https://html5.gamemonetize.com/2jezlmyqlbfqik3ko8hlcjo634rz3bwq/",
        "category": "Adventure",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Arcade, Baby, Best, Boy, Boys",
        "thumb": "https://img.gamemonetize.com/2jezlmyqlbfqik3ko8hlcjo634rz3bwq/512x384.jpg",
        "width": "296",
        "height": "176"
    },
    {
        "id": "47625",
        "title": "Us Army Vehicle Transport Truck",
        "description": "US Army Vehicle Transporter Truck Simulator:Army Game is one the finest army oil tanker truck game of us army transport which has series of challenges as Vehicle transport games offer you multiple challenging army vehicle transport missions to make you us army transporter in short time period by providing you us army transport long lists of practical cargo army driving missions. Most of your army is engaged in various expeditions across all borders and it is in need of professional truck transporter who can drive army cargo truck. Take the charge of cargo truck drive on your shoulders and provide all required vehicles to your army through car",
        "instructions": "Use keyboard mouse and ready screen carefully",
        "url": "https://html5.gamemonetize.com/7mn9oztt6vibflrgzdvb6tfswa32685y/",
        "category": "Adventure",
        "tags": "Army, Games, Shoot, Shooting, transport, Truck",
        "thumb": "https://img.gamemonetize.com/7mn9oztt6vibflrgzdvb6tfswa32685y/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47570",
        "title": "School Life",
        "description": "The life of a high school student is full of interesting events and trials! You have to constantly make a choice on which your whole future life will depend. Will you be the main school ringleader or a quiet honors student? Will you skip classes and go to the disco or stay at home to study for the exam? Will you be kicked out of the house and will you turn into a bum or become a millionaire? If you are unhappy with your life, you can go back in time and change everything by making a different choice!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/0w0vg2jg8c7xejqz6hdk788b6jpvj0cv/",
        "category": "Adventure",
        "tags": "Anime, Click, Interactive Fiction, School",
        "thumb": "https://img.gamemonetize.com/0w0vg2jg8c7xejqz6hdk788b6jpvj0cv/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "47533",
        "title": "Super Spy Mario VS Skibidi Toilet",
        "description": "Super Spy Mario VS Skibidi Toilet is a combination between action and stealth game. As a Super Spy Mario you must survive from hurdles of Skibidi Toilet. Take aimlessly all Skibidi Toilet enemies from behind. Dont let them catch you! Game features: - Map design each level is unique and has its own strategies to complete - The cool feeling of stealth 2.5D action packed game - Cool environment and enemy AI",
        "instructions": "PC LAPTOP CONTROLS Key Left Move left Key Right Move right Key Up Jump move up Key Down Move down W A S D Camera Pan Z X attack MOBILE CONTROLS Use in game button on the screen",
        "url": "https://html5.gamemonetize.com/qmge8jsxyuoxtxsuwtizlhyilhp6ogfb/",
        "category": "Adventure",
        "tags": "1 Player, 3D, 3D Games, Arcade, Mario, Mobile, Skibidi Toilet, Stealth, Unity3D",
        "thumb": "https://img.gamemonetize.com/qmge8jsxyuoxtxsuwtizlhyilhp6ogfb/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47417",
        "title": "Crazy car transport truck",
        "description": "In this Advance Truck driving game your task is to move loads of freight things starting with one spot then onto the next inside city. You need to appreciate off-road Driving game while driving the truck in mountains valleys and escalate the rush of slope ascending test on troublesome rough terrain tracks in police car driver challenge game.",
        "instructions": "Use keyboard arrows to control truck and other vehicles",
        "url": "https://html5.gamemonetize.com/1rrpv2bnffkj89bpvjszjwyyyj0ft8mo/",
        "category": "Adventure",
        "tags": "3D, Army, bus, Helicopter, HTML5, monstertruck, transport, Truck, Unity3D",
        "thumb": "https://img.gamemonetize.com/1rrpv2bnffkj89bpvjszjwyyyj0ft8mo/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47421",
        "title": "Hunt Skibidi Toilet",
        "description": "Hunt Skibidi Toilet game is a horror game with a character of Skibidi Toilet, and its also an action game. The game will take you to a faraway place where the Skibidi Toilet is haunting players around the world. Its an extremely scary yet enjoyable experience Skibidi Toilet that you can only get when playing this game. You have arrived at an abandoned city. To save you need to find all the weapons and escape from this cursed place. There are legends that at night a Skibidi Toilet through the area and looks for its prey. If he sees someone, he will turn into Skibidi Toilet and start catching up very fast!",
        "instructions": "READY TO FIGHT MODE Drag mouse while hold left mouse - move cursor and shoot SHOOTING MODE WASD - Character move mouse move and click - FIRE",
        "url": "https://html5.gamemonetize.com/gg6xprmbuxfpg5iqytdiht8l4hw3uzxe/",
        "category": "Adventure",
        "tags": "3D, Battlegrounds, demolition, Skibidi Toilet, Unity3D",
        "thumb": "https://img.gamemonetize.com/gg6xprmbuxfpg5iqytdiht8l4hw3uzxe/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47366",
        "title": "Us army car transport truck",
        "description": "US Army Car Transport Truck Game is an exhilarating virtual experience that puts you in the drivers seat of a powerful military transport truck. Get ready to embark on an action-packed journey as you assume the role of an elite Army truck driver entrusted with the crucial task of transporting various military vehicles across challenging terrains. Immerse yourself in stunningly realistic graphics and immersive gameplay as you navigate through rugged landscapes, from treacherous mountainous regions to dense forests and arid deserts. Your mission is to transport a wide range of military cars, jeeps, and armored vehicles safely to their design",
        "instructions": "use keyboard up down left and right arrows to control the vehicles",
        "url": "https://html5.gamemonetize.com/qdngbsreegycovspssulw1ew91j8rkb3/",
        "category": "Adventure",
        "tags": "Army, Car, Helicopter, HTML5, Parking, Stunts, transport, WebGL",
        "thumb": "https://img.gamemonetize.com/qdngbsreegycovspssulw1ew91j8rkb3/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "8741",
        "title": "Taxi Tycoon: Urban Transport Sim",
        "description": "Taxi Tycoon: Urban Transport Simulator invites you to step into the dynamic world of urban transportation and embark on an exciting journey to become a successful taxi tycoon. In this captivating simulation game, you have the opportunity to build and manage your very own taxi empire, making strategic decisions and navigating the bustling city streets to achieve unparalleled success.",
        "instructions": "use keyboard buttons to controls vehicles and other players",
        "url": "https://html5.gamemonetize.com/5geca1ibzmqaotxo9z3c8r5g5yfi9yof/",
        "category": "Adventure",
        "tags": "Car, Driving, Parking, Sim, Simulation, Simulator, Taxi",
        "thumb": "https://img.gamemonetize.com/5geca1ibzmqaotxo9z3c8r5g5yfi9yof/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47376",
        "title": "Flip and Fight",
        "description": "In Flip and Fight, prepare for an adrenaline-pumping ragdoll adventure combining physics-based chaos and intense combat. As a nimble and flexible ragdoll warrior, youll engage in fierce battles against formidable enemies. Utilize your acrobatic skills to flip, tumble, and launch devastating attacks while dynamically manoeuvring through dynamic environments. Experiment with different fighting styles and unlock powerful abilities to unleash mayhem upon your adversaries. With a captivating blend of ragdoll physics, strategic combat, and captivating visuals, Flip and Fight offers a thrilling and unique gaming experience that will k",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/u753fd0usgkcnwflbv9rh5iuhql1vmin/",
        "category": "Adventure",
        "tags": "1 Player, Action, Adventure, Fighting, HTML5",
        "thumb": "https://img.gamemonetize.com/u753fd0usgkcnwflbv9rh5iuhql1vmin/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "47329",
        "title": "DuckWAK",
        "description": "Are you ready for the adventure of 2 duck brothers? The adventures are very challenging and extremely scary. duck brothers need to survive. Help them and get them to the finish line. Help the duck brothers with your friend. Get the star and get super power.",
        "instructions": " Use the Arrow Keys to move the Yellow Duck Use the WASD to move the Blue Duck both mobile and desktop playability ",
        "url": "https://html5.gamemonetize.com/5fxyom8tolzclgq8l22xco0ofpo0jbhj/",
        "category": "Adventure",
        "tags": "2 Player, 2 Player Games",
        "thumb": "https://img.gamemonetize.com/5fxyom8tolzclgq8l22xco0ofpo0jbhj/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "44818",
        "title": "Archery Skills",
        "description": "Welcome to this amazing Archery Skills game where you have the opportunity to show your skills in shooting accuracy. This game contains many levels where you can choose characters but you have to earn enough stars to buy them. You can also upgrade your shooter.",
        "instructions": "Use mouse or touch on the screen ",
        "url": "https://html5.gamemonetize.com/t68fhkhs7ncdb5yzqhl7mjiu4l25rfd2/",
        "category": "Adventure",
        "tags": "1 Player, Arcade, Casual, Crazy, Fun, HTML5, Mobile, Shoot, Shooter, Skills",
        "thumb": "https://img.gamemonetize.com/t68fhkhs7ncdb5yzqhl7mjiu4l25rfd2/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "46308",
        "title": "Galaxy Wars",
        "description": "In the 2D space shooter Galaxy Wars Alien Shooter, waves of alien attackers must be fought while controlling a spaceship. The games levels come in a wide variety, and each one has its own unique challenges. You must use your skills and reflexes to ensure your life and the annihilation of the aliens.",
        "instructions": " Desktop Use the left button of the mouse and drag to move anywhere Mobile Tap the screen and drag to move anywhere ",
        "url": "https://html5.gamemonetize.com/m5nd4e1hbfunowpunrbc0zjap7lngxww/",
        "category": "Adventure",
        "tags": "2D, Action, Adventure, Arcade, Gun, HTML, HTML5, Online",
        "thumb": "https://img.gamemonetize.com/m5nd4e1hbfunowpunrbc0zjap7lngxww/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "46750",
        "title": "The Lost Forest",
        "description": "The Lost Forest is a 2D game where you have to survive and find the hidden carrots to open the big door and escape,In your adventure you will face so many monsters that will try to kill you,remember you only have 3 chances before you start over again.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/m3v79ffnlrac34e3fk1do4nqt07lpr8m/",
        "category": "Adventure",
        "tags": ".io, 1 Player, 2D, Arcade, Forest, Hypercasual",
        "thumb": "https://img.gamemonetize.com/m3v79ffnlrac34e3fk1do4nqt07lpr8m/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "46960",
        "title": "Fighter 2D",
        "description": "Fighter 2D is really fun game and adventure game where you can meet other players talk with them fight monsters and open secret places and mine coins.the game has a really simple controlling but it hard to be completed are you one of the 1% of people who could of beat the game.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/5sv6ibsbxjzbdcukeejla8ke04e0htu2/",
        "category": "Adventure",
        "tags": "Arcade, Fight, jump, running",
        "thumb": "https://img.gamemonetize.com/5sv6ibsbxjzbdcukeejla8ke04e0htu2/512x384.jpg",
        "width": "800",
        "height": "600"
    }
]