[
    {
        "id": "52231",
        "title": "Box Truck Belt",
        "description": "Box Truck Belt is a fast-paced puzzle game where players take on the role of a delivery driver maneuvering a box truck through increasingly challenging obstacles. Your goal? Safely deliver parcels to their destinations within tight time constraints. Dodge traffic, navigate narrow streets, and master tight turns to earn rewards and unlock new levels. With intuitive controls and addictive gameplay, Box Truck Belt offers a thrilling experience for players of all skill levels. Website Developer <a href='https://www.coolcrazygames.com/'>https://www.coolcrazygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/isjj2ct8x0pn7yun36bxfwnnglocpi99/",
        "category": "Arcade",
        "tags": "Arcade, Fun, HTML5, iPad, iPhone, Mobile, Truck, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/isjj2ct8x0pn7yun36bxfwnnglocpi99/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51695",
        "title": "Celebrations Switch Blocks",
        "description": "Hi there, pals The year 2024 has arrived. Let&rsquo;s begin the festivities by playing the game Celebrations Switch Blocks. Like Tetris, this game is straightforward but entertaining. To remove every party item, match three or more blocks. The exciting part is right ahead: use the selector to swipe the blocks and gather as many tiles as you can. The blocks move and organize more swiftly as the timer goes on, allowing you to win the game. Play additional games exclusively on jhurr.com.",
        "instructions": "Arrows to move selector Space to switch blocks X to scroll down",
        "url": "https://html5.gamemonetize.com/oj70ah3ah5zykw30qomw7gfj5xno8usv/",
        "category": "Arcade",
        "tags": "Block, Puzzle, Tetris",
        "thumb": "https://img.gamemonetize.com/oj70ah3ah5zykw30qomw7gfj5xno8usv/512x384.jpg",
        "width": "480",
        "height": "640"
    },
    {
        "id": "52220",
        "title": "Skibidi Long Neck",
        "description": "For a long time, Skibidi scientists worked on creating new universal fighters who could attack enemies from a distance, and their efforts bore fruit. They created shooting monsters, but the Cameramen quickly changed tactics and began to use various types of cover. We had to urgently look for a way out of the current circumstances and as a result, a new species appeared, which is what you will control in the game Skibidi Toilet: Long Neck. Today you will have to help the toilet monsters destroy quite a large number of agents. Your character will be visible on the screen in front of you, which is the latest development.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/u0ppvzq1p4sb1atn4f0tk7c0rtglh919/",
        "category": "Arcade",
        "tags": "Best Games, Fun, Funny, Kids, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/u0ppvzq1p4sb1atn4f0tk7c0rtglh919/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "51931",
        "title": "Hole Fighters",
        "description": "Trunk Shot is an exciting mobile puzzle game that challenges your strategic thinking and precision. In this addictive adventure, you must aim and shoot balls into various challenging targets inside tree trunks. Navigate through beautifully designed levels filled with obstacles and tricky angles. With intuitive controls and a delightful physics-based gameplay, Trunk Shot offers hours of fun and brain-teasing entertainment. Can you master the art of trunk shooting and become the ultimate marksman? Website Developer <a href='https://www.crazygamesonline.com'>https://www.crazygamesonline.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/p1frq48puywetx1l79jcq3j9ggmn0y24/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, Fighting, Fun, HTML5, Mobile",
        "thumb": "https://img.gamemonetize.com/p1frq48puywetx1l79jcq3j9ggmn0y24/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51413",
        "title": "Slicing Goal",
        "description": "Slicing Goal is a captivating mobile game that combines precision with strategy. Dive into the world of soccer as you take on the role of a slicer. Your mission: expertly cut through obstacles and guide the soccer ball to the goal in the fewest moves possible. With 80 challenging levels and intuitive controls, Slicing Goal offers hours of addictive gameplay. Can you master the art of slicing and become the ultimate soccer slicer? Website Developer <a href='https://www.coolcrazygames.com/'>https://www.coolcrazygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/x8ib9ozqzrba6zaaeods1lhx800g9vj1/",
        "category": "Arcade",
        "tags": "Arcade, cut, free games for your website, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/x8ib9ozqzrba6zaaeods1lhx800g9vj1/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51977",
        "title": "Pac Rush Online",
        "description": "Pac Rush is a 2D platform game where u have to avoid falling obstacles and collect points. Your goal is to collect red circles. The more red circles you collect, the higher your score",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/hzaggzrjqmggrsvy1auxic2ma55lvewa/",
        "category": "Arcade",
        "tags": "1 Player, PacMan",
        "thumb": "https://img.gamemonetize.com/hzaggzrjqmggrsvy1auxic2ma55lvewa/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "52103",
        "title": "Ball Bounce",
        "description": "Ball Bounce is a casual game that is very fun and challenging. Your task is to guide the ball which continues to bounce towards the portal while passing through obstacles",
        "instructions": "use A and D to move right and left",
        "url": "https://html5.gamemonetize.com/71gzsi1s9qmuj9rehjz1zyp8yrqpw6lz/",
        "category": "Arcade",
        "tags": "1 Player, Adventure, Arcade, Ball, HTML, html games for your website",
        "thumb": "https://img.gamemonetize.com/71gzsi1s9qmuj9rehjz1zyp8yrqpw6lz/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "51971",
        "title": "Puppetman: Ragdoll Puzzle",
        "description": "Puppetman: Ragdoll Puzzle is a fun logical game with ragdoll character physics and nice graphics. Help the main character named Poly go down to the ground. To do this, you have to solve puzzles by interacting with various objects that affect the hero. Features: - Fun ragdoll character physics combined with logic puzzles. - Simple controls. - Realistic behavior of surrounding objects. The main goal is to lower the man to the ground, causing him as little damage as possible. Control is carried out by pressing buttons on the screen, or keys on the keyboard.",
        "instructions": "Control is carried out by pressing buttons on the screen or keys A B C on the keyboard ",
        "url": "https://html5.gamemonetize.com/31uozw5js14g2erjrc5tz6vzfskr3x5r/",
        "category": "Arcade",
        "tags": "3D, Android, Best, Casual, Fall Boys, free games for your site, free html5 games for your website, Fun, Game, HTML, Hypercasual, Physics, Puzzle, Simulator",
        "thumb": "https://img.gamemonetize.com/31uozw5js14g2erjrc5tz6vzfskr3x5r/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "52095",
        "title": "Monster Baby Hide or Seek",
        "description": "Monster Baby Hide or Seek is an engaging mobile game where players embark on a whimsical adventure in search of elusive baby monsters. With captivating graphics and intuitive controls, the game challenges your observation skills as you explore vibrant landscapes, solve puzzles, and outsmart mischievous monsters. Customize your character and unlock magical abilities to aid your quest. Whether youre hiding from or seeking these adorable creatures, Monster Baby Hide or Seek promises hours of delightful gameplay. Website Developer <a href='https://www.coolcrazygames.com/'>https://www.coolcrazygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/kizbmiy6kmp17qh4wusk1mr1h58jrql4/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Baby, Horror, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/kizbmiy6kmp17qh4wusk1mr1h58jrql4/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "52031",
        "title": "Friends Battle Tag Flag",
        "description": "In the second game of the Friends Battle series, two friends are racing for the flag this time. Whoever holds the flag loses. Avoid the flag for 2 minutes, and win the game. The one who grabs the flag is the loser. Catch your friend and give them the flag. Remember, you should run away from whoever holds the flag. Dont forget, time is running out, and you might lose the game. Join this adventure with your friend.",
        "instructions": "The red player moves using the WASD keys The blue player moves using the arrow keys Run away from the flag whoever has the flag loses Avoid the flag for 2 minutes ",
        "url": "https://html5.gamemonetize.com/c8cfu68yvriee884d13j8uvbdw83tstv/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Arcade, Minecraft, Pixel",
        "thumb": "https://img.gamemonetize.com/c8cfu68yvriee884d13j8uvbdw83tstv/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51775",
        "title": "Water Sort Puzzle Game",
        "description": "Water Sort is a relaxing and challenging puzzle game, where you try to sort the colored water in the glasses until all the glasses are sorted by the same color. Gameplay: One finger control; Easy and addictive gameplay; Many challenging and unique levels; You can cancel your move 5 times; Can&rsquo;t solve? Don&rsquo;t worry! Just add one more glass; You can enjoy this game at your own pace! Features: 40 levels; Cross-platform; Easy to add new levels; Sound effects added; Touch &amp; Mouse controls;",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/1nnm7eplbiczevqq8zr10i2uq7htpoc0/",
        "category": "Arcade",
        "tags": "1 Player",
        "thumb": "https://img.gamemonetize.com/1nnm7eplbiczevqq8zr10i2uq7htpoc0/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "52033",
        "title": "Friends Battle Swords Drawn",
        "description": "In the third episode of the Friends Battle series, swords have been drawn, and the war is about to begin. The battle starts; sharpen your sword, you need a sharp blade. Together with your friend, the one who captures the flag the most wins. The winner is the one who stays with the flag for 20 seconds. Dont forget, you have a sword and you also need to set up your flag. While setting up your flag, you must reach the enemys flag. Kill your friend with the sword and capture the flag.",
        "instructions": "The red player moves using the WASD keys The blue player moves using the arrow keys Stay at the flag for 20 seconds You can press S and DOWN ARROW to kill the enemy ",
        "url": "https://html5.gamemonetize.com/bwea8artj10mx8e9iexf9kjfdmmp7nx5/",
        "category": "Arcade",
        "tags": "1 Player, 2 Player, 2 Player Games, 2D, Action, Adventure, Arcade, Minecraft, Pixel",
        "thumb": "https://img.gamemonetize.com/bwea8artj10mx8e9iexf9kjfdmmp7nx5/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51883",
        "title": "2Troll Cat",
        "description": "In the world of black and white, inhabited by two troll cats, survival is crucial. Gather all the paws and advance towards the portal. To rescue the troll cats, you must successfully complete each level. Collect the paws with your friend. Guide the cats to the portal. Complete the levels and finish all the stages.",
        "instructions": " Use the Arrow Keys to move the Black Cat Use the WASD to move the White Cat both mobile and desktop playability ",
        "url": "https://html5.gamemonetize.com/9ha93gbunbu9lttjool1laieo2euyfac/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Android, Arcade, Cat, Mobile",
        "thumb": "https://img.gamemonetize.com/9ha93gbunbu9lttjool1laieo2euyfac/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51894",
        "title": "Swipe Tower Stack",
        "description": "Swipe Tower Stack is an exhilarating mobile game that challenges your reflexes and strategic thinking. In this addictive \"title\", players must build towering structures by swiping blocks onto the platform, all while ensuring stability and balance. With each successful stack, you earn points and unlock exciting power-ups. The game's intuitive controls and vibrant graphics make it suitable for players of all ages. Swipe Tower Stack promises endless entertainment and an opportunity to test your architectural skills in a fun and competitive environment. Website Developer <a href='https://www.kizi10.org/news'>https://www.kizi10.org/news</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/wtfrccar8f4axmto9ljgmfzyrjymla8n/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/wtfrccar8f4axmto9ljgmfzyrjymla8n/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51916",
        "title": "Lucky Vegas Slots",
        "description": "Looking for a dose of the true Vegas experience? Try all the different lucky slots and feel the rush of hitting a jackpot on your favorite machine!",
        "instructions": "Spin the slots and match the pictures The more matching pictures you get in a line the larger the payout you receive ",
        "url": "https://html5.gamemonetize.com/bnmf23gsgsr8mmo0wrih2ywhrgieimho/",
        "category": "Arcade",
        "tags": "Casino, Enemy, Slot Machine",
        "thumb": "https://img.gamemonetize.com/bnmf23gsgsr8mmo0wrih2ywhrgieimho/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51966",
        "title": "Friends Battle TNT",
        "description": "Are you up for an intense challenge with your friends? You should compete against your friend. Its the perfect time for a race with your friend. The one who collects flying TNTs the fastest wins. There are two teams, red and blue. The team that collects the most TNTs wins. The first to collect 20 TNTs wins. You must collect them before your friend does. Catch the TNTs flying in the air.",
        "instructions": "The red player moves using the WASD keys The blue player moves using the arrow keys Collect the TnT and bring it to the chest ",
        "url": "https://html5.gamemonetize.com/5ogv7l1fq73s9w9ihsfbwe7kln93b482/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Android, Arcade, Friv, Minecraft, Mobile",
        "thumb": "https://img.gamemonetize.com/5ogv7l1fq73s9w9ihsfbwe7kln93b482/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51909",
        "title": "Forest Adventure",
        "description": "Forest Adventure is an immersive escape game set in a magical forest. As a round ball character, you must explore the forest to find lost keys, unlock mysterious doors, and reach new areas. Navigate through obstacles, solve mysterious mechanisms, and discover the secrets within the forest. There are no scores or time limits&mdash;simply get lost in the tranquil atmosphere of nature and savor the adventure. Each level leads to an even more exciting journey. Get lost in the depths of the forest, collect the keys, and fall under the enchantment of Forest Adventure!",
        "instructions": "- Move Right D Key - Move Left A Key - Jump W Key",
        "url": "https://html5.gamemonetize.com/16u38bpqjuclapwj8s7a296b7rvn8efm/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Adventure, amazing, Arcade, Ball, Battle, Escape, Forest, Game, HTML5, jungle, Levels, Platform",
        "thumb": "https://img.gamemonetize.com/16u38bpqjuclapwj8s7a296b7rvn8efm/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51364",
        "title": "Push Enemys",
        "description": "Plumber Rotator is a thrilling puzzle game that puts your problem-solving skills to the test. In this challenging and addictive game, you step into the shoes of a skilled plumber tasked with untangling a messy web of pipes. Rotate and rearrange the pipes strategically to create a seamless flow of water, but beware of the ticking clock! With a captivating blend of strategy and quick thinking, Plumber Rotator offers hours of brain-teasing fun. Are you up for the challenge? Website Developer <a href='https://www.game-plays.com/'>https://www.game-plays.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/pvtvl9z1v4mejrs3x40abogo3snj8m2o/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, free games for your website, Fun, HTML5, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/pvtvl9z1v4mejrs3x40abogo3snj8m2o/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51923",
        "title": "Lemonade War",
        "description": "Would you like to pick lemons and win the race? Collect lemons to defeat your friend. You must help the blue and red players win the lemon race. Grab the lemons from the tree in the middle of the map and take them to the lemon stand. The person who collects the most lemons wins the race. Gather lemons and win the game. The water is slowly rising, and your only chance is to collect lemons as quickly as possible.",
        "instructions": " Press WASD keys to move the red player Press the Arrow keys to move the blue player Collect lemons from the tree and take them to the lemon stand to score points ",
        "url": "https://html5.gamemonetize.com/mye2knyk61i3shu27yol5yajcvlk1n60/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Arcade, Battle",
        "thumb": "https://img.gamemonetize.com/mye2knyk61i3shu27yol5yajcvlk1n60/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50735",
        "title": "flying bird challenges 2.0",
        "description": "Its a game where you control a bird that has to dodge the pipes and catch the Ball of Multiplication that falls from the sky and if you catch it, it multiplies the points you earn. If you get 500 points, you disable the ads.",
        "instructions": "mouse click the bird jumps",
        "url": "https://html5.gamemonetize.com/iv7cemlv4cytfhml41m5b6leyapk6bop/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Action, Bird",
        "thumb": "https://img.gamemonetize.com/iv7cemlv4cytfhml41m5b6leyapk6bop/512x384.jpg",
        "width": "400",
        "height": "500"
    },
    {
        "id": "50731",
        "title": "Object Untangler",
        "description": "Object Untangler challenges your spatial skills! Dive into a puzzling world where tangled objects await your untangling mastery. Rotate, maneuver, and strategize to unravel intricate clusters, all while racing against the clock. Each level presents increasingly complex entanglements, limiting your problem-solving abilities. With minimalist design and mind-bending challenges, test your patience and precision as you meticulously untangle objects. Website Developer <a href='https://www.crazygamesonline.com/popular'>https://www.crazygamesonline.com/popular</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ukerc1d88meqsq50mpwfosnsqe8l1ahx/",
        "category": "Arcade",
        "tags": "1 Player, Fruits, Puzzle, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/ukerc1d88meqsq50mpwfosnsqe8l1ahx/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49617",
        "title": "Stay Alive",
        "description": "Are you ready to survive? You have an axe in your hand, start cutting down all the trees. First, cut down the trees and build a tent. After the tent, you should build walls around it so that cannibals dont attack and eat you. Either run away from the cannibals or fight them to make them flee. Collect rocks, bushes, and wood. You need to make a fire. If your health is low, eat mushrooms, or you might die. Finally, as the last task, build a raft and complete the game.",
        "instructions": "To move the player press the Arrow keys Use the Space key to hit the cannibals or cut down trees Press E to pick up rocks from the ground Collect mushrooms to replenish your health ",
        "url": "https://html5.gamemonetize.com/28p9rjmeigg51j6uafgx87boxjn8hayv/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, survival",
        "thumb": "https://img.gamemonetize.com/28p9rjmeigg51j6uafgx87boxjn8hayv/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51473",
        "title": "Rope Puzzle Rescue",
        "description": "Introducing Rope Puzzle Rescue &ndash; a thrilling adventure game that puts your problem-solving skills to the test! Dive into a world where quick thinking and strategic planning are your best allies. Navigate through intricate levels by strategically manipulating ropes, creating bridges, and rescuing trapped characters. With 80 challenging levels to conquer, each more intricate than the last, Rope Puzzle Rescue will keep you engaged for hours. Can you master the art of rope puzzles and save the day? Website Developer <a href='https://www.brightestgames.com/'>https://www.brightestgames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/yytyd53l5pbhbai6ebi40qpagdpsbja9/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Fun, Skills, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/yytyd53l5pbhbai6ebi40qpagdpsbja9/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51767",
        "title": "Noob vs Bacon Jumping",
        "description": "Hello! An exciting adventure awaits you where you need to escape sharp spikes rising from the ground. The spikes are coming from below, and you must constantly climb higher without stopping. Reach the highest point either alone or with your friend. Be careful of the spikes coming from below. Collect all the coins on the way and buy yourself different costumes.",
        "instructions": "Use the WASD keys to move and jump in the game Use the Arrow Keys keys to move and jump in the game Mobile Control Available ",
        "url": "https://html5.gamemonetize.com/8yyf1rq9u3142pwaey7ba63y569kg66q/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Arcade, Interactive, Mobile, Pixel",
        "thumb": "https://img.gamemonetize.com/8yyf1rq9u3142pwaey7ba63y569kg66q/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51674",
        "title": "Kitty Cat",
        "description": "Kitty Cat is an exciting platformer where you join a small and brave kitty on its thrilling journey in search of delicious food. The game features 12 different levels, each filled with obstacles and challenges awaiting your hero. The main character is an enchanting kitty with fluffy fur and sparkling eyes. It&rsquo;s very hungry, and your goal is to help it overcome all the difficulties and obstacles so that it can reach its long-awaited food. Each level offers its own unique tasks and trials, from challenging puzzles to fun speeding platforms and exhilarating jumps. The game&rsquo;s soundtrack provides an unforgettable atmosphere, and the excellent g",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/wt1lzxen6zdei51m74ml996dbwx697jc/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Animal, Arcade, Cat, free html5 games for your website, HTML, HTML5, html5 games, html5 games for your site, Platform",
        "thumb": "https://img.gamemonetize.com/wt1lzxen6zdei51m74ml996dbwx697jc/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "49555",
        "title": "Letter Layout Coloring",
        "description": "Immerse yourself in the captivating world of Letter Layout Coloring! This puzzle game challenges your creativity and cognitive skills as you arrange colorful letters to form words. With a dynamic layout that evolves with each level, youll embark on a journey of linguistic discovery. Solve puzzles, unlock achievements, and unveil the vibrant spectrum of language. Letter Layout Coloring is a thrilling fusion of linguistic artistry and strategic thinking, making it the perfect game for word enthusiasts seeking a delightful challenge. Website Developer <a href='https://www.coolcrazygames.com/popular'>https://www.coolcrazygames.com/popular</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/6e19nblmuagla3dbso7k0uko43jlmqxu/",
        "category": "Arcade",
        "tags": "Arcade, Clicker, Drawing, Kids, Mobile, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/6e19nblmuagla3dbso7k0uko43jlmqxu/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51757",
        "title": "Tower of Fall",
        "description": "Tower of Fall is an exhilarating game where your objective is to jump down a complex tower, collecting coins to purchase various skins and weapon upgrades while battling mobs to reach the final level. The game is available on both PC and smartphones, optimized for various screen types, ensuring smooth and engaging gameplay across different devices.",
        "instructions": "Mouse click or tap to play swipe keybourd",
        "url": "https://html5.gamemonetize.com/wbaj9gdw9h5xvaran6bigs80zk44jgm7/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Android, Arcade, Block, blocky, Casual, Fight, Fighting, free html5 games for your website, HTML5, Knight, Tower Defense, Zombie",
        "thumb": "https://img.gamemonetize.com/wbaj9gdw9h5xvaran6bigs80zk44jgm7/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "51752",
        "title": "Night Ninja",
        "description": "Night Ninja is an exhilarating HTML5 game where players embody a stealthy ninja navigating through challenges under the cover of darkness. This immersive gaming experience is meticulously crafted within an HTML5 structure, ensuring seamless compatibility across diverse web platforms and devices.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/jlaj14nva4znkse9k84oetofoaowwt4u/",
        "category": "Arcade",
        "tags": "1 Player, 2D, amazing, arrow, Best Games, Fight, Fighting, free html5 games for your website, HTML, html games for your website, html5 games, Knight, Ninja, Platform",
        "thumb": "https://img.gamemonetize.com/jlaj14nva4znkse9k84oetofoaowwt4u/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "49158",
        "title": "Car.io",
        "description": "Car.io is a delightful arcade gaming experience, reminiscent of Papper.io 2. It promises endless enjoyment for players of all ages and backgrounds. The primary objective of the game is to engage in thrilling battles for survival and territorial dominance in the world of Car.io. Strategically maneuver your vehicle to expand your domain and ensure that your adversaries never get the chance to strike at your tail. Website Developer <a href='https://www.bestcrazygames.com/featured'>https://www.bestcrazygames.com/featured</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/cxexhz14qk8qi9qi6ax1k6cbc3fwwvqm/",
        "category": "Arcade",
        "tags": ".io Games, 2D, Android, Car, Click, HTML5, iPad, iPhone, Kids, Mentolatux, Mobile",
        "thumb": "https://img.gamemonetize.com/cxexhz14qk8qi9qi6ax1k6cbc3fwwvqm/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51792",
        "title": "Funny Snake",
        "description": "Funny Snake is an exciting game where the player controls a fun and stretched hero &ndash; a snake that moves through different levels to collect delicious fruits. However, in its continuous hunt for goodies, the snake must avoid the thorns that are in the way.",
        "instructions": "Use your mouse or tap on the screen or use the left and right arrow keys on your keyboard ",
        "url": "https://html5.gamemonetize.com/ag3vp900adbofmc5pz4kjin6q9thha9g/",
        "category": "Arcade",
        "tags": "Avoid, Best, Collecting, Fun, Kids, Mobile, Obstacle, Skill, Snake",
        "thumb": "https://img.gamemonetize.com/ag3vp900adbofmc5pz4kjin6q9thha9g/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "51732",
        "title": "NoobLox vs Garten 2 Player",
        "description": "You must help Noob and Bacon in their adventure. Garden monsters are everywhere, and you must eliminate all the monsters. Get rid of the monsters and collect all the coins. You must do your best to win. Together with your friend, overcome all obstacles. Work together with your friend to eliminate all the monsters. Be careful, there is poisonous water that can kill you.",
        "instructions": " Played with WASD Arrow Keys Mobile touch control is available double jump available jump on it to kill ",
        "url": "https://html5.gamemonetize.com/1f1w621nnu5whnxgqi94nl3a9coqvmga/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Animal, Arcade, Pixel",
        "thumb": "https://img.gamemonetize.com/1f1w621nnu5whnxgqi94nl3a9coqvmga/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51780",
        "title": "Tebo",
        "description": "Tebo is a physics-based platform game with 50 challenging and brain-boosting levels. You have to help Tebo (little alien) reach the portal to complete the level",
        "instructions": "WASD Arrow movement player SPACE Jump",
        "url": "https://html5.gamemonetize.com/8roxszm9384i0vmnqt9nnoyjq7ttdvu9/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Best Games, HTML5, Platform, Puzzle",
        "thumb": "https://img.gamemonetize.com/8roxszm9384i0vmnqt9nnoyjq7ttdvu9/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "51698",
        "title": "Fire and Water Ball",
        "description": "Are you willing to help Fire and Water, the adventurous siblings, in the temple? Help them to escape from the temple. Both siblings need to work together to get out of the temple. Collect keys and coins in the temple. To activate the portals, all keys and coins need to be collected. Both siblings need to reach the portal.",
        "instructions": " Move to WASD Arrow Keys Double Jump available Mobile Touch Control Fire ball collects the red key Water ball collects the blue key ",
        "url": "https://html5.gamemonetize.com/lhwg5m7927qiwosc2meq4nwm42zudyiq/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure",
        "thumb": "https://img.gamemonetize.com/lhwg5m7927qiwosc2meq4nwm42zudyiq/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49273",
        "title": "Color Paint Filler",
        "description": "Color Paint Filler is an engaging mobile puzzle game that will test your strategic thinking and creativity. Dive into a vibrant world of colors as you aim to fill the entire canvas with the right hues. Swipe your way through challenging levels, blending colors and avoiding obstacles. With intuitive controls and mesmerizing visuals, Color Paint Filler offers hours of addictive gameplay. Can you conquer the canvas and become a master of color blending? Download now and unleash your inner artist in this thrilling paint-filling adventure! Website Developer <a href='https://www.brightestgames.com/'>https://www.brightestgames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/n879wv3nfz3e68f0gef85de14wd8wrck/",
        "category": "Arcade",
        "tags": "Arcade, HTML5, Jumping, Ninja, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/n879wv3nfz3e68f0gef85de14wd8wrck/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "51575",
        "title": "Popcorn Times",
        "description": "Popcorn time is a game that is very suitable for those of you who like relaxing games. Popcorn game that you can play anywhere and anytime. With a popcorn popper, you can pop the popcorn until its completely filled. You may be wondering, is the popcorn pop game even fun? So why dont you try playing it now? To play this popcorn game you also have to pay attention to popcorn trivia, because you will be required to fill the bucket until it is full and the popcorn must not spill or get out of the bucket. So you have to be careful when filling the bucket with the popcorn maker. Feature : - 80 Levels - Interesting animation - Design and effect",
        "instructions": "- Touch and hold on the screen to make popcorn - Fill the container with popcorn until it is full - Wait for the timer to run to ensure you have successfully filled the container with popcorn",
        "url": "https://html5.gamemonetize.com/imd6ioo4211prdcru6qyd4vkdqyb1l68/",
        "category": "Arcade",
        "tags": "1 Player, Best Games, Brain, Physics, Puzzle",
        "thumb": "https://img.gamemonetize.com/imd6ioo4211prdcru6qyd4vkdqyb1l68/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "50378",
        "title": "Saw Destroyer",
        "description": "Introducing Saw Destroyer - an adrenaline-pumping Unity script-powered game! In this thrilling adventure, youll navigate through a maze of deadly saws, armed with only your wit and reflexes. Your mission? Survive the treacherous obstacles, collect power-ups, and reach the ultimate goal. With Unity scripting expertise, weve crafted a heart-pounding gaming experience thatll keep you on the edge of your seat. Are you up for the challenge? Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/uw9jjps62btn6gxlouq37lefg24qode9/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, HTML5, Mobile, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/uw9jjps62btn6gxlouq37lefg24qode9/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "49763",
        "title": "Ghost Fall",
        "description": "Immerse yourself in the world of endless falling in the game Ghost Fall! Avoid the spikes and enjoy an exciting experience. Welcome to the world of Ghost Fall, an exciting endless fall style game where an exciting adventure with Ghost awaits you!",
        "instructions": "Tap the left side of the screen to move to the left Tap the right side of the screen to move to the right Desktop Use the arrow keys to control the character ",
        "url": "https://html5.gamemonetize.com/cc78ivh06uzdcwv8nv9rpzp4sisd5y0x/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Arcade, Ghost, Halloween",
        "thumb": "https://img.gamemonetize.com/cc78ivh06uzdcwv8nv9rpzp4sisd5y0x/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "48899",
        "title": "Flying Man 3D",
        "description": "Flying Man 3D, an engaging aim-and-shoot game, boasts impressive physics. Assume the role of a futuristic neon hero in Flying Man 3D, armed with extraordinary superpowers on a mission to confront AI invaders. As they challenge your neon-powered might, you aim to thwart a futuristic robot war in this epic 2023 robot combat game. Website Developer <a href='https://www.crazygamesonline.com/'>https://www.crazygamesonline.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/qchzunu9675dhomt1j4azaw2a5gc9803/",
        "category": "Arcade",
        "tags": "3D Games, Android, fly, HTML5, iPad, iPhone, Mentolatux, Mobile, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/qchzunu9675dhomt1j4azaw2a5gc9803/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50247",
        "title": "Paint Circle Shooter",
        "description": "Introducing Paint Circle Shooter, a thrilling mobile arcade game that will test your reflexes and precision. In this fast-paced adventure, you control a paint cannon tasked with eliminating colorful circles that fill the screen. The catch? You must match the color of your shots with the targets, creating satisfying splashes of vibrant paint as you go. With a variety of challenging levels and mesmerizing visuals, Paint Circle Shooter offers an addictive experience for players seeking excitement and accuracy. Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Click to shoot paint balls to paint the circles ",
        "url": "https://html5.gamemonetize.com/j17bnmnw1avhfaa2gtnnwghzpsph2tt9/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, Bubble Shooter, HTML5, Mobile, Shooting, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/j17bnmnw1avhfaa2gtnnwghzpsph2tt9/512x384.jpg",
        "width": "350",
        "height": "600"
    },
    {
        "id": "51656",
        "title": "Super Pineapple Pen",
        "description": "In Super Pineapple Pen, lets see if you are a good marksman. We need nothing but a pen collection to play this game. Keep your pens ready and get ready to practice your aim. Do you think you will be able to get fruitful results?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/8mqosmujvqzj2ijj1f4bt1ggm8xs4obe/",
        "category": "Arcade",
        "tags": "1 Player, Collecting, Fruits, Skills",
        "thumb": "https://img.gamemonetize.com/8mqosmujvqzj2ijj1f4bt1ggm8xs4obe/512x384.jpg",
        "width": "640",
        "height": "960"
    },
    {
        "id": "48937",
        "title": "Stairway Sprint",
        "description": "Stairway Sprint is an exhilarating mobile game that puts players in control of a bouncy ball on a mission to ascend a series of challenging staircases. As you guide the ball upwards, youll need to deftly navigate a maze of obstacles while collecting valuable items along the way. With intuitive tilt controls and engaging gameplay, Stairway Sprint offers an addictive experience that tests your reflexes and precision. Can you conquer the stairs, avoid pitfalls, and become the ultimate sprinter in this thrilling journey to the top? Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/tcogq9z1zqb7yqcs31ufl1bvmvouurvi/",
        "category": "Arcade",
        "tags": "Arcade, Ball, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/tcogq9z1zqb7yqcs31ufl1bvmvouurvi/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "43926",
        "title": "Monster and Candy",
        "description": "Today, in the game Monster and Candy we will move you in the interesting world populated by various monsters. Among them, there is no aggressive creatures, they are all good and lovely. We have before us on the screen will be a closed room whose walls are covered with spines. Our hero will appear in it in different places. Around him, the candy will fly at different speeds and on different trajectories. You need to calculate your actions so that would be when jumping our hero went through all the traps and hit the candy. Then he will be able to catch and eat. If you make a mistake in their calculations, it does not get into the candy and fly away to the wall and come across the pins. Adjoined our hero instantly perish with them. So be extremely careful and accurate. Game Monster and Candy is pretty fun and funny plot.",
        "instructions": "Use mouse or touch on the screen ",
        "url": "https://html5.gamemonetize.com/k0qvtini21ecqlbk06ulj5apds1p7cxx/",
        "category": "Arcade",
        "tags": "1 Player, Best, Candy, Fun, Funny, Kids, Mobile, Monster, Skill",
        "thumb": "https://img.gamemonetize.com/k0qvtini21ecqlbk06ulj5apds1p7cxx/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "51571",
        "title": "Fat Shark",
        "description": "Fat Shark is a HTML5 Survival Game. This shark is starving! Feed him with some fishes, but be careful! The more he eats, the more he&rsquo;ll get fat and won&rsquo;t avoid bombs anymore!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/3j86ayflg9v296emwpg5kjq602vy0kjv/",
        "category": "Arcade",
        "tags": "1 Player, Animal, Fish, Shark",
        "thumb": "https://img.gamemonetize.com/3j86ayflg9v296emwpg5kjq602vy0kjv/512x384.jpg",
        "width": "640",
        "height": "960"
    },
    {
        "id": "51574",
        "title": "Catch the water",
        "description": "The objective is to complete each level by guiding the water flow to the truck, ensuring it reaches the minimum level marked. Players face various obstacles strategically placed throughout the game grid, such as barriers, rocks, and twists, adding complexity to the path-drawing challenge.",
        "instructions": "use mouse",
        "url": "https://html5.gamemonetize.com/pn9gp3uakzbkwsf29hevc924m2az6fjk/",
        "category": "Arcade",
        "tags": "1 Player, Draw, Levels, Logic, Strategy",
        "thumb": "https://img.gamemonetize.com/pn9gp3uakzbkwsf29hevc924m2az6fjk/512x384.jpg",
        "width": "480",
        "height": "854"
    },
    {
        "id": "51414",
        "title": "MultiplArrow",
        "description": "MultiplArrow is a dynamic and addictive mobile game that will test your math and aiming skills. Take control of an arrow armed with numbers and symbols and embark on a journey through mathematical challenges. Aim, shoot, and solve equations by combining arrows to hit the target number. With 80 progressively challenging levels, MultiplArrow offers both fun and educational gameplay. Sharpen your mathematical prowess while enjoying hours of exciting arrow-shooting action. Arrow now and become the ultimate math marksman! Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/wrar0puua6xcnstzp0t70p9mmpq9smai/",
        "category": "Arcade",
        "tags": "Adventure, Android, Arcade, arrow, arrows, HTML5, iPad, iPhone, Mobile, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/wrar0puua6xcnstzp0t70p9mmpq9smai/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51551",
        "title": "PixBros   2 Player",
        "description": "Are you up for an adventure in the pixel world? Our quest involves dangerous monsters and diamonds to collect. You must survive in the cave throughout the adventure. Defeat the monsters and reach the portal. Collect all the diamonds and the key. You should reach the portal with your friend. Work together as a team with your friend to complete all the levels.",
        "instructions": " Played with WASD Arrow Keys Mobile touch control is available Double jump available",
        "url": "https://html5.gamemonetize.com/hog9wylmzmx3dky1fl77mz28tskbp2xe/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, Adventure, Android, Arcade, Best, Best Games, Minecraft, Mobile, Pixel",
        "thumb": "https://img.gamemonetize.com/hog9wylmzmx3dky1fl77mz28tskbp2xe/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "43925",
        "title": "Boat Action",
        "description": "Today in the game Boat Action we will go with you to the mountains. There is a world-famous race on inflatable boats and you will take part in it directly. On the screen you will see a river and your boat is located on it. Your task is gaining speed to swim across the water surface as far as possible. On your way there will be golden coins. You need to try to collect them as much as possible. For this you will be credited with gaming points. Also collect other items that can give you bonuses. On the track there will also be found stones and various traps, which you certainly need to avoid. If you get into them, your boat will explode and you lose the round.",
        "instructions": "Use mouse or touch on the screen ",
        "url": "https://html5.gamemonetize.com/dy4tkkdj57o8bwv6n691k6ezy2qebjda/",
        "category": "Arcade",
        "tags": "1 Player, Adventure, Best, Boat, Boys, Mobile, Shoot, Shooting",
        "thumb": "https://img.gamemonetize.com/dy4tkkdj57o8bwv6n691k6ezy2qebjda/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "48894",
        "title": "Arena Battle Factory",
        "description": "Experience the satisfaction of conquering numerous levels of cleanliness while battling and defeating hordes of enemies. Dive into a world of challenges and triumphs as you overcome countless adversaries. Website Developer <a href='https://tr.bestcrazygames.com/'>https://tr.bestcrazygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/3k8fjgfhtka1zvirudlslaj5g7e7ny2o/",
        "category": "Arcade",
        "tags": "Android, HTML5, Mentolatux, Mobile, Shoot, Shooter, Top Down, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/3k8fjgfhtka1zvirudlslaj5g7e7ny2o/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51357",
        "title": "Piggy Bank Demolish Run",
        "description": "Piggy Bank Demolish Run is a fun and classic 3D pixel-running arcade game. You have to grab special game coins to pass the toy walls. You will fail the game if you hit any red obstacles or traps. You can unlock and use 21 skins in the shop if you collect many gold coins while running. Different toy walls need different game coins, pick the least ones to pass them.",
        "instructions": "Touch and drag move",
        "url": "https://html5.gamemonetize.com/s1a41fzf4k0yuhfqfrob5ta9sqgoq1vr/",
        "category": "Arcade",
        "tags": "Avoid, Boys, Car, Collecting, Girls, Kids, Pixel",
        "thumb": "https://img.gamemonetize.com/s1a41fzf4k0yuhfqfrob5ta9sqgoq1vr/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "39897",
        "title": "King of Majesty",
        "description": "King of Majesty is a fun game to play where the king is collecting the crown to protect his kingdom from the enemies. After some moments there is a new enemy. To deal with the enemies, try to run away and do not let them catch you or the game will be over. The game has a very simple concept but a lot of fun.",
        "instructions": "Control Desktop Click the left buttons of the mouse to make the character jump Mobile Tap on the mobile screen to make the character jump ",
        "url": "https://html5.gamemonetize.com/6jjx4ei2yf92l8l7zoq0dbm1w7numzuf/",
        "category": "Arcade",
        "tags": "Action, Adventure, Best, HTML, HTML5, jump, Jumping, King, Platform",
        "thumb": "https://img.gamemonetize.com/6jjx4ei2yf92l8l7zoq0dbm1w7numzuf/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "51249",
        "title": "Stickman Color Saw ",
        "description": "Ever wanted to do a cut but like to keep your fingers intact? With Stickman Color Saw, you can do both! Shape your rough blocks into various shapes with all kinds of tools. Cut and smash through countless levels.",
        "instructions": "Use W A S D or Arrow Keys to move the players ",
        "url": "https://html5.gamemonetize.com/vg9plxk4f6yqtofdrqg7j2m9ixjxv1k5/",
        "category": "Arcade",
        "tags": "Arcade, Casual, cut, Fun, Stickman",
        "thumb": "https://img.gamemonetize.com/vg9plxk4f6yqtofdrqg7j2m9ixjxv1k5/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51476",
        "title": "Bricks Breakers Infinity",
        "description": "Relax your brain and play the best brick breaker game of the year. control the paddle and dont let the ball fall, break all the blocks to achieve a higher score",
        "instructions": "shift the paddle",
        "url": "https://html5.gamemonetize.com/mrw2d8le69jdofc3ngcskkp4x6zobmr4/",
        "category": "Arcade",
        "tags": "Ball, Bounce, Bricks, Pinball",
        "thumb": "https://img.gamemonetize.com/mrw2d8le69jdofc3ngcskkp4x6zobmr4/512x384.jpg",
        "width": "1280",
        "height": "1280"
    },
    {
        "id": "51492",
        "title": "StickBoys Xmas",
        "description": "Are you ready for the Christmas fun of the red and blue stick boys? Help them during Christmas and get them to the door. A more challenging day awaits you in the Christmas adventure. You must survive with your friend. Collect the keys and own all the candies. Watch out for obstacles. Reach the door together with your friend in Christmas.",
        "instructions": " Move to WASD Arrow Keys Double Jump available Mobile Touch Control",
        "url": "https://html5.gamemonetize.com/8gycch81gemuh0alb751ikqy1kzjyfxt/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, Adventure, Arcade, Stickman",
        "thumb": "https://img.gamemonetize.com/8gycch81gemuh0alb751ikqy1kzjyfxt/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51496",
        "title": "Blocky Paint",
        "description": "Blocky Paint is a captivating Unity-based game script that combines the thrill of creativity with strategic challenges. In this unique game, players use colorful blocks to create stunning artworks while navigating exciting puzzles. Showcase your artistic prowess as you solve intricate puzzles, earning rewards and unlocking new levels. With intuitive controls and a visually stimulating environment, Blocky Paint offers an immersive gaming experience that will keep you hooked for hours. Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/m25zyfkkisx3pknrjr2wyq0rsrofd3n8/",
        "category": "Arcade",
        "tags": "Arcade, HTML5, Mobile, unity games for your website, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/m25zyfkkisx3pknrjr2wyq0rsrofd3n8/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51461",
        "title": "Watermelon Fruit 2048",
        "description": "The game is a very simple but addictive game where you have to touch 2 identical objects together to make them explode and go to the next level. Click or drag and drop fruits anywhere on the screen to drop them on top of the fruit of the same type and earn points. 2 fruits of the same type merge and turn into a bigger fruit in the position where they collide, so you can blast the watermelon, the biggest fruit, and earn 1000 points",
        "instructions": "use mouse to drop fruits",
        "url": "https://html5.gamemonetize.com/w9i7tt3bfiwiz1jx3vzjunbunm1q1luu/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, Fruits, Relaxation",
        "thumb": "https://img.gamemonetize.com/w9i7tt3bfiwiz1jx3vzjunbunm1q1luu/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "51363",
        "title": "Animal Traffic Run",
        "description": "Get ready for a wild adventure in Animal Traffic Run! In this fast-paced mobile game, youll navigate a bustling city filled with quirky animal characters. Your mission? Help these animals safely cross the busy streets and highways, avoiding traffic jams and collecting rewards. With intuitive controls and various challenges, Animal Traffic Run offers endless fun for players of all ages. Can you guide these adorable creatures to their destinations and become the ultimate traffic master? Play now and find out!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ecfxn61ensrc6b0qfj4yygn83hnf1ngu/",
        "category": "Arcade",
        "tags": "Adventure, Animal, Arcade, Strategy, Traffic",
        "thumb": "https://img.gamemonetize.com/ecfxn61ensrc6b0qfj4yygn83hnf1ngu/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46165",
        "title": "Some little enemies",
        "description": "Get ready to embark on an exciting adventure as you engage in a fierce battle against a horde of relentless little enemies in this action-packed arcade game! Your objective is to defeat as many of these adversaries as possible while striving to achieve the highest score imaginable.",
        "instructions": "drag",
        "url": "https://html5.gamemonetize.com/96p2lq9nchwxmb20tepgz60ubhzw5jq3/",
        "category": "Arcade",
        "tags": "1 Player, Action, Android, HTML5, Mobile",
        "thumb": "https://img.gamemonetize.com/96p2lq9nchwxmb20tepgz60ubhzw5jq3/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "40018",
        "title": "Boat rush",
        "description": "Boat rush is a boat running game in which you have to go as far as possible by boat avoiding all the obstacles on the route. You also have a few weapons at hand that you can fire to clear your way. You have more levels to complete.",
        "instructions": "mouse and keybord touch on phone",
        "url": "https://html5.gamemonetize.com/a13gqdcfhlw1bd9cohkq2lujp56ltx6u/",
        "category": "Arcade",
        "tags": "Boat, Boys, Collecting, Fun, Funny, HTML5, Skills",
        "thumb": "https://img.gamemonetize.com/a13gqdcfhlw1bd9cohkq2lujp56ltx6u/512x384.jpg",
        "width": "480",
        "height": "800"
    },
    {
        "id": "51411",
        "title": "Push Timing",
        "description": "Push Timing is an exciting puzzle game that challenges your reflexes and strategic thinking. In this adrenaline-pumping adventure, you must time your pushes perfectly to navigate through intricate mazes and obstacles. With 80 thrilling levels and increasingly complex puzzles, Push Timing will put your skills to the test. Can you master the art of precision timing and conquer every level? Get ready for a mind-bending journey filled with excitement and fun. Download Push Timing now and experience the ultimate test of your timing skills! Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/d690qfuoapv1ir8ua5n7dw5fijf1f4qq/",
        "category": "Arcade",
        "tags": "Arcade, Fighting, free games for your website, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/d690qfuoapv1ir8ua5n7dw5fijf1f4qq/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51410",
        "title": "Titan   the way to the bottom",
        "description": "The world ocean of our planet has been studied by a little more than 4%, so each expedition becomes an opportunity to learn something new about us, about our planet. We invite you to become participants in an exciting dive not just to the bottom, but to the bottom of the famous ship Titanic. But this path is not easy: in order to save the team and your boat, you will have to pump it so well in order to reach the goal - BOTTOM. Distribute the earned resources correctly to survive and return the team.",
        "instructions": "Your goal is to go as deep as possible and survive while avoiding the obstacles that are sure to appear on your way to reach the first place in the leaderboard In the Angara you have the opportunity to improve your bathyscaphe 1 Hull Allows for greate",
        "url": "https://html5.gamemonetize.com/yp96fbf19h97e5ycp7xd500ldtt3n4kw/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Action, Android, Arcade, Best Games, Casual, iPhone, Simulator, Submachine, unity, unity games, Unity3D",
        "thumb": "https://img.gamemonetize.com/yp96fbf19h97e5ycp7xd500ldtt3n4kw/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51374",
        "title": "Duo Ball Adventure",
        "description": "In Duo Ball Adventure, you get to help a pair of inseparable balls through a series of challenging levels. These twin spheres are linked and move as one unit, making it a unique test of your gaming skills. The aim is to guide them safely towards their destination while overcoming all the barriers that stand in their way.",
        "instructions": "The crucial part of playing Duo Ball Adventure is controlling the movement of the twin balls Use arrow keys or touch pad to control and navigate these balls ensuring they dodge the obstacles and reach the end point The game progresses as you successful",
        "url": "https://html5.gamemonetize.com/yrmn7j2sfz45ecudelhvj37w3yppb0za/",
        "category": "Arcade",
        "tags": "Ball",
        "thumb": "https://img.gamemonetize.com/yrmn7j2sfz45ecudelhvj37w3yppb0za/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "51308",
        "title": "Christmas Climb",
        "description": "Christmas Climb is a fun Santa Game, where Santa needs to collect a gift before delivering it. Are you ready for the action-packed adventure?",
        "instructions": "Use W A S D or Arrow Keys Can use Left Mouse Button To Control Santa ",
        "url": "https://html5.gamemonetize.com/t4yenlza1em6bv8bt02owlzdelw1mhdk/",
        "category": "Arcade",
        "tags": "Christmas, Fun, Santa, Santa Claus",
        "thumb": "https://img.gamemonetize.com/t4yenlza1em6bv8bt02owlzdelw1mhdk/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50333",
        "title": "Santas Cup 3D",
        "description": "Santas Cup 3D is an exhilarating mobile game that combines the thrill of racing with festive holiday cheer. In this adrenaline-pumping adventure, players take on the role of Santa Claus as he navigates his sleigh through challenging 3D courses filled with twists, turns, and magical obstacles. With stunning graphics and immersive gameplay, this game offers a unique blend of Christmas magic and high-speed action. Race against the clock, collect presents, and spread joy this holiday season in Santas Cup 3D. Get ready for a jolly good time on your mobile device!",
        "instructions": "Click to move the pads then click ready after clicking prepared click the Santa character to release the balls into the cup NOTE If the game doesnt end its because you havent gotten enough balls in the cup",
        "url": "https://html5.gamemonetize.com/xvulfbn9zdcuu9ve3suiii0wu6b8369m/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, Christmas, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/xvulfbn9zdcuu9ve3suiii0wu6b8369m/512x384.jpg",
        "width": "350",
        "height": "600"
    },
    {
        "id": "51136",
        "title": "Santas Gifts",
        "description": "Santas Gift is a delightful and festive childrens game that brings the magic of Christmas to life. In this enchanting adventure, young players take on the role of Santa Claus, spreading joy by collecting falling gifts while dodging snowballs. With each level, the game becomes more exciting, challenging their reflexes and agility. As children progress through higher levels, theyll experience increased speed and encounter more obstacles, making the gameplay progressively engaging.",
        "instructions": "You need to use the arrows on the keyboard if youre playing on desktop or the in-game arrows if its on a tablet or phone ",
        "url": "https://html5.gamemonetize.com/23mq2nwo4fqv5wm9x8c3gncptz8odtud/",
        "category": "Arcade",
        "tags": "Android, Christmas, Collecting, HTML5, iPad, iPhone",
        "thumb": "https://img.gamemonetize.com/23mq2nwo4fqv5wm9x8c3gncptz8odtud/512x384.jpg",
        "width": "400",
        "height": "700"
    },
    {
        "id": "51282",
        "title": "Christmas Santa Lights",
        "description": "Try out this entertaining game, Christmas Santa Lights. It&rsquo;s our favorite time of year again, and we&rsquo;re eagerly waiting for Santa to deliver our beautiful gifts. But are you aware of the suffering that Santa endures to gather the presents and lights? So let us assist Santa in gathering the most lights possible so that he can get great points. Assist Santa with gathering the lights and destroying them all without coming into contact with the bombs. Accelerate your reflexes use strategic movement to avoid getting hit by explosives and gather as many lights as you can. Enjoy the Jhurr games during the Christmas season. Visit jhurr.com",
        "instructions": "Select the slots",
        "url": "https://html5.gamemonetize.com/mudys1v33ipxfjtxpdsy5idzfcep3hmp/",
        "category": "Arcade",
        "tags": "Christmas, Hypercasual, Santa",
        "thumb": "https://img.gamemonetize.com/mudys1v33ipxfjtxpdsy5idzfcep3hmp/512x384.jpg",
        "width": "350",
        "height": "623"
    },
    {
        "id": "51248",
        "title": "BaseBall League 2024",
        "description": "Hit, Run, Score! Batter up! Play ball! Hit more powerful home runs to dominate the competition! Play short yet sweet memorable matches!",
        "instructions": "Mouse click or E Key To Play",
        "url": "https://html5.gamemonetize.com/zwdv2czbhm5w9yj00fu77ph9uud8setq/",
        "category": "Arcade",
        "tags": "1 Player, Ball, Baseball, Fun, Sport, Stickman",
        "thumb": "https://img.gamemonetize.com/zwdv2czbhm5w9yj00fu77ph9uud8setq/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51343",
        "title": "Pinball Space",
        "description": "In this pinball classic arcade game, launch your pinball into space. Keep the ball bouncing and hitting objects as long as you can to earn points!",
        "instructions": "Tap or click the arrow to play On your computer use the arrow keys To launch the pinball hold the DOWN arrow to increase momentum and then let go Use the LEFT and RIGHT arrows to move the flippers to keep your pinball in play On your mobile or table",
        "url": "https://html5.gamemonetize.com/ho4q3oqhi68ae658nyzg26monk8up183/",
        "category": "Arcade",
        "tags": "1 Player, Pinball, Simulator",
        "thumb": "https://img.gamemonetize.com/ho4q3oqhi68ae658nyzg26monk8up183/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51321",
        "title": "Arrow King",
        "description": "Arrow King is a thrilling archery adventure that puts you in the shoes of a skilled archer on a quest for glory. Set in a medieval world filled with challenging targets and obstacles, your aim is to become the ultimate Arrow King. Test your precision and timing as you shoot your way through intricate levels, mastering the art of archery. With stunning graphics and addictive gameplay, Arrow King offers hours of fun for both casual players and archery enthusiasts. Can you rise to the challenge and claim the of Arrow King? Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/52y1gelj2yxmh0hk6kkio8f23j2xgm8m/",
        "category": "Arcade",
        "tags": "Arcade, Bow, HTML5, Shooting, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/52y1gelj2yxmh0hk6kkio8f23j2xgm8m/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "40017",
        "title": "Samurai running",
        "description": "Samurai run is a running game in which you have to get as far as possible with your hero. You have to avoid bombs and other obstacles on the route. Collect the coins for maximum profit.",
        "instructions": "mouse and touch",
        "url": "https://html5.gamemonetize.com/vemymn9e10ej05h6ocsekqxd5k7rhbsz/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, Boys, Ninja, running, Samurai",
        "thumb": "https://img.gamemonetize.com/vemymn9e10ej05h6ocsekqxd5k7rhbsz/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "51272",
        "title": "Red Hair Knight Tale",
        "description": "Red Hair Knight Tale is a cool and epic 2D medieval swordman adventure game. You have to destroy monsters and reach the brown flag at each level. You can also grab gold coins to boost your total score. They are not useful in this game, but you can find them from chests or monster bodies. You have to jump twice to get to higher platforms, and run to the finish flag before monsters kill you!",
        "instructions": "On PC AD or Left and Right Arrows move Space jump J attack On Mobile Tap buttons on the screen ",
        "url": "https://html5.gamemonetize.com/5g9zrt10m0p63jwid7jxlfadgqpbbv4t/",
        "category": "Arcade",
        "tags": "2D, Avoid, Boys, Collecting, Girls, jump, Kids, Monster, Platform",
        "thumb": "https://img.gamemonetize.com/5g9zrt10m0p63jwid7jxlfadgqpbbv4t/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "51190",
        "title": "Two Cat Cute",
        "description": "Are you ready for the adventure of two sweet cats? The cats need to return to their clubhouse. To get back to the clubhouse, you must overcome obstacles. Collect the cat paws; they are very cute. Be very careful. Jump with the sweet cats and reach the clubhouse.",
        "instructions": " Use the Arrow Keys to move the Black Cat Use the WASD to move the White Cat both mobile and desktop playability ",
        "url": "https://html5.gamemonetize.com/qltcv8c0vc2glupz3ny4bn4id4nkcfjt/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Animal, Arcade, Cat, Cute",
        "thumb": "https://img.gamemonetize.com/qltcv8c0vc2glupz3ny4bn4id4nkcfjt/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51288",
        "title": "Traffic Jam 3D",
        "description": "Rev up your engines and brace yourself for the ultimate gridlock showdown in Traffic Jam 3D! Take on the role of a traffic controller and dive into a chaotic world of jam-packed streets. Strategize and rearrange vehicles to create paths and guide traffic to its destination. With its intuitive controls and realistic 3D graphics, Traffic Jam 3D will test your patience and problem-solving skills like never before. Get ready to unravel the tangled web of traffic and become a master of the road!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/mosskltnxoznaz9tau6dkha7uhphelpe/",
        "category": "Arcade",
        "tags": "3D, 3D Games, Best Games, Car, Cars, free games for your site, free games for your website, games for your website, unity games for your website, Unity3D",
        "thumb": "https://img.gamemonetize.com/mosskltnxoznaz9tau6dkha7uhphelpe/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51212",
        "title": "Relaxing BananaCAT Clicker",
        "description": "Embark on a charming adventure with Relaxing BananaCAT Clicker, an engaging mobile game that combines feline cuteness with addictive tapping fun. Navigate a world filled with banana-wielding cats, each click bringing you closer to banana bonanzas. Upgrade your cat companions and unlock new, whimsical characters as you amass bananas for ultimate satisfaction. With vibrant visuals and delightful sound effects, the game offers a captivating experience thats easy to pick up and hard to put down. Join the craze, enjoy the thrill of accumulating bananas, and immerse yourself in the delightful universe of Relaxing BananaCAT Clicker for endless",
        "instructions": "click on the banana cat when you reach enough bananas you can buy the desired upgrades",
        "url": "https://html5.gamemonetize.com/23o0yg2mjypihfctl5q67mm7u3jh25r4/",
        "category": "Arcade",
        "tags": "Animal, Cat, Clicker, Fruit, Music, Point And Click, Relaxation",
        "thumb": "https://img.gamemonetize.com/23o0yg2mjypihfctl5q67mm7u3jh25r4/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51260",
        "title": "Amazing Digital Circus   Pomni",
        "description": "Amazing Digital Circus - Pomni is a vibrant coloring game that will captivate you with its interactive coloring pages and rich palette. Explore different themes and styles as you paint your way through each challenge. With Amazing Digital Circus - Pomni, you have the power to turn blank pages into colorful masterpieces. Pick up your virtual brush and let the colors flow!",
        "instructions": "use mouse to play",
        "url": "https://html5.gamemonetize.com/ko2n2xt2i52n5p9pmq4d52tomtdselmt/",
        "category": "Arcade",
        "tags": "circus, Coloring, digital circus, Drawing",
        "thumb": "https://img.gamemonetize.com/ko2n2xt2i52n5p9pmq4d52tomtdselmt/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51233",
        "title": "Space Mission Truck  (Nice truck)",
        "description": "Blast off into an intergalactic adventure with Space Mission Truck, the high-octane game that puts you in the drivers seat of an epic space exploration truck! Navigate treacherous alien landscapes, dodge meteor showers, and collect valuable resources to advance your mission. With its immersive graphics and thrilling gameplay, Space Mission Truck will have you on the edge of your seat. Prepare for an out-of-this-world experience as you conquer the cosmos in your trusty truck!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/o8xa76jkolphp0w6rsh0scuyas29j8hi/",
        "category": "Arcade",
        "tags": "Car, Cars, free games for your website, html5 games",
        "thumb": "https://img.gamemonetize.com/o8xa76jkolphp0w6rsh0scuyas29j8hi/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51173",
        "title": "Geometry Dash Maze Maps",
        "description": "Welcome to one of the funniest and mega coolest skill games - Geometry Dash Maze maps . Here, you will plunge into the magnificent world of fun geometric shapes. Your character will be a cool luminescent square with a big smile. This little rascal will maneuver among the peaks of sharp triangles and multiple traps. In the game, you will help the square overcome all obstacles. For this you will need all your dexterity and cunning, because ahead of you is waiting a hard way. Be as observant as possible and try to quickly click to make a timely jump. Think through all the actions and prepare for the next jump, as soon as you s",
        "instructions": "mobile device touch jump pc space jump",
        "url": "https://html5.gamemonetize.com/m0f68pr59l5jbq3e4mgsi3dlq83c0wgs/",
        "category": "Arcade",
        "tags": "Arcade, Arena, Best Games",
        "thumb": "https://img.gamemonetize.com/m0f68pr59l5jbq3e4mgsi3dlq83c0wgs/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "50800",
        "title": "Runner Slapper",
        "description": "Slap Contest Champion invites players to the electrifying world of competitive slapping! Engage in intense slap battles against opponents, mastering the perfect timing and strength to deliver the mightiest slap. Strategize your moves, gauge your opponents reactions, and unleash powerful slaps to claim victory. With diverse characters, skill levels, and arenas, the game offers thrilling challenges at every level. Compete in tournaments, hone your technique, and aim to become the ultimate Slap Contest Champion. Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/83jde18i3v6k79vj5x38gj5o7vulx7s5/",
        "category": "Arcade",
        "tags": "Arcade, Platform, running, Unity3D",
        "thumb": "https://img.gamemonetize.com/83jde18i3v6k79vj5x38gj5o7vulx7s5/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51124",
        "title": "Digital Circus Tower Runner",
        "description": "Digital Circus Tower Runner is an electrifying Unity script-driven adventure that challenges players to ascend a towering circus spectacle. In this heart-pounding game, you embody a daring acrobat navigating a maze of obstacles, traps, and tricks. Utilize your Unity script knowledge to swing, leap, and flip your way to the top while avoiding circus hazards. With stunning visuals and dynamic gameplay, Digital Circus Tower Runner guarantees an adrenaline-packed experience that will keep you on the edge of your seat. Website Developer <a href='https://pt.bestcrazygames.com'>https://pt.bestcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/6gibkzz93u3ojuwcr6ddtfkr21bjioqq/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, circus, digital circus",
        "thumb": "https://img.gamemonetize.com/6gibkzz93u3ojuwcr6ddtfkr21bjioqq/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50850",
        "title": "Cube Loop Jumper",
        "description": "Cube Loop Jumper challenges players to navigate a mesmerizing cubic landscape. Jump, flip, and loop through gravity-defying levels while dodging obstacles and collecting power-ups. With its minimalist design and intuitive controls, the game offers a thrilling experience for all ages. Progress through increasingly complex levels, each with unique challenges that test your reflexes and strategic thinking. Engage in an addictive blend of precision and speed as you leap through this cubic adventure. Website Developer <a href='https://es.brightestgames.com/'>https://es.brightestgames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/lt7ps1cfcysgcqjr8764qhlmedqxkn7u/",
        "category": "Arcade",
        "tags": "1 Player, Adventure, Arcade, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/lt7ps1cfcysgcqjr8764qhlmedqxkn7u/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47013",
        "title": "Geometry Stack 2048 Run",
        "description": "Geometry Stack 2048 Run is a fun and smart online running and puzzle game. You have to slide the screen and move a block through other blocks. The blocks can combine if they have the same number. For example, two 2 blocks can make a 4 block. Two 4 blocks can make an 8 block, and so on. You have to create bigger numbers before the finish line. Can you reach the number 2048? Test yourself and see!",
        "instructions": "Drag the left mouse or slide on the screen to move the cube",
        "url": "https://html5.gamemonetize.com/rjqphfn4bxgjze4lnto0i6a70fzk2r5x/",
        "category": "Arcade",
        "tags": "2048, Kids, Matching, Platform, Puzzle, running",
        "thumb": "https://img.gamemonetize.com/rjqphfn4bxgjze4lnto0i6a70fzk2r5x/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "50973",
        "title": "Sword Run 3D",
        "description": "Sword Run 3D is an easy to pick up action runner game. Collect sword pieces, cut off the obstacles that block your progress, and finally reach the finish line to win. More cool skins are waiting for you to unlock, what are you waiting for? Dont forget to share it with your friends if its fun!",
        "instructions": "Slide to move",
        "url": "https://html5.gamemonetize.com/8rdz9xsqriwu77kgvyjaiww1bf2e1m0i/",
        "category": "Arcade",
        "tags": "Arcade, H5, Kids, running, Sword",
        "thumb": "https://img.gamemonetize.com/8rdz9xsqriwu77kgvyjaiww1bf2e1m0i/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "50964",
        "title": "Musical Ball Jump",
        "description": "Get ready for a rhythm-infused adventure in Musical Ball Jump! This captivating mobile game combines the excitement of traditional platformers with the groove of music. Your mission? Control the bouncing ball as it ascends through a series of challenging levels, all synchronized to an infectious beat. Time your jumps perfectly to the music to avoid obstacles and collect musical notes for extra points. With vibrant visuals, catchy tunes, and addictive gameplay, Musical Ball Jump is the ultimate test of your reflexes and musical prowess. Can you reach the top and become the rhythmic champion?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/zqmtqyc7sryczxf8qgruwccepnq38ouw/",
        "category": "Arcade",
        "tags": "Ball, Fun, Music, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/zqmtqyc7sryczxf8qgruwccepnq38ouw/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50948",
        "title": "Merge Plants and Zombies",
        "description": "Combine similar zombies or plants on the same level to create a stronger army. Zombies are used for close combat, plants for ranged combat. Your team will become stronger if you buy more zombies and assemble them into the smartest squad. Try your best to destroy your enemies before your army dies.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/w2uepocvjteetpkcnmptuhf7fgi1h9z7/",
        "category": "Arcade",
        "tags": "3D, Arcade, HTML5, Strategy, Zombie",
        "thumb": "https://img.gamemonetize.com/w2uepocvjteetpkcnmptuhf7fgi1h9z7/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50944",
        "title": "Zombie Towers",
        "description": "You are the last group of survivors on the planet, and your goal is to defend your castle from brutal enemy attacks and destroy the zombie army.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/06qwivcn2bn2gelwm4sjho2pvudopyfy/",
        "category": "Arcade",
        "tags": "Arcade, Defense, Strategy, Zombie",
        "thumb": "https://img.gamemonetize.com/06qwivcn2bn2gelwm4sjho2pvudopyfy/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50869",
        "title": "Blocky Neon",
        "description": "Blocky Neon is a fun neon themed Tetris game, play to enjoy collecting as many blocks as you can and getting high scores. There will be a variety of blocks in this engaging game. Arrange them, perfect your plan, and clear as many of the blocks as you can. All generations are going to love this game. Enjoy the Neon theme, as they look bright and fun. Jhurr presents all the exclusive and addicting games for all ages.",
        "instructions": "ASWD and Mouse to Arrange",
        "url": "https://html5.gamemonetize.com/mghucfpyh018g5uif5pjfom91je34i4q/",
        "category": "Arcade",
        "tags": "Block, Puzzle, Tetris",
        "thumb": "https://img.gamemonetize.com/mghucfpyh018g5uif5pjfom91je34i4q/512x384.jpg",
        "width": "350",
        "height": "623"
    },
    {
        "id": "46333",
        "title": "Warrior Kingdom",
        "description": "Warrior Kingdom is an action RPG for one person. You will guide your character through the game, fighting enemies and completing tasks. The game includes a number of different weapons and armor, as well as spells and abilities. To battle the enemies and save the kingdom, you must employ all of your skills.",
        "instructions": "To Move the Character Left Arrow Right Arrow",
        "url": "https://html5.gamemonetize.com/17rl27edmekpby1nwp1bdllcrwzt3jkl/",
        "category": "Arcade",
        "tags": "2D, Action, Adventure, Arcade, Fight, Fighting, Fun, Funny, Game, Games, HTML, HTML5, NapTech Games, Online",
        "thumb": "https://img.gamemonetize.com/17rl27edmekpby1nwp1bdllcrwzt3jkl/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "50917",
        "title": "Arena : Box",
        "description": "Are you up for a competitive match with your friend? Swords are drawn, lets start attacking. Buy the best sword and defeat your enemy. Run to the box and collect it. If you stay by the box for 20 seconds, it will open, and you win. Stand by the box for 20 seconds and claim victory.",
        "instructions": " Use the WASD keys to move the red player Use the S key to attack with the sword Use the Arrow Keys to move the blue player Use the Down Arrow key to attack with the sword Wait by the box for 20 seconds and win ",
        "url": "https://html5.gamemonetize.com/67raryei1qpk20i01tosxymy3ypeox0c/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, Adventure, Android, Arcade, Cartoon, Mobile",
        "thumb": "https://img.gamemonetize.com/67raryei1qpk20i01tosxymy3ypeox0c/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50914",
        "title": "Jumping Robot",
        "description": "Jumping Robot is an exciting online game where you are in control of a nimble and agile robot that loves to jump! Your mission is to navigate through a series of platforms and collect batteries to increase your score. The gameplay is straightforward yet challenging - you must time your jumps perfectly to land on each platform and avoid falling into the depths below. To make things even more interesting, some platforms will be constantly moving left and right, adding an element of unpredictability to the game. This requires quick reflexes and precise control to stay on track. The ultimate goal is to collect as many batteries as possible.",
        "instructions": "Use the arrow keys to play or tap on the game screen ",
        "url": "https://html5.gamemonetize.com/d707fiaxt0i7yvvcyusnoi7h92rm9uoh/",
        "category": "Arcade",
        "tags": "Arcade, Jumping, Kids, Platform",
        "thumb": "https://img.gamemonetize.com/d707fiaxt0i7yvvcyusnoi7h92rm9uoh/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "50890",
        "title": "Cap Opener",
        "description": "Cap Opener is an engaging and fast-paced mobile game where players enter a world of adventure and strategy. Set in a whimsical universe, players must skilfully navigate through levels, unlocking various magical bottles. Each bottle presents unique challenges and puzzles, requiring clever tactics to open. Players can collect special tools and power-ups, enhancing their abilities to tackle increasingly complex puzzles. With its vibrant graphics, intuitive controls, and a progressively challenging gameplay. Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/apqsdr58pvpmk61n5cqu8wqzwbvfvocn/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, HTML5, html5 games, Puzzle, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/apqsdr58pvpmk61n5cqu8wqzwbvfvocn/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50697",
        "title": "Mien and Bugr Skate",
        "description": "Would you like to join the adventurous journey of two cute friends on their skateboards? They need to get home right away. Both friends pink and brown pets have escaped into the streets, so find them and safely return home. Dont forget to collect all the gold coins along the way. Be cautious, as monsters are lurking everywhere, and they might try to devour you.",
        "instructions": " Collect all the badges activate the Black Hole Playable on both desktop and mobile Jump by pressing the W key and the Arrow up key ",
        "url": "https://html5.gamemonetize.com/2x99mlucox7qx53jzfgaaawy2xk7rz5v/",
        "category": "Arcade",
        "tags": "1 Player, 2 Player, 2 Player Games, 2D, Adventure, Animal, Arcade",
        "thumb": "https://img.gamemonetize.com/2x99mlucox7qx53jzfgaaawy2xk7rz5v/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50825",
        "title": "Group Runner Brawl",
        "description": "Group Runner Brawl is a frenetic multiplayer game where teamwork collides with chaos! Join forces with friends or go head-to-head in a fast-paced obstacle race through dynamic arenas. Customize your character, strategize with power-ups, and navigate wild challenges while disrupting opponents progress. With unpredictable twists and a blend of cooperation and rivalry, every match is a riotous test of skill and collaboration. Can your group outmaneuver the mayhem and claim victory in this high-energy, uproarious brawl? Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/z8x6glbuisirvogacvtamh3mm73cgj29/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, HTML5, Mobile, Platform, running, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/z8x6glbuisirvogacvtamh3mm73cgj29/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50605",
        "title": "Christmas Elves Coloring Game",
        "description": "Unleash your creativity and immerse yourself in a world of vivid colors with Christmas Elves Coloring Game! This interactive coloring book brings a delightful experience for artists of all ages. Dive into an expansive collection of designs ranging from serene landscapes to intricate patterns. Christmas Elves Coloring Game offers an escape to a digital canvas where imagination is your only limit. Choose your palette, fill in the hues, and watch each page come to life with every touch. Whether youre looking to relax, improve your coloring skills, or simply have some fun, Christmas Elves Coloring Game is the perfect blend of entertainment and r",
        "instructions": "Click or tap to play",
        "url": "https://html5.gamemonetize.com/31069946i2fcboyxx9a16qdlc6ym9wn1/",
        "category": "Arcade",
        "tags": "Christmas, Color, Coloring, HTML5, WebGL",
        "thumb": "https://img.gamemonetize.com/31069946i2fcboyxx9a16qdlc6ym9wn1/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50222",
        "title": "Block Puzzle 2023",
        "description": "Block Puzzle 2023 is a fun and addictive block puzzle game that serves as an ideal choice when you want to pass the time and challenge your brain. This brain games objective is simple yet engaging: clear as many colored tiles as possible to achieve a high score. Mastering the techniques of filling rows or columns will make the puzzle game easier. This block puzzle game not only offers an enjoyable gaming experience but also enhances your logical skills and trains your brain.",
        "instructions": "Use Mouse To Drag and Drop The Blocks ",
        "url": "https://html5.gamemonetize.com/50wo5as1dmlcuus38rwtfhxp20vg1x5p/",
        "category": "Arcade",
        "tags": "2D, Block, Fun, Puzzle, Tetris",
        "thumb": "https://img.gamemonetize.com/50wo5as1dmlcuus38rwtfhxp20vg1x5p/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50756",
        "title": "STRAX BALL 3D",
        "description": "Hello, we introduce you to the STRAX BALL 3D game. In this game, the ball should not touch other colors. There are difficult levels. Good gameplay.",
        "instructions": "LEFT RIGHT",
        "url": "https://html5.gamemonetize.com/jvi8ksh17oryca3738yewviyjow4qcib/",
        "category": "Arcade",
        "tags": "1 Player, 3D Games",
        "thumb": "https://img.gamemonetize.com/jvi8ksh17oryca3738yewviyjow4qcib/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50698",
        "title": "Katana Fruit Slasher",
        "description": "Embark on a slicing frenzy in Katana Fruit Slasher! Unleash your samurai skills to slice through a cascade of fruits hup high scores. Customize your katana and unlock new blades as you advance through challenging levels. With vibrant visuals and addictive gameplay, test your reflexes in this fruit-slicing adventure. Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/2rhz0tnoqtka5zlruweihv58d6efnt1r/",
        "category": "Arcade",
        "tags": "Arcade, cut, Ninja, Sword, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/2rhz0tnoqtka5zlruweihv58d6efnt1r/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50587",
        "title": "Space Prospector",
        "description": "Space Prospector is a fun game where you have to fly on a jet device, search, collect and transport&nbsp;gems and gold coins&nbsp;to the base.&nbsp;For each&nbsp;gem&nbsp;delivered to the base you get a certain amount of points which depends on its color.&nbsp;Also is necessary to collect the gold coins.&nbsp;When delivering the gold coin to the base all previously obtained points are doubled. For points&nbsp;earned&nbsp;you can fill the ship with fuel and repair it.&nbsp; The goal is to earn as many points at each level.",
        "instructions": "Computer Left key - turn on the shunting engine - fly to the left Right key - turn on the shunting engine - fly to the right Up key - turn on the main engine - fly to the top Space key - turn on the main engine - fly to the top Mobile devices Virtual bu",
        "url": "https://html5.gamemonetize.com/jjnrvwv3nazm9ir226kvhonqocg8nm6r/",
        "category": "Arcade",
        "tags": "Flight, Gold, Rocket, Space",
        "thumb": "https://img.gamemonetize.com/jjnrvwv3nazm9ir226kvhonqocg8nm6r/512x384.jpg",
        "width": "720",
        "height": "480"
    },
    {
        "id": "50647",
        "title": "Burger Fold Puzzle",
        "description": "Burger Fold Puzzle challenges players to become master chefs by solving culinary conundrums. Craft perfect burger combinations by strategically folding ingredients to create delectable masterpieces. With each level offering a new burger to assemble, precision and speed are key. Navigate through a variety of ingredients, obstacles, and challenges while aiming for the ultimate burger perfection. This addictive and fun puzzle game tests your creativity and logic while serving up a savory experience. <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/zgr418j0feqodz56ekcun3j8dtwvqixa/",
        "category": "Arcade",
        "tags": "Arcade, Food, Restaurant, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/zgr418j0feqodz56ekcun3j8dtwvqixa/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50629",
        "title": "Squid Abecedary Game",
        "description": "Squid Abecedary Game dives into an underwater world where players aid Squidy, a lovable squid, in learning the ABCs. Navigate through immersive aquatic environments, solving puzzles and challenges tailored to each letter of the alphabet. Engage in interactive activities that reinforce letter recognition and phonics skills while uncovering hidden treasures. With engaging gameplay and delightful visuals, embark on an educational adventure that makes learning the alphabet a joyous underwater escapade. Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/f8t2kpsdgs7s4nuho6c7bkaypyylqb7s/",
        "category": "Arcade",
        "tags": "3D, Arcade, running, Shooting, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/f8t2kpsdgs7s4nuho6c7bkaypyylqb7s/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50566",
        "title": "Strongest Towers Huggy",
        "description": "Strongest Towers Huggy pits players against a relentless onslaught of quirky monsters. Assemble an arsenal of cuddly towers, each boasting unique abilities, to defend against waves of foes across vibrant landscapes. Strategize tower placement and upgrade paths wisely to fend off ever-evolving enemy waves. Engage in challenging levels, unlock powerful upgrades, and harness the strengths of each tower to triumph in this delightful tower defense adventure. Ready to hug it out while defending against the adorable yet formidable invaders?",
        "instructions": "Mouse click or tap to play You can also merge the fighters to create even stronger ones ",
        "url": "https://html5.gamemonetize.com/5oxd1npajxtcf03mysergzp21db3hnd0/",
        "category": "Arcade",
        "tags": "3D, Strategy, Unity3D, War, WebGL",
        "thumb": "https://img.gamemonetize.com/5oxd1npajxtcf03mysergzp21db3hnd0/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50508",
        "title": "Obstacle Head Destroyer",
        "description": "Obstacle Head Destroyer is an adrenaline-pumping action game that puts you in control of a fearless character with one mission: obliterate obstacles! Navigate through a treacherous world filled with challenging barriers, using your quick reflexes and precision to smash through them. With intuitive controls and addictive gameplay, this game offers a thrilling experience for players of all skill levels. Dodge, dash, and destroy your way to victory as you conquer increasingly difficult levels. Are you ready to become the ultimate obstacle destroyer? Website Developer",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ktqdhxm0zl2rujqqxzlpmjks03tghetp/",
        "category": "Arcade",
        "tags": "Fun, HTML5, Mobile, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/ktqdhxm0zl2rujqqxzlpmjks03tghetp/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "50380",
        "title": "Roblox: Spiderman Upgrade",
        "description": "- Do you want to get faster or jump higher? Then collect more gold and improve your abilities. - Every 100 coins you collect will give you 2 options to improve your abilities, whether you want to increase your jumping power or your speed, the choice is yours. - You can make your interlocks anytime, anywhere - Collect as many coins as you can and improve yourself to make the game more fun.",
        "instructions": "Control WASD - Movement Mouse - Camera view Space - Jump Shift - Run You can increase or decrease your viewing angle with mouse scrolling",
        "url": "https://html5.gamemonetize.com/2s24nenxf9gopwr4mcmtu9fstpf8xxir/",
        "category": "Arcade",
        "tags": "1 Player, 3D, 3D Games, Adventure, Arcade, Best, Casual, Collecting, jump, Spiderman, Stunts",
        "thumb": "https://img.gamemonetize.com/2s24nenxf9gopwr4mcmtu9fstpf8xxir/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "21816",
        "title": "Missile Launch Master",
        "description": "Experience the thrill of Missile Launch Master, a 3D simulation game that will test your missile skills. You will play as a missile pilot who must dodge hot air balloons and helicopters in the sky. You will also have to fly the missile over an island and hit the target before the time runs out. Missile Launch Master is a game that combines stunning 3D graphics. You will feel like you are in the cockpit of a real missile. Can you complete all the missions and destroy the enemy&rsquo;s base?",
        "instructions": "Drag to control the missile",
        "url": "https://html5.gamemonetize.com/xcb6nq6ph2yws60au6ja6d0wi52cwoeb/",
        "category": "Arcade",
        "tags": "3D, Avoid, Bomb, Boys, Girls, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/xcb6nq6ph2yws60au6ja6d0wi52cwoeb/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "50457",
        "title": "Axe Throw King",
        "description": "Axe Throw King is an adrenaline-pumping mobile game that puts your aiming skills to the test. In this thrilling axe-throwing challenge, step into the shoes of a medieval warrior and take on increasingly difficult targets. Swipe your finger to launch the deadly axes and hit bullseyes to earn points. With stunning graphics and intuitive controls, Axe Throw King offers hours of addictive fun. Compete with friends to see who can become the ultimate Axe Throw King in this action-packed game of precision and accuracy! Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/unhusfstmchh3kp9iln47icalnn6zw78/",
        "category": "Arcade",
        "tags": "Arcade, HTML5, Mobile, Sports, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/unhusfstmchh3kp9iln47icalnn6zw78/512x384.jpg",
        "width": "350",
        "height": "600"
    },
    {
        "id": "47373",
        "title": "Acrylic Nails",
        "description": "Enjoy endless combinations of nail shapes, colors and patterns! Unlock various accessories for your manicure salon through your management skills. The more manicures you create, the more unlocks you get.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/xgtt4qxxktnb3yg3f64r1xbisnomdy8j/",
        "category": "Arcade",
        "tags": "1 Player, 3D, Arcade, Casual, Girl, HTML5, Nail, Nails",
        "thumb": "https://img.gamemonetize.com/xgtt4qxxktnb3yg3f64r1xbisnomdy8j/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46277",
        "title": "Flappy Fish Journey",
        "description": "Flappy Fish Journey is a fun and challenging game where you control a small fish as it swims through a series of obstacles. The goal of the game is to reach the end of the level without hitting any obstacles. To control your fish, simply tap the screen to make it flap its fins. The faster you flap, the faster your fish will swim. The obstacles in Flappy Fish Journey come in all shapes and sizes. There are rocks, seaweed, and even other fish. If you hit any of these obstacles, you will lose a life. Flappy Fish Journey is a great game for players of all ages. It is simple to learn, but challenging to master.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/hr962quu0hxd4mvcdobwtdd7g0btlt4i/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Fish, Fun, Funny, Game, Games, Highscore, Hypercasual, jump, Jumping, NapTech Games, Obstacle, Online",
        "thumb": "https://img.gamemonetize.com/hr962quu0hxd4mvcdobwtdd7g0btlt4i/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "50375",
        "title": "People Throw!",
        "description": "People Throw! is an engaging Unity-based game that harnesses the power of scripting to create an exhilarating experience. In this unique, players must strategically toss characters into designated targets while navigating challenging obstacles. With precise physics and intuitive controls, its a test of precision and skill. Customize your characters, unlock new levels, and compete with friends in this addictive and physics-driven adventure. Get ready to embark on a journey of throwing fun in People Throw! Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/7remuq85sfcjgp9nkpz95cdnonu6uy3u/",
        "category": "Arcade",
        "tags": "1 Player, 3D, Adventure, Arcade, Fun, huggy, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/7remuq85sfcjgp9nkpz95cdnonu6uy3u/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50411",
        "title": "Mien Bugr Skate",
        "description": "Would you like to join the adventurous journey of two cute friends on their skateboards? They need to get home right away. Both friends pink and brown pets have escaped into the streets, so find them and safely return home. Dont forget to collect all the gold coins along the way. Be cautious, as monsters are lurking everywhere, and they might try to devour you.",
        "instructions": " Collect all the badges activate the Black Hole Playable on both desktop and mobile Jump by pressing the W key and the Arrow up key ",
        "url": "https://html5.gamemonetize.com/gbcwm5ud14k29va0bdz1a3nt54jzbwrt/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, 3D, Cute, Disney, Funny, Monster",
        "thumb": "https://img.gamemonetize.com/gbcwm5ud14k29va0bdz1a3nt54jzbwrt/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50319",
        "title": "Crazy Balls 3D",
        "description": "A game for those who love to drive along crazy tracks, knocking down everything in their path! Roll, jump, fly, overtaking the balls and be the first to reach the finish line! Climb the rankings and become a racing king! Race crazy balls on bizarre tracks. Swipe quickly to gain more speed, flying over gaps and avoiding obstacles to reach the finish line first",
        "instructions": "Reach the finish first to win Swipe forward to speed up the ball swipe left and right to turn Swipe fast",
        "url": "https://html5.gamemonetize.com/d0ke72ygyhtlwg15fctmxmkpjiuyyrw2/",
        "category": "Arcade",
        "tags": "1 Player, 3D, 3D Games, Air, Android, Ball, Best Games, fly, Levels, Multiplayer, Race, Racing",
        "thumb": "https://img.gamemonetize.com/d0ke72ygyhtlwg15fctmxmkpjiuyyrw2/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50358",
        "title": "Rainbow Obby",
        "description": "This is an exciting game in which the player controls a character passing through a variety of obstacles. Using bonuses, the player can jump higher, fly short distances to overcome all obstacles. Gameplay: The gameplay consists of passing different levels, each of which is a unique location with a variety of obstacles and traps. The player controls his character, overcoming the abyss, jumping on platforms and collecting bonuses. Power-ups: Power-ups play an important role in the game, allowing the player to overcome various obstacles and avoid dangers.",
        "instructions": "Computer management 1 Moving the WASD button 2 jump space bar button 3 camera control computer mouse Mobile management 1 movement and camera joysticks 2 jump button",
        "url": "https://html5.gamemonetize.com/olpcx88c0opv3tq3yhyr323313tx2s37/",
        "category": "Arcade",
        "tags": "3D Games, fly, Funny, Mobile, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/olpcx88c0opv3tq3yhyr323313tx2s37/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "49330",
        "title": "Army Raid",
        "description": "A distinct and thrilling tactical game will engage you through its mechanics. Seize territories from your foes and dominate the continent. Invaders have seized your realm and taken your fortresses; reclaim them with your soldiers assistance. Enlist fresh troops, enhance their skills, and triumph in each skirmish. Earn prizes for each vanquished adversary. Spend them judiciously and obliterate your rivals. Website Developer <a href='https://zh.kizi10.org'>https://zh.kizi10.org</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ifl0vhbhy3we7taumpq8g9i75egpunu5/",
        "category": "Arcade",
        "tags": ".io Games, Android, Arcade, Click, Clicker, HTML5, iPad, iPhone, Mentolatux, Mobile, Point And Click, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/ifl0vhbhy3we7taumpq8g9i75egpunu5/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50359",
        "title": "Techno Basket Ball",
        "description": "Techno Basket Ball is an electrifying fusion of sports and technology, offering players an adrenaline-packed gaming experience. Take on the role of a futuristic athlete, equipped with advanced cyber enhancements, as you compete in high-octane basketball matches. Engage in gravity-defying dunks, precision three-point shots, and fast-paced team play in a dazzling neon-lit arena. With cutting-edge visuals and immersive soundscapes, this game redefines the boundaries of traditional basketball. Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/40ycn7eulfvp02v9m6h0l4h5bqydx8sb/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, Ball, Basketball, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/40ycn7eulfvp02v9m6h0l4h5bqydx8sb/512x384.jpg",
        "width": "950",
        "height": "600"
    },
    {
        "id": "47540",
        "title": "Flying Challenge",
        "description": "Flying Challenge is a Flappy Bird game with a twist. In this game, you control a bird that is trying to fly through a series of obstacles, including bow, and other objects. The goal is to fly as far as you can without hitting anything. The game is simple to play but difficult to master. You can control the bird by tapping and holding on the screen. This will make the bird flap its wings, which gives it lift. You need to time your taps carefully in order to avoid the obstacles.",
        "instructions": "Desktop Use the right click button of the mouse to jump the bird Mobile Tap on the screen to jump the bird Controls and Indicators The scores and levels are shown in the upper middle of the screen ",
        "url": "https://html5.gamemonetize.com/f47lm1mrnh9ro64sdzrhow49mz7m757g/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Avoid, Bird, fly, Game, Hypercasual, NapTech Games, Online",
        "thumb": "https://img.gamemonetize.com/f47lm1mrnh9ro64sdzrhow49mz7m757g/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "50264",
        "title": "Eat Small Fish",
        "description": "Eat Small Fish is a game where you must eat small other fish to survive and become bigger. Eat Small Fish include all kinds of hungry fishes in the undersea water. They tanked and attacked smaller fish to become the ocean most powerful fish eater. Big fish eat small fish to be giant fish. Giant fish eat big fish and turn over the Mega fish. Mega fish eat giant fish and finally become fabulous fish in the underwater sea.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/5h7odu5oyzgdzo77493utlamcoz43wlj/",
        "category": "Arcade",
        "tags": "Fish, Fishing",
        "thumb": "https://img.gamemonetize.com/5h7odu5oyzgdzo77493utlamcoz43wlj/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "50320",
        "title": "Duo Robot Skibidi",
        "description": "The robot toilet men are trying to escape. Work together with your friend to overcome all obstacles and reach the door. Progress in sequence and teamwork. First one, then the other should advance. Strive to reach the door with your friend. Be careful, some floors can disappear, and make sure not to die. There are sharp rotating saws everywhere.",
        "instructions": " Player1 use Arrow keys to move Player2 use WASD to move Mobile Touch Control",
        "url": "https://html5.gamemonetize.com/e87ffo4t0qliunpdrb2mha5th9osinov/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Arcade, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/e87ffo4t0qliunpdrb2mha5th9osinov/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50315",
        "title": "Roblox: Multiverse Spider",
        "description": "In this obby mode, you need to switch between different universes and win the super cup as quickly as possible. The spiderbug-male character is there to assist you in these challenging universes. You can unlock him by collecting green ores. Its impossible not to enjoy this adventurous game. Enter now and play the game!",
        "instructions": "- WASD - control the character - Space bar - jump - Esc - pause the game - Rotate the camera with the mouse - R - use the parachute with the key - Shift - key to speed up even more - Switch between characters with the 1 and 2 keys ",
        "url": "https://html5.gamemonetize.com/t1aqbg1kw44um7e9jr0uuc4a7k6sh7ho/",
        "category": "Arcade",
        "tags": "1 Player, 3D, 3D Games, Arcade, Best, Best Games, Boys, Casual, Fun, Girls, jump, Jumping, Kid, Obstacle",
        "thumb": "https://img.gamemonetize.com/t1aqbg1kw44um7e9jr0uuc4a7k6sh7ho/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "50210",
        "title": "Super Jim Adventure",
        "description": "Get ready for a super adventure with Super Jim Adventure, a 2D side-scrolling game that will test your skills and reflexes. You will play as Super Jim, a brave hero who must collect stars and avoid obstacles in his quest to save the world. You will explore 100 different levels, each with its own challenges and surprises. You will also find power-ups that will help you survive the dangers of the game, such as bubbles that make you invincible and mushrooms that make you stronger. But hurry, you only have a limited time to collect all the stars and reach the castle at the end of each level.",
        "instructions": "On PC AD move forward or back W jump L throw hammers On mobile Tap buttons on the screen",
        "url": "https://html5.gamemonetize.com/zxy2gj0hgqm9kwdnounmikgrcqg5n0g7/",
        "category": "Arcade",
        "tags": "Adventure, Avoid, Boys, Casual, Collecting, Girls, Kids, Mario, Pixel",
        "thumb": "https://img.gamemonetize.com/zxy2gj0hgqm9kwdnounmikgrcqg5n0g7/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "50250",
        "title": "3D Painter",
        "description": "Elevate your game development with 3D Painter, a powerful artistic tool for gaming enthusiasts. Seamlessly create and texture 3D models, ensuring theyre optimized for immersive gameplay. With an intuitive interface and a diverse array of brushes and effects, bring your game world to life in stunning detail.",
        "instructions": "Arrow Keys to paint your way to victory ",
        "url": "https://html5.gamemonetize.com/0k7zgvpszr6j4oy2yqeatpyb2di4n2i2/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/0k7zgvpszr6j4oy2yqeatpyb2di4n2i2/512x384.jpg",
        "width": "350",
        "height": "600"
    },
    {
        "id": "50031",
        "title": "Smoothie King",
        "description": "Embark on a fruity journey in Smoothie King: Fruit Adventure, a delightful puzzle game that challenges your matching skills! Join our smoothie-loving protagonist as they explore lush tropical islands, blending colorful fruits to create the ultimate smoothie concoctions. Solve challenging puzzles by matching fruits and completing objectives to unlock new levels and recipes. With stunning graphics and addictive gameplay, Smoothie King: Fruit Adventure is a refreshing twist on the classic match-3 genre. Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/olcpxgd22hs76ac0vqiiry6ieok3we4z/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, Food, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/olcpxgd22hs76ac0vqiiry6ieok3we4z/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "50108",
        "title": "Super Sky Island Adventure",
        "description": "Are you ready to survive on islands in the sky? You must destroy all the mushrooms and pass the levels! You can improve your character with the gold you earn!",
        "instructions": "W A S D or Arrow Keys Movement When you log in to the game from a mobile device you can use the touch controls on the screen ",
        "url": "https://html5.gamemonetize.com/d0qu6l76ptrzre2zyr2cl67hh274y3rp/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Action, Adventure, Island, Pixel, Platform",
        "thumb": "https://img.gamemonetize.com/d0qu6l76ptrzre2zyr2cl67hh274y3rp/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "46517",
        "title": "Noob: Way home",
        "description": "Nubik is surrounded by hordes of zombies, how can he deal with them? Help the nbik complete all the levels! Only you and your skill will help the nubik pass all the levels! Difficult tests await you, which not everyone can handle!",
        "instructions": " larr LEFT ARROW LEFT MOVE rarr ARROW RIGHT RIGHT MOVE uarr UP ARROW JUMP MOVE",
        "url": "https://html5.gamemonetize.com/6xv1bnlmecpi8t3tc63r4xn41iuue7sv/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Action, Arcade, Minecraft",
        "thumb": "https://img.gamemonetize.com/6xv1bnlmecpi8t3tc63r4xn41iuue7sv/512x384.jpg",
        "width": "871",
        "height": "480"
    },
    {
        "id": "49738",
        "title": "Crazy Alien Adventure  ",
        "description": "Crazy Alien Adventure is an addictive and exciting game. You will play as a brave character who runs, jumps, and dashes through various worlds, collecting stars and power-ups along the way. Your goal is to rescue the animals that are trapped in cages by smashing the wooden stakes with your rush power. The more you run, the more points you get. You can also use the stars to buy items and outfits that will enhance your gameplay. Discover different kinds of animals in the game and try to save them all. How far can you go in this amazing endless jumping game?",
        "instructions": "W jump S fall D boost",
        "url": "https://html5.gamemonetize.com/zazbv8xnwjse71yx208mx21h9du5hydn/",
        "category": "Arcade",
        "tags": "Alien, Animal, Crazy, Halloween, Jumping, Side Scrolling",
        "thumb": "https://img.gamemonetize.com/zazbv8xnwjse71yx208mx21h9du5hydn/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "50076",
        "title": "Panda Journey",
        "description": "Panda Journey is a pixel platformer in which you play as a cute little panda in search of love. So how does one go about finding love? Maybe start by buying flowers for your little panda girl! But oops, youve run out of money and you need to collect coins to buy flowers. A total of 20 levels of amazing adventures await you where you need to jump, run and avoid obstacles to collect all the coins. Each level offers its own unique challenges and enemies, creating an interesting and addictive game space. The controls are simple and intuitive, making the game suitable for beginners and experienced players alike.",
        "instructions": "Tap to jump Avoid the spikes Collect all coins to open the portal Reach to the portal to complete the level ",
        "url": "https://html5.gamemonetize.com/96xohr5domvi9z2d7nmkx0vdtevpm53y/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Adventure, Love, Panda, Pixel, Platform",
        "thumb": "https://img.gamemonetize.com/96xohr5domvi9z2d7nmkx0vdtevpm53y/512x384.jpg",
        "width": "320",
        "height": "192"
    },
    {
        "id": "50047",
        "title": "Roblox: Spooky Tower ",
        "description": "This game offers an addictive obstacle course experience that takes you on an adrenaline-fuelled adventure in Halloween Theme. You will test your agility, calculation and precision to overcome this challenging obstacle course. Fast jumps, dynamic platforms and deadly traps will require you to utilise your skills to the max. As you navigate the dangerous terrain, you will struggle to be the fastest and most careful player. Your goal in this fun parkour game is to complete each challenge as fast as possible!",
        "instructions": "- WASD - control the character - Space bar - jump - Esc - pause the game - Rotate the camera with the mouse - R - use the parachute with the key - Shift - key to speed up even more ",
        "url": "https://html5.gamemonetize.com/ldzkkmcauehuukov1hjduskah476n58o/",
        "category": "Arcade",
        "tags": "1 Player, 3D, 3D Games, Arcade, Best, Best Games, Boys, Casual, Fun, Girls, Halloween, jump, Obstacle, Unity3D",
        "thumb": "https://img.gamemonetize.com/ldzkkmcauehuukov1hjduskah476n58o/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "50036",
        "title": "Jeka Dash 2",
        "description": "In this dynamic game you need to dodge various obstacles and get to the finish line. The main character always moves forward and has different shapes with different features - a guy, a plane, a disk, a ball. The game has good graphics, music and different locations. With each level it becomes more difficult, it will take a good reaction, memory and patience to pass, do not despair if you cannot pass all the levels.",
        "instructions": "The left mouse button the W key or Up and on the phone hold at the top of the screen The right mouse button the S key or Down and on the phone hold at the bottom of the screen ",
        "url": "https://html5.gamemonetize.com/83s6fufv3fz3xkef5h92jq9zeljzc1ow/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Action, Adventure, Arcade, HTML5, Platform, run, running",
        "thumb": "https://img.gamemonetize.com/83s6fufv3fz3xkef5h92jq9zeljzc1ow/512x384.jpg",
        "width": "1280",
        "height": "640"
    },
    {
        "id": "49869",
        "title": "2048 Merge Throw",
        "description": "Experience a captivating twist on the classic 2048 game in 2048 Merge Thrower! Combine numbered blocks and h them across the grid in a quest for the elusive 2048 block. Merge similar tiles to unlock powerful throws, unleash chain reactions, and reach higher numbers. Strategy and precision are your allies in this addictive puzzle adventure. Test your mental agility and challenge your strategic skills as you work towards the ultimate merger. Can you achieve the legendary 2048 merge throw? Dive into the world of numbers and throws in 2048 Merge Thrower!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/hqr1yelrev55pkglaiz7kj9qc6cc2cfo/",
        "category": "Arcade",
        "tags": "Arcade, Matching, Math, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/hqr1yelrev55pkglaiz7kj9qc6cc2cfo/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "49215",
        "title": "Cube Adventure",
        "description": "Cube Adventure is a great adventure game! Cross the tracks, avoid enemies and avoid getting caught in traps! You have to get the key, open the doors and level up! With the gold you earn, you can buy new skins and strengthen yourself!",
        "instructions": "W A S D or Arrow Keys Movement If you enter the game from mobile you can use the touch controls ",
        "url": "https://html5.gamemonetize.com/59h2nlk7e6vyixaw9h1voyunqdlvf1vy/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Action, Adventure, Pixel, Platform",
        "thumb": "https://img.gamemonetize.com/59h2nlk7e6vyixaw9h1voyunqdlvf1vy/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "49974",
        "title": "Chicken Escape   2 Player",
        "description": "Have you ever caught runaway chickens before? You must catch all the chickens. To catch the runaway chickens, you need to act fast. Farmers are competing. The red and blue farmers must win the race. Be any farmer and win the race. Play with your friend and collect the chickens as quickly and early as possible. You must catch all the runaway chickens. The one who collects 10 chickens the fastest wins.",
        "instructions": " Use the WASD keys and Arrow keys to move The fastest to collect 10 chickens wins Collect all the chickens in 120 seconds ",
        "url": "https://html5.gamemonetize.com/cvs7byr3g057da3803cqt5y1ugo478i1/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Animal, Arcade, Chicken, Mobile",
        "thumb": "https://img.gamemonetize.com/cvs7byr3g057da3803cqt5y1ugo478i1/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49871",
        "title": "Writer Race",
        "description": "Introducing Writer Race &ndash; a thrilling wordplay adventure! In this game, youll step into the shoes of a swift scribe, dashing through literary landscapes. Your mission? Rewrite the narrative! With only 80 words at your disposal, craft a tale that captivates, amuses, or astounds. But beware, the clock is ticking! Challenge friends or AI opponents, and see who can weave the most compelling story in record time. Writer Race is your ticket to literary glory. Website Developer <a href='https://www.vitalitygames.com'>https://www.vitalitygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/tksexmikt15imsq5thkegm6mep4sbj9m/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, Racing, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/tksexmikt15imsq5thkegm6mep4sbj9m/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49907",
        "title": "Air Strike World War",
        "description": "Master the skies in Air Strike, a World War I aerial combat game. Become the ace of the Air Dogs squadron! Air Strike catapults you into the intense and perilous world of World War I aviation. As a pilot in the renowned Air Dogs squadron, youll experience the adrenaline-pumping thrill of aerial combat.",
        "instructions": "Touch Click the screen to fly The plane shots automatically Avoid the enemies and destroy them to score ",
        "url": "https://html5.gamemonetize.com/1zhiyiix4gi4tw8k9ypwauwm8ig2z8t8/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Aircraft, airplane, Pixel, Plane, War",
        "thumb": "https://img.gamemonetize.com/1zhiyiix4gi4tw8k9ypwauwm8ig2z8t8/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "49214",
        "title": "Fruit Slice Master",
        "description": "Get ready to unleash your slicing skills in the ultimate fruity frenzy! Fruit Slice Frenzy is a captivating and addictive slicing game that will test your reflexes, precision, and strategic thinking. With its vibrant visuals, satisfying slicing mechanics, and multiple game modes, its a juicy adventure you wont want to miss! Fruit Slice is a Fantastic Addicted game where players swipe their fingers across the screen to slice fruit that is thrown into the air. The goal of the game is to slice as much fruit as possible without slicing any bombs. If a bomb is sliced, the game is over.",
        "instructions": "Step into the world of Fruit Slice Frenzy where a variety of delicious fruits are airborne waiting for your expert slicing touch Swipe your finger across the screen to slice through fruits with precision and watch as they burst into a splash of juicy ",
        "url": "https://html5.gamemonetize.com/akowpo9odtvh3v9gbsw6lakrdr9xmkfq/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Adventure, Best Games, cut, Fruit, Fruits, H5, HTML5, Ninja",
        "thumb": "https://img.gamemonetize.com/akowpo9odtvh3v9gbsw6lakrdr9xmkfq/512x384.jpg",
        "width": "400",
        "height": "700"
    },
    {
        "id": "49947",
        "title": "Ring Winner",
        "description": "Ring Winner is an electrifying Unity-based gaming experience that combines the thrill of competition with strategic gameplay. In this immersive adventure, players step into the shoes of a skilled ringmaster, tasked with mastering a series of challenging circus acts. Show off your dexterity as you juggle, balance, and perform gravity-defying stunts. With stunning graphics and intuitive controls, Ring Winner offers a captivating journey through the circus world. Can you become the ultimate champion of the big top? Step into the spotlight and find out in this exciting Unity-scripted spectacle!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/i4nxpmkjyu5xeyfylh2zpfjnhi71neq3/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/i4nxpmkjyu5xeyfylh2zpfjnhi71neq3/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49886",
        "title": "Toilet Monster Evolution",
        "description": "In this gripping Monster Evolution, your ultimate objective is to defeat and merge monsters lurking in every corner. You will face a series of thrilling obstacles that will test your mobility and strategic thinking. They will launch attacks from all directions, their spine-chilling cries reverberating through the atmosphere. Its a fight for survival, and you are the sole individual capable of enduring it.Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "Use the mouse or touch to control the player",
        "url": "https://html5.gamemonetize.com/plobtg9uk627hqijunt3sdchtbpqa3qv/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Action, Adventure, Arcade, Best Games, Casual, Cool, endless, Games, HTML5, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/plobtg9uk627hqijunt3sdchtbpqa3qv/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49191",
        "title": "Space Quoit 2048",
        "description": "Space Quoit 2048 offers a thrilling twist on the classic 2048 game. Each disk is adorned with numbers, and your mission is to skillfully maneuver matching-numbered disks into epic collisions, forging them into new and higher numbers. Embark on this cosmic journey, bursting disks in spectacular fashion, and conquer the challenges of each level!",
        "instructions": "Tap to play",
        "url": "https://html5.gamemonetize.com/3z3tne4pget0610nycrv3syol6kkvhds/",
        "category": "Arcade",
        "tags": "3D, Boy, Boys, Fun, Funny, Kid, Skill, Space",
        "thumb": "https://img.gamemonetize.com/3z3tne4pget0610nycrv3syol6kkvhds/512x384.jpg",
        "width": "450",
        "height": "800"
    },
    {
        "id": "49815",
        "title": "Pumpkin Wheel",
        "description": "Pumpkin Wheel is a funny game where you must control a big rolling Pumpkin through 30 levels! Whit its original and colorful graphics Pumpkin Wheel will be a pleasant time-killer, simple but addicting. So accelerate, break and have a perfect control of your Pumpkin in order to complete all levels! Enjoy this game in this magic halloweens season; and follow the stars!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/mnjlmblbpf7icfsxb5t74u4yf1sxtyok/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Halloween, HTML, Mobile, Puzzle",
        "thumb": "https://img.gamemonetize.com/mnjlmblbpf7icfsxb5t74u4yf1sxtyok/512x384.jpg",
        "width": "1024",
        "height": "600"
    },
    {
        "id": "49565",
        "title": "My Halloween Park",
        "description": "Are you ready to run your own Halloween park? My Halloween Park is a 3D simulation game that lets you create a spooky and fun amusement park for visitors. You can collect ghosts and load them into the haunted house, where visitors will pay you to enter and experience the horror. You can use the money to unlock and upgrade more entertainment facilities and play areas, such as pumpkin patches, candy shops, and ghost trains. You can also increase your ghost-carrying capacity and gardening seed capacity to make your park more attractive. My Halloween Park is a game that will immerse you in the spirit of Halloween. Have fun",
        "instructions": "Drag and swipe to move your character",
        "url": "https://html5.gamemonetize.com/9v396wqjxfz3xardivmw3csgy4nqxst8/",
        "category": "Arcade",
        "tags": "Adventure, Boys, Girl, Halloween, Kids, Management",
        "thumb": "https://img.gamemonetize.com/9v396wqjxfz3xardivmw3csgy4nqxst8/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "49682",
        "title": "Halloween Zombie Zone Clear",
        "description": "Get ready for spine-chilling action in Halloween Zombie Zone Clear! As darkness falls, hordes of the undead roam, and its up to you to clear them out. Armed with an arsenal of powerful weapons, navigate through haunted streets and eerie graveyards. With each wave, the challenge intensifies. Unleash special abilities, strategically deploy traps, and team up with friends for cooperative mayhem. Can you survive the night and save the town from this zombie apocalypse? Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/8sbiqqsr1xghpt3couxuahj8y5bnu46u/",
        "category": "Arcade",
        "tags": "1 Player, Halloween, Unity3D, WebGL, Zombie",
        "thumb": "https://img.gamemonetize.com/8sbiqqsr1xghpt3couxuahj8y5bnu46u/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49782",
        "title": "Ambulance Rush",
        "description": "Get ready for a high-speed medical adventure in Ambulance Rush! Race against time as a skilled paramedic, navigating through traffic-choked streets to save lives. With precise controls and realistic physics, navigate your ambulance through dynamic urban environments. Respond to emergencies, make split-second decisions, and use life-saving equipment to stabilize patients. Earn points for swift, safe arrivals and unlock upgrades to enhance your life-saving capabilities. Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/0jr0z7hx8o69vevzfitvlaorengtswdz/",
        "category": "Arcade",
        "tags": "Arcade, Car, Doctor, Driving, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/0jr0z7hx8o69vevzfitvlaorengtswdz/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "45957",
        "title": "Classic Snake",
        "description": "Do you love Snake Games? Welcome to classic Snake where you have to eat small dots to become bigger. Can you get the biggest snake on the leaderboard? Have fun!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/6nvgvas8e8tg6ln2sxvv1lvx3qgq1eim/",
        "category": "Arcade",
        "tags": "Snake",
        "thumb": "https://img.gamemonetize.com/6nvgvas8e8tg6ln2sxvv1lvx3qgq1eim/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "49613",
        "title": "Ban Ban Parkour",
        "description": "Have you ever run to the door in the dark like this before? Run to the door with your friend in the dark one by one. Collect the toys you need to gather. Collect the toys to open the door. We need all the toys. You must race against time in the dark to survive. Reach the door before time runs out. Otherwise, you will die in the dark. Or you might get lost in the dark.",
        "instructions": " Use WASD Keys to move and jump Collect the Bowling Toy first and then the remote control Toy in order Both mobile and desktop playability ",
        "url": "https://html5.gamemonetize.com/gswu7y7skc3a3x1hyy7njlunp85rfoov/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, Adventure, Alien, Animal, Arcade",
        "thumb": "https://img.gamemonetize.com/gswu7y7skc3a3x1hyy7njlunp85rfoov/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "39750",
        "title": "Halloween Jump",
        "description": "Enjoy the fun of Halloween with &ldquo;Jump Halloween online game. In a scary environment the little pumpkin is trying to jump through all the obstacles on its way. Help the little pumpkin to go through the scary environment. The game is simple but very exciting to play.",
        "instructions": "Control Desktop Click the left buttons of the mouse to make the character jump Mobile Tap on the mobile screen to make the character jump ",
        "url": "https://html5.gamemonetize.com/n1ddsmtfecyghgnxp9z2pcya7vdu5vrx/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Halloween",
        "thumb": "https://img.gamemonetize.com/n1ddsmtfecyghgnxp9z2pcya7vdu5vrx/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "49598",
        "title": " Halloween Moster Vs Zombies",
        "description": "Welcome to the exciting and scary world of Halloween Monster Vs Zombies! In this addictive and fun game, you take on the role of a brave monster in search of the most delicious Halloween candies. However, theres a problem: the cemetery is full of hungry zombies, and theyll do anything to stop you from getting your favorite candies!",
        "instructions": "Mouse click or tap on the mobile screen Use mouse click or tap on the screen to control your monsters movement Tap to jump over obstacles and avoid zombies while collecting the tasty candies",
        "url": "https://html5.gamemonetize.com/vuu0litxi4kyn4rr0wew8berqwbdy5co/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Halloween",
        "thumb": "https://img.gamemonetize.com/vuu0litxi4kyn4rr0wew8berqwbdy5co/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "49277",
        "title": "Ninja Ghost",
        "description": "Ninja Ghost immerses you in the world of a ninja on a mission to confront notorious bandit leaders. Prepare to be captivated by the smooth ninja controls, including Slow Motion moves, and the dynamic gameplay. Your primary objective is to take down these formidable bosses, and whether you choose to eliminate their entire team or opt for a more peaceful approach is entirely up to you. In this game, youll step into the shoes of an unparalleled, elusive, incredibly agile, and mighty master of melee combat. Website Developer <a href='https://www.game-plays.com'>https://www.game-plays.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/mumwz453w0wt583is22yzet2fhwla4je/",
        "category": "Arcade",
        "tags": "Android, HTML5, iPad, iPhone, Level, Mentolatux, Mobile, Ninja, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/mumwz453w0wt583is22yzet2fhwla4je/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49524",
        "title": "Duo Nether",
        "description": "Things are getting even tougher in the second part of the series, so are you up for this adventure? The adventure is getting increasingly difficult. There are monsters and traps everywhere. Tell your friend right away and join this adventure. Remember, youre in for an even more challenging adventure. Steve and Alex are now stronger with their swords. You must be high off the ground to throw the sword. Jump-Throw the sword and kill all the enemies. Collect all the white bone dust stones. Open the chests and both of you reach the door.",
        "instructions": " Played with WASD Arrow Keys Mobile touch control is available To throw the sword use the Q and P keys ",
        "url": "https://html5.gamemonetize.com/ge1c2bm02dldn7ted5bibt7q720kucn3/",
        "category": "Arcade",
        "tags": "1 Player, 2 Player, 2 Player Games, 2D, Action, Adventure, Alien, Arcade, Battle, Minecraft, Pixel",
        "thumb": "https://img.gamemonetize.com/ge1c2bm02dldn7ted5bibt7q720kucn3/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49407",
        "title": "Uno Multiplayer",
        "description": "Uno Multiplayer is an exhilarating digital adaptation of the classic card game that brings friends and family together for hours of fun. Challenge your strategic thinking and card-playing skills as you compete against players from around the world. Whether youre looking for a quick match or an epic showdown, Uno Multiplayer offers various modes and customizable rules to suit your style. With vibrant visuals and seamless online play, its the perfect way to connect, strategize, and enjoy the timeless Uno experience with players across the globe. Website Developer <a href='https://www.coolcrazygames.com/'>https://www.coolcrazygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ibja5jflqdvaolwh7frjlvjxcut2b6ev/",
        "category": "Arcade",
        "tags": "Arcade, Card, Classic, Multiplayer, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/ibja5jflqdvaolwh7frjlvjxcut2b6ev/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "49512",
        "title": "Twerk Rush",
        "description": "You must run and gain weight in this entertaining game to fight for the twerk champion! Only the fearless and confident players go for it! Pay attention and march on the treadmill! Lets show everyone how performing this kind of popular dance can be enjoyable!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/n2i6wkl05emm6mg3i589nnxoaa9uivwx/",
        "category": "Arcade",
        "tags": "3D, Arcade, Casual, HTML5, Online",
        "thumb": "https://img.gamemonetize.com/n2i6wkl05emm6mg3i589nnxoaa9uivwx/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49523",
        "title": "Grimace Shake Jump",
        "description": "Welcome to Grimace Shake Jump Choose your Favorite Character normal or santa grimace and jump to get the highest score. Collect purple shake and Avoid the enemies. good luck!",
        "instructions": "Slide left and right to fly",
        "url": "https://html5.gamemonetize.com/6idmk00oe4noat3yz62ancc6llnogptc/",
        "category": "Arcade",
        "tags": "Grimace, Grimace Shake",
        "thumb": "https://img.gamemonetize.com/6idmk00oe4noat3yz62ancc6llnogptc/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "49460",
        "title": "Skibidi Defender",
        "description": "Skibidi Defender is an action-packed unity script game that combines article rewriting fun with thrilling gameplay! In this unique twist on tower defense, youll rewrite articles to defend your kingdom from invading monsters. Unleash your creativity to craft powerful spells and strategically rewrite the narrative to outwit your foes. With stunning visuals and engaging storytelling, Skibidi Defender offers an immersive experience like no other. Can you defend your realm by rewriting destiny? Challenge your skills in this captivating adventure today! Website Developer <a href='https://www.brightygames.com/'>https://www.brightygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/0h75k53x199vbiufq4mcxrmwk8htbje4/",
        "category": "Arcade",
        "tags": "Arcade, Defense, Skibidi, Skibidi Toilet, Tower Defense, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/0h75k53x199vbiufq4mcxrmwk8htbje4/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "49370",
        "title": "Pop the Balloons Game",
        "description": "Use the cannon to aim and shoot to pop the balloons. This game has two parts. In the first part you are training to use the cannon and youll need to pop a series of randomly placed balloons. In the second part of the game youll also use the cannon, but youll be shooting hot air balloons instead of regular balloons. The second part of the game has unlimited cannon balls. If more than 5 hot air balloons get past you its game over.",
        "instructions": "Touch the game screen to aim and shoot with the cannon Touch the game screen longer to gain more power Shoot as many balloons as you can If you are on a desktop aim and shoot using the mouse Hold down the left mouse to gain more power in your shots ",
        "url": "https://html5.gamemonetize.com/5s27e3yuzg6ibsyyyj1ynk8744isehu2/",
        "category": "Arcade",
        "tags": "Mobile, Shooting",
        "thumb": "https://img.gamemonetize.com/5s27e3yuzg6ibsyyyj1ynk8744isehu2/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49469",
        "title": "Jumping Zombies",
        "description": "Jumping Zombies is an action-packed game where players must navigate through platforms and shoot at hordes of relentless zombies. The objective of the game is to survive as long as possible while eliminating as many zombies as you can. As a player, you will control a character who can jump from platform to platform. Your character is equipped with powerful weapons to shoot down the approaching zombies. These zombies will constantly come towards you, threatening to overwhelm you if youre not quick enough. Website Developer <a href='https://www.g8-games.com/'>https://www.g8-games.com/</a>",
        "instructions": "Tap on the game screen buttons or use the arrow keys to play this game ",
        "url": "https://html5.gamemonetize.com/zn3hokr5a09fr1fyt43hv2uql233c2fb/",
        "category": "Arcade",
        "tags": "Jumping, Platform, Shooting, Zombie",
        "thumb": "https://img.gamemonetize.com/zn3hokr5a09fr1fyt43hv2uql233c2fb/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "49376",
        "title": "Number Merging",
        "description": "Number Merging is a captivating puzzle game that challenges your math skills and strategic thinking. In this thrilling adventure, youll combine matching numbers to create larger ones, all while racing against the clock. With progressively challenging levels and mind-boggling combinations, Number Merging will keep you on the edge of your seat. Can you reach the ultimate number and become the merging master? Dive into this addictive gameplay experience and test your numerical prowess today!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/yutt95fb86hp25arljr02769y12jyrve/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Clicker, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/yutt95fb86hp25arljr02769y12jyrve/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49098",
        "title": "Tank Mazes",
        "description": "Our intelligence learned about the enemys counter offensive. The general ordered you to defend the base at all costs! At your disposal are several modifications of our best tank, as well as the latest support technologies, such as: point bombing, energy shield, time stop and others. Our main forces have already been pulled together in other directions, so you, as the best tank commander, are tasked with defending the base alone, but you can take a partner with you and face the approaching enemies together.",
        "instructions": "The first player is moving with the W A S D keys or the green buttons on the screen shooting with a spacebar The second player is moving with the arrow keys or blue buttons on the screen shooting with the num 0 key ",
        "url": "https://html5.gamemonetize.com/u7ifgv57bzjgdf04c9py88u1msn0a6fk/",
        "category": "Arcade",
        "tags": "Arcade, Battle, Battlegrounds, Classic, Levels, Shoot, Shooting, Tank, Tanks, War",
        "thumb": "https://img.gamemonetize.com/u7ifgv57bzjgdf04c9py88u1msn0a6fk/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49378",
        "title": "Word Picture Guesser",
        "description": "Word Picture Guesser is a brain-teasing word game that pushes your vocabulary and deduction skills to the limit. Immerse yourself in a world of visual riddles and cryptic imagery, where you must decipher the hidden words. Each level presents a unique challenge, blending art and language in a thrilling guessing game. Can you decode the clues and unveil the words concealed within the pictures? Prepare for a captivating journey of linguistic discovery as you tackle the enigmatic puzzles of Word Picture Guesser!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/7g01u7rx3gqhfgicvvsnd1pvl3rfhgti/",
        "category": "Arcade",
        "tags": "Arcade, Guessing, Unity3D, WebGL, Word",
        "thumb": "https://img.gamemonetize.com/7g01u7rx3gqhfgicvvsnd1pvl3rfhgti/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "49443",
        "title": "Zombie Survivor",
        "description": "Zombie Survivor immerses you in the heart-pounding world of a post-apocalyptic zombie outbreak. The game offers intense action as you navigate through increasingly challenging levels, each infested with swarms of the undead. Your characters movements are smooth and responsive, making it easy to dodge incoming threats and line up precise shots. As you progress, youll face a variety of zombie types, each with its own unique abilities and challenges. Its a test of your survival skills and sharpshooting accuracy.",
        "instructions": "Controls on PC Use WASD keys to move the character Use the mouse to aim and shoot Controls on a mobile device Tap the on-screen buttons ",
        "url": "https://html5.gamemonetize.com/74graul7w2wrhnb7m18nshiacptvyp6m/",
        "category": "Arcade",
        "tags": "2D, Pixel, Shooter, Shooting, survival, Zombie",
        "thumb": "https://img.gamemonetize.com/74graul7w2wrhnb7m18nshiacptvyp6m/512x384.jpg",
        "width": "1980",
        "height": "1080"
    },
    {
        "id": "49416",
        "title": "Archery Of The King",
        "description": "Stickman Archery Master - Archer Puzzle Warrior Be an Archer Hero (Arc-hero) and join the battle. Fight enemies, shoot em up and become an archer legend. In an Upsiverse, where everything is illogical, your archer hero - Stickman must survive in a chaos world - ruled by stick enemy, zombies and shadow bosses. All you have is a classic bow, and you need to train yourself to be master with that weapon. But more levels you passed, more legend weapons you could find, and more mystical arrows you could discover on your way.",
        "instructions": "- Drag and Release the Bow to aim and shoot arrow - Use boosters to boost up your flow - Collect rewards arrows bow parts and go gamesmunch com - Upgrade weapons and enjoy the show ",
        "url": "https://html5.gamemonetize.com/4s4o3psr9a6rgx1hwiwinaimpdbnrd8r/",
        "category": "Arcade",
        "tags": "2D, Action, Arcade, King, Stickman",
        "thumb": "https://img.gamemonetize.com/4s4o3psr9a6rgx1hwiwinaimpdbnrd8r/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "49313",
        "title": "Grimace World",
        "description": "Do you love Grimace Shake? Well! you are in the right place to play a Grimace game. Tap or click to jump to collect the purple Shake to unlock the house. Once you collect all shakes, a door will appear with the yellow clown waiting for you. Go to that door to unlock the next level and be careful with fire traps. Have fun and explore tons of amazing and challenging levels.",
        "instructions": "Tap or mouse click to jump",
        "url": "https://html5.gamemonetize.com/ubb2t9um7ra7rv1cde04l69r3edh1tnq/",
        "category": "Arcade",
        "tags": "Grimace, Grimace Shake",
        "thumb": "https://img.gamemonetize.com/ubb2t9um7ra7rv1cde04l69r3edh1tnq/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49344",
        "title": "Words Fall",
        "description": "Words Fall is an exhilarating word puzzle game that challenges your vocabulary skills! As letters rain from the sky, swiftly create words to clear them before they stack up. With each level, the pace quickens, and your word-building abilities are put to the test. Unlock power-ups and bonuses to gain an edge, and compete with friends for the highest score on the global leaderboard. Immerse yourself in this addictive wordplay experience, combining speed and strategy. Words Fall offers endless word-building fun for players of all ages. Can you rise to the challenge and conquer the downpour of letters?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/lk1oaf8p0rndcd9v3c4w50x92zmy7fe6/",
        "category": "Arcade",
        "tags": "Arcade, Typing, Unity3D, WebGL, Word",
        "thumb": "https://img.gamemonetize.com/lk1oaf8p0rndcd9v3c4w50x92zmy7fe6/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "49160",
        "title": "Geometry Dash Skibidi Toilet",
        "description": "Geometry Dash Skibidi Toilet is a captivating rhythm-based platformer. Gamers maneuver through a realm filled with geometric shapes, requiring impeccable timing and swift reflexes to conquer obstacles and spikes. It boasts vivid stages, rhythmic tunes, and a gradually escalating challenge. Website Developer <a href='https://www.kizi10.org/'>https://www.kizi10.org/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/1pdxy0j95mvsrtonv49i7xi4doevxhaq/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Android, dash, Geometry, HTML5, iPad, Mentolatux, Mobile, Skibidi, Skibidi Toilet, Skill, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/1pdxy0j95mvsrtonv49i7xi4doevxhaq/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49375",
        "title": "Minecraft World Adenture",
        "description": "Join us on an extraordinary journey in the pixelated realm of Minecraft World Adventure! This arcade game is not just a game; its a thrilling odyssey suitable for adventurers of all ages. Picture this: you, as the iconic Steve from Minecraft, find yourself standing on a spinning platform lost in the vastness of the Minecraft universe. Your mission? To find your way home, navigating through a whirlwind of challenges and obstacles.With every jump, youll defy gravity, avoiding pitfalls and dodging obstacles that come your way. Its a pulse-pounding adventure where your quick reflexes and strategic jumps are the keys to survival",
        "instructions": "Mouse or SPACE to jump ",
        "url": "https://html5.gamemonetize.com/7luhu49wunq8s1wgvea8e0s2vvu3uozl/",
        "category": "Arcade",
        "tags": "Arcade, Avoid, HTML5, Hypercasual, jump, Kids, Minecraft, Obstacle, Platform, Puzzle, Skill",
        "thumb": "https://img.gamemonetize.com/7luhu49wunq8s1wgvea8e0s2vvu3uozl/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "49317",
        "title": "ZigZag Ski",
        "description": "Introducing ZigZag Ski, a thrilling winter sports adventure for all ages! In this heart-pounding game, players carve their path down snow-covered slopes, zigzagging through challenging obstacles and collecting power-ups for epic boosts. With stunning graphics and intuitive controls, youll feel the rush of the slopes from the comfort of your device. Race against the clock, unlock new levels, and compete for the top spot on the global leaderboard. Whether youre a skiing pro or a beginner, ZigZag Ski offers endless fun and excitement. Strap on your virtual skis and conquer the mountains today!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/hv3irczhridyz3g33ht2y033td300lmy/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, Clicker, Snow, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/hv3irczhridyz3g33ht2y033td300lmy/512x384.jpg",
        "width": "400",
        "height": "600"
    },
    {
        "id": "49261",
        "title": "Banana Kong Adventure",
        "description": "Banana Kong Adventure is a 2D game that lets you go on an adventure with the monkey king! You will follow Kong through various wonderful worlds, encountering fun traps and monsters! Can you help Kong defeat his enemies with his stick, and jump higher with his skills? Can you reach the finish line in a limited time? This game has multiple levels and difficulties, each with different challenges and rewards! Join Banana Kong Adventure and experience a fun and exciting adventure!",
        "instructions": "Use WASD or arrows to control the directions",
        "url": "https://html5.gamemonetize.com/fycx4iipitqmo3gmedxzunvl9aynk8mf/",
        "category": "Arcade",
        "tags": "Animal, Anime, Avoid, Casual, Collecting, jump, Platform, run",
        "thumb": "https://img.gamemonetize.com/fycx4iipitqmo3gmedxzunvl9aynk8mf/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "49229",
        "title": "Bridge.io Liquid Tuxedo",
        "description": "Collect water blue from the arena map from the ground and then build your bridge water. Your opponents try to collect faster the liquid and win the match. Website Developer <a href='https://www.game-plays.com/'>https://www.game-plays.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/e26j4bwtwljnd36h0iqw6ihktppwqhjo/",
        "category": "Arcade",
        "tags": "Android, Arcade, HTML5, iPad, iPhone, Mentolatux, Mobile, run, running",
        "thumb": "https://img.gamemonetize.com/e26j4bwtwljnd36h0iqw6ihktppwqhjo/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49057",
        "title": "Space Adventure Pinball",
        "description": "Very fun pinball game that takes place in space! Hit your ball using the paddles to keep it in play for as long as possible. Generate cool power ups to increase your points.",
        "instructions": "Follow the in the game",
        "url": "https://html5.gamemonetize.com/ez1g65mh3pjkk3569edy22bi708sevsj/",
        "category": "Arcade",
        "tags": "1 Player, Alien, Arcade, Game, Games, HTML, HTML5, Pinball, Space, Spaceship",
        "thumb": "https://img.gamemonetize.com/ez1g65mh3pjkk3569edy22bi708sevsj/512x384.jpg",
        "width": "768",
        "height": "1280"
    },
    {
        "id": "49251",
        "title": "Word Guesser",
        "description": "Introducing Word Guesser, a thrilling word game that will put your vocabulary to the test! In this addictive challenge, players are presented with a series of word puzzles to solve. Your mission: decipher the hidden word within a limited number of attempts. With a diverse range of categories and difficulty levels, Word Guesser guarantees hours of brain-teasing fun. Sharpen your linguistic skills, enhance your word knowledge, and climb the leaderboard as you become the ultimate Word Guesser champion! Website Developer <a href='https://www.coolcrazygames.com/'>https://www.coolcrazygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/b68bzsl9ujjs4lthbiwa4rg6dke7jg5y/",
        "category": "Arcade",
        "tags": "Arcade, Guessing, Unity3D, WebGL, Word",
        "thumb": "https://img.gamemonetize.com/b68bzsl9ujjs4lthbiwa4rg6dke7jg5y/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "49227",
        "title": "My Perfect Hotel HTML5",
        "description": "Have you ever imagined the thrill of owning your very own hotel? Embark on an exciting journey from the very foundation in this enjoyable and high-speed time-management game. Your ultimate goal: construct an extensive lodging empire that showcases your unwavering commitment to the art of hospitality. As a hotel manager, showcase your talents, make prudent investments in both your staff and property enhancements, and exert every ounce of effort to ascend to the pinnacle of the hospitality industry. Website Developer <a href='https://www.crazygamesonline.com/'>https://www.crazygamesonline.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/d8lg0h02680rgd2eevhgir54oshr5cgz/",
        "category": "Arcade",
        "tags": "1 Player, Android, Casual, HTML5, Hypercasual, iPad, iPhone, Management, Mentolatux, Mobile, Simulation, Simulator",
        "thumb": "https://img.gamemonetize.com/d8lg0h02680rgd2eevhgir54oshr5cgz/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49223",
        "title": "The Life Run",
        "description": "The Life Run is an exhilarating adventure where players step into the shoes of a determined protagonist on a mission to save humanity. In a dystopian world plagued by a deadly virus, you must race against time, overcoming obstacles, and making crucial decisions. Your choices impact the fate of the remaining survivors. With stunning visuals, immersive storytelling, and heart-pounding action, The Life Run offers a gripping blend of strategy and adrenaline. Will you secure the future or succumb to the chaos? Website Developer <a href='https://www.coolcrazygames.com/'>https://www.coolcrazygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/f6cjgfvtj2j01s44qjgjqcyvj8t8bdlz/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, Baby, Baby Games, running, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/f6cjgfvtj2j01s44qjgjqcyvj8t8bdlz/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "49219",
        "title": "Grimace Monster Dop Story",
        "description": "Do you have a strong passion for puzzles? Are you seeking to push your limits by taking on more intricate puzzle challenges? Your innate creativity and clever problem-solving skills empower you to navigate through complex everyday scenarios filled with unexpected twists and turns. Your task involves utilizing an eraser to manipulate and eliminate the elements that pose obstacles. Website Developer <a href='https://www.crazygamesonline.com/'>https://www.crazygamesonline.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/y3qiuezlo2uuyznjoug85rwcnpvheobc/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Android, Grimace, Grimace Shake, HTML5, Kid, Kids, Mentolatux, Mobile, Puzzle, Skill",
        "thumb": "https://img.gamemonetize.com/y3qiuezlo2uuyznjoug85rwcnpvheobc/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49147",
        "title": "Color Race 3D",
        "description": "Welcome to the Color Race 3D! Colorful game that will keep you on your toes all the very end! Grow, Fight, and Win! Collect stickmen of your color to win levels and clash against the Stickman Boss! GROW THE BIGGEST STICKMAN The largest stickman wins, the smallest lose. Run, grow and absorb other stickmen unik the finish line. Move let and right on the run and collect as many stickmen and coins as possible.",
        "instructions": "Mouse or tap to play",
        "url": "https://html5.gamemonetize.com/uh88hlz3d4j7kktr30seyaf3vxcgh8xm/",
        "category": "Arcade",
        "tags": "3D, Arcade, running, Stickman",
        "thumb": "https://img.gamemonetize.com/uh88hlz3d4j7kktr30seyaf3vxcgh8xm/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "49159",
        "title": "Finger Heart Monster Refil",
        "description": "In Finger Heart: Monster Refill, your task is to creatively combine your finger with cute monsters to craft the perfect heart shape. No special skills or expertise are required; all you need is your imagination, intuition, and a sprinkle of luck. The gameplay ranges from easy to challenging, occasionally taking a whimsical turn, but it consistently delivers enjoyment and gratification. Heres how to play: choose the correct shape or draw the right line, then drag the shape into the designated space and adjust the monster to fit. Keep an eye on the countdown timer. Website Developer <a href='https://www.kizi10.org/'>https://www.kizi10.org/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ke60kej0ys0ynira22m3uo0a4qrzszfn/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Android, Cartoon, Clicker, Girls, HTML5, iPad, iPhone, Kids, Mentolatux, Mobile",
        "thumb": "https://img.gamemonetize.com/ke60kej0ys0ynira22m3uo0a4qrzszfn/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49162",
        "title": "DIY Makeover ASMR Mask 3D",
        "description": "If youre blessed with healthy skin, thats great! But if not, a transformation is in order. Building a soothing ASMR skincare routine at home is crucial. Understanding which makeup and skincare ingredients suit your skin type is essential. Try DIY Makeover: ASMR Mask 3D, where you can mimic a salon experience using natural ingredients like avocado, coconut, cucumber, and more to craft a mesmerizing 3D face mask. Intriguing, isnt it? Website Developer <a href='https://www.crazygamesonline.com/'>https://www.crazygamesonline.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/rqhmh5wmt61p9j2t34yxfrl1u5am4ufm/",
        "category": "Arcade",
        "tags": "3D, Android, Girls, HTML5, iPad, iPhone, Makeover, Mentolatux, Mobile, Skill, unity",
        "thumb": "https://img.gamemonetize.com/rqhmh5wmt61p9j2t34yxfrl1u5am4ufm/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48895",
        "title": "Pixel Survivor 2D",
        "description": "Experience Pixel Survivor 2D, an action-packed 2D game where you navigate a pixelated world, engage pixel enemies, and upgrade your weapon for survival. Move skillfully through the dynamic map, taking down foes with precise shooting. Collect power-ups to enhance your weaponry and relish the nostalgic charm of retro pixel art. Pixel Survivor 2D offers addictive gameplay and promises the thrill of survival through pixel-perfect battles. Website Developer <a href='https://www.crazygamesonline.com/'>https://www.crazygamesonline.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/k803valqfz5j8j3qungk3np3xjkdnndt/",
        "category": "Arcade",
        "tags": "2D, HTML5, iPad, iPhone, Mentolatux, Mobile, Pixel, Shoot, Shooting",
        "thumb": "https://img.gamemonetize.com/k803valqfz5j8j3qungk3np3xjkdnndt/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49133",
        "title": "Welding Master",
        "description": "Become the ultimate Welding Master in this thrilling game! Dive into the world of metalwork as you tackle intricate welding challenges. Show off your skills by fusing metals with precision and creativity. From crafting ornate sculptures to fixing crucial structures, every task pushes your welding prowess to the limit. Explore a variety of realistic environments and unlock new welding techniques. With stunning visuals and immersive gameplay, Welding Master offers an authentic welding experience like never before. Are you up for the challenge? Put on your welding helmet and let the sparks fly in this epic welding adventure!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/cmey00bgnmjlm121cjjmb4hpm6xi548f/",
        "category": "Arcade",
        "tags": "Arcade, Simulation, Simulator, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/cmey00bgnmjlm121cjjmb4hpm6xi548f/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "48997",
        "title": "Hole Fire",
        "description": "Black holes can collect weapons. For a big weapon, youll need a big black hole. Collect big guns, bombs and bullets. You will have to fight the enemy with all weapons You collect weapons with the help of a black hole! Can you beat them with a black hole?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/wn43hl3qi82qjrlkmng5nmngla08kexe/",
        "category": "Arcade",
        "tags": "3D, Arcade, Casual, HTML5, Online",
        "thumb": "https://img.gamemonetize.com/wn43hl3qi82qjrlkmng5nmngla08kexe/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47789",
        "title": "Draw Car 3D",
        "description": "Here is a drawing puzzle and a car-racing arcade game. It is managed for you to draw a body on the wheels and defeat your AI enemy at each level. When you colleect enough coins, you can buy more skins in the shop.",
        "instructions": "Drag and swipe to draw your cars body You can change it instantly at each level",
        "url": "https://html5.gamemonetize.com/t1r0cmlexylcv82l04v4fb19zuocayi1/",
        "category": "Arcade",
        "tags": "3D, Brain, Car, Drawing, HTML5, Mobile, Platform, Puzzle, Racing",
        "thumb": "https://img.gamemonetize.com/t1r0cmlexylcv82l04v4fb19zuocayi1/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "47562",
        "title": "Bomb Evolution",
        "description": "Bomb Evolution is an exhilarating cannon shooting arcade game that boasts vibrant 3D cartoon game art animation. On the mysterious and mist-shrouded island, you have the opportunity to strategically establish not one, but three main bases, bolstered by an additional rocket. Engage in an enthralling battle against a formidable opponent, both of you operating under identical circumstances. Your ultimate objective: obliterating all the enemys main bases positioned on the neighboring fog-laden island. May victory in this war be your prized accomplishment!",
        "instructions": "Swipe to shoot Release to launch bombs",
        "url": "https://html5.gamemonetize.com/61cmve3krp2rkpgoj66z0mcaxfw9cqt8/",
        "category": "Arcade",
        "tags": "3D, Arcade, Avoid, Bomb, Boy, Collecting, Girl, Kid, running",
        "thumb": "https://img.gamemonetize.com/61cmve3krp2rkpgoj66z0mcaxfw9cqt8/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "49112",
        "title": "Leader Follow",
        "description": "Embark on an epic adventure in our immersive game, where the dynamic Leader Follow script takes center stage. In this captivating virtual world, youll lead a group of intrepid heroes, each with their unique abilities, on a quest to save the realm. As the leader, youll strategize and navigate perilous challenges, while your AI-driven companions follow your every move, adapting to your decisions. With the power of Leader Follow, teamwork and camaraderie are essential for victory. Are you ready to lead and conquer?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/lnvgl3wwmdc7fv96gtuexib6iobvu619/",
        "category": "Arcade",
        "tags": "Arcade, Obstacle, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/lnvgl3wwmdc7fv96gtuexib6iobvu619/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "48844",
        "title": "Casstle Puzzle Fight",
        "description": "Welcome to Castle Enigma! Ready your brave soldiers and brace yourself for an extraordinary clash! Seize rival realms with the assistance of your valiant troops. The dragon is here to wreak havoc on the battlefield. Meanwhile, the wizard and archer are primed to target distant foes. Nevertheless, the challenge ahead is formidable, for the adversarys monarch staunchly guards his fortress!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/0gtg17gekbuugpnss5fpullp2famfaqr/",
        "category": "Arcade",
        "tags": "3D, Android, Arcade, HTML5, iPad, iPhone, Mentolatux, Mobile, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/0gtg17gekbuugpnss5fpullp2famfaqr/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49068",
        "title": "Bounce Run",
        "description": "This fun and addictive game relies on your mouse clicks. Your goal in the game is to make your character run forward at high speed, avoiding obstacles to reach the farthest distance possible. The farther you can go, the more achievements you will earn! Based on your achievements, you can unlock new appearances for your character. This adds a personalization and competitiveness element to the game, keeping you motivated. To achieve more success, youll need quick reflexes, timing skills, and keen observation.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/sa3k1y1gqynnk9d0opa9spgl82wsaant/",
        "category": "Arcade",
        "tags": "3D, 3D Games, Ball, Best, Best Games, Bounce, Casual, endless, Fun",
        "thumb": "https://img.gamemonetize.com/sa3k1y1gqynnk9d0opa9spgl82wsaant/512x384.jpg",
        "width": "1600",
        "height": "900"
    },
    {
        "id": "49051",
        "title": "Ancient Tower Defense",
        "description": "In Ancient Tower Defense, step into a world where cunning strategy meets the mysteries of the past. Defend against hordes of mythical creatures and armies with a unique blend of ancient technologies and mystical powers. Construct formidable towers, each infused with their own enchantments, as you journey through historically rich landscapes. Unlock legendary heroes, harness their abilities, and unravel the secrets of forgotten civilizations. Can you protect the past from the onslaught of darkness and emerge as the ultimate defender of history in this thrilling tower defense adventure?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/8as5wnz6kp48totjpdm7pzwg7kpg9zg6/",
        "category": "Arcade",
        "tags": "Arcade, Bow, Monster, Shooting, Sword, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/8as5wnz6kp48totjpdm7pzwg7kpg9zg6/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "48987",
        "title": "Farmers Island",
        "description": "Play the game as a farmer, start planting different crops, manage your own farm and restore the real planting process. Players can get gold coins in various ways, for example, by sowing, watering and waiting for the harvest to ripen. Various props are also available to allow you to harvest faster, and you can also hire a group of workers to quickly accumulate wealth and create your own farmers paradise.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ji6h5gdlr5qadt5il9tzbzphj9ed8fhm/",
        "category": "Arcade",
        "tags": "3D, Arcade, Casual, Farm, HTML5, Island, Online",
        "thumb": "https://img.gamemonetize.com/ji6h5gdlr5qadt5il9tzbzphj9ed8fhm/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48324",
        "title": "SafeSphere Abyss",
        "description": "Embark on a thrilling journey into the depths of the SafeSphere Abyss! This immersive game challenges your wits and reflexes as you navigate through treacherous terrain, avoiding obstacles and unlocking secrets. With stunning visuals and captivating soundscapes, delve into a world where danger and discovery await at every turn. Dive into the SafeSphere Abyss today and test your skills in an adventure that pushes your limits, all while uncovering the mysteries hidden within the abyss. Are you ready to conquer the depths?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/3ftjearh8uc47xogaskthhba5eqtdqzm/",
        "category": "Arcade",
        "tags": "Action, Adventure, Arcade, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/3ftjearh8uc47xogaskthhba5eqtdqzm/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "49000",
        "title": "Fat OR Thin",
        "description": "The Fat or Thin game is a fun, relaxing runner where you can help a cute furry bear lose extra weight after winter hibernation! There are more than 30 fascinating levels ahead of you, each of which you must pass the obstacle course and finish, not forgetting to watch your diet. Are you ready to take your will in your fist and completely give up burgers, pizza, and doughnuts, replacing them with healthier food?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ucv0bh73v900fke5o7viaxihiv27piz9/",
        "category": "Arcade",
        "tags": "3D, Arcade, Casual, HTML5, Online",
        "thumb": "https://img.gamemonetize.com/ucv0bh73v900fke5o7viaxihiv27piz9/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47791",
        "title": "RedBall Adventure",
        "description": "Get ready for an exciting ride in RedBall Adventure! Roll your ball through the levels. Collect coins and face tricky challenges along the way. With lots of levels to beat and a never-ending mode, have a blast rolling and bouncing to win!",
        "instructions": "Use Right Arrow key to move forward Use Left Arrow key to move backwards Press Spacebar to jump ",
        "url": "https://html5.gamemonetize.com/6it0zq30axe40ld1mrcxhmezr6ipv344/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Adventure, Ball, Bounce, Collecting",
        "thumb": "https://img.gamemonetize.com/6it0zq30axe40ld1mrcxhmezr6ipv344/512x384.jpg",
        "width": "1000",
        "height": "450"
    },
    {
        "id": "38663",
        "title": "Roblox: Parachute",
        "description": "This game offers an addictive obstacle course experience that takes you on an adrenaline-fuelled adventure. You will test your agility, calculation and precision to overcome this challenging obstacle course. Fast jumps, dynamic platforms and deadly traps will require you to utilise your skills to the max. As you navigate the dangerous terrain, you will struggle to be the fastest and most careful player. Your goal in this fun parkour game is to complete each challenge as fast as possible!",
        "instructions": "- WASD - control the character - Space bar - jump - Esc - pause the game - Rotate the camera with the mouse - R - use the parachute with the key - Shift - key to speed up even more ",
        "url": "https://html5.gamemonetize.com/pdmu6wmpaxb64q67qgswtegbi4u116za/",
        "category": "Arcade",
        "tags": "1 Player, 3D, 3D Games, Best, Best Games, Boys, Casual, Color, Girls, jump, Kid, Obstacle, unity, Unity3D",
        "thumb": "https://img.gamemonetize.com/pdmu6wmpaxb64q67qgswtegbi4u116za/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "48891",
        "title": "Impostor Jump Skibidi Toilet",
        "description": "In the thrilling game Impostor Jump Skibidi Toilet, players embark on an exciting adventure where they take control of an impostor character. The objective is to skillfully navigate above the skibidi toilet using AI-powered jumps, ascending to new s. This unique gameplay combines strategy and precision as you master the art of leaping over obstacles. With each leap, players must outwit the AI to reach greater elevations and unlock new challenges, making it an engaging and addictive gaming experience. Website Developer <a href='https://www.bestcrazygames.com/'>https://www.bestcrazygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/kj9wcj7rsut4ksp827hohklntv790655/",
        "category": "Arcade",
        "tags": "2D, Android, HTML5, Impostor, jump, Jumping, Mentolatux, Mobile, Skibidi, Skibidi Toilet, WebGL",
        "thumb": "https://img.gamemonetize.com/kj9wcj7rsut4ksp827hohklntv790655/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48863",
        "title": "Dig In Mine",
        "description": "Step into the captivating world of Dig In Mine where you embody the character Jackhammer on an extraordinary journey deep beneath the Earths surface. This endless game combines immersive visuals with a thrilling gameplay experience, where Jackhammer mines his way through a vast underground realm while collecting precious gold to unlock new appearances.",
        "instructions": "For Computers Use Mouse Hold amp Drag For Mobiles Hold amp Drag your finger",
        "url": "https://html5.gamemonetize.com/6bv4rw7mis1p5oli7mq6wvmjtu8taala/",
        "category": "Arcade",
        "tags": "2D, Arcade, Avoid, Collecting, endless, Fun, Funny, Gold, Mine",
        "thumb": "https://img.gamemonetize.com/6bv4rw7mis1p5oli7mq6wvmjtu8taala/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "48936",
        "title": "Super Hero Legends",
        "description": "Journey across the world, scouring for essential components that will fuel your adventure. Unleash your creativity by crafting your very own team of heroes, each with their distinct abilities and personalities. Engage in epic clashes against formidable adversaries, testing your heroes mettle and strategy. As you progress, diligently upgrade your heroes, bolstering their strengths and skills, all in a valiant effort to defend and preserve the world from impending threats and chaos. Website Developer <a href='https://www.bestcrazygames.com/'>https://www.bestcrazygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/9sce2faxpfju103wy0ukbqw17icynnuj/",
        "category": "Arcade",
        "tags": "3D Games, Android, HTML5, Mentolatux, Mobile, Unity3D",
        "thumb": "https://img.gamemonetize.com/9sce2faxpfju103wy0ukbqw17icynnuj/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48888",
        "title": "Shape Anti Magnet",
        "description": "Introducing Shape Anti Magnet &ndash; a captivating puzzle game that defies attraction! In this thrilling adventure, players must strategically manipulate magnetic forces to repel geometric shapes and guide them through intricate mazes. With 80 challenging levels and a unique physics-based gameplay mechanic, your problem-solving skills will be put to the test. Immerse yourself in stunning visuals and addictive gameplay as you embark on a journey to master the art of magnetic repulsion. Shape Anti Magnet promises hours of mind-bending fun for players of all ages. Get ready to repel and conquer!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/6kiyvgyck0b76ki876tcx2kl5caypuly/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/6kiyvgyck0b76ki876tcx2kl5caypuly/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "44366",
        "title": "Spirall Rool",
        "description": "Spiral Roll is an engaging and addictive mobile game that combines elements of puzzle-solving, precision, and creativity. Developed by SayGames, Spiral Roll challenges players to navigate a rolling ball through a dynamic, twisting path made up of various obstacles, gaps, and barriers. The goal is to guide the ball smoothly along the winding trail, avoiding obstacles and collecting gems or other in-game rewards along the way.",
        "instructions": "Mouse Control ",
        "url": "https://html5.gamemonetize.com/jp112o3o4hzgrnc7zaewjkrfk282pul8/",
        "category": "Arcade",
        "tags": "1 Player, 2D",
        "thumb": "https://img.gamemonetize.com/jp112o3o4hzgrnc7zaewjkrfk282pul8/512x384.jpg",
        "width": "1000",
        "height": "600"
    },
    {
        "id": "48838",
        "title": "Witch Flight 2",
        "description": "Tap the game screen to make the witch fly. Collect stars, but avoid the flying pumpkins, ghosts, and the purple witch. After you collect a star the witch is encased in shield for 8 seconds during which time she cannot be damaged. The witch autoshoots so you can aim to destroy the oncoming Halloween ghouls.",
        "instructions": "Tap the game screen to make the witch fly She autoshoots from her magic wand so try to aim so that you can destroy the oncoming ghouls Collect the stars to gain an 8 second shield avoid all other objects ",
        "url": "https://html5.gamemonetize.com/ks75dav8ccb2v5l5ia9rnuyr7kpxplkl/",
        "category": "Arcade",
        "tags": "Action, Arcade, fly, Halloween, Witch",
        "thumb": "https://img.gamemonetize.com/ks75dav8ccb2v5l5ia9rnuyr7kpxplkl/512x384.jpg",
        "width": "1366",
        "height": "768"
    },
    {
        "id": "48877",
        "title": "Grimace vs giant clown shoes",
        "description": "Help grimace escape from the giant clown shoe. Collect the coins with Grimaces image on them to break the platforms and the hamburgers to push the giant shoe away. Watch out for the small shoes! If you get hit, youll slow down.",
        "instructions": "Touch or click on the left or right side of the screen Cursors left and right on the keyboard",
        "url": "https://html5.gamemonetize.com/a444wv2y6ce7cxrj5bp7jv6q8bi9esxr/",
        "category": "Arcade",
        "tags": "Arcade, Classic, Grimace, Kids, Platform",
        "thumb": "https://img.gamemonetize.com/a444wv2y6ce7cxrj5bp7jv6q8bi9esxr/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "48653",
        "title": "GunnerCraft",
        "description": "Its time to fire your weapon, Steve. Fire your gun and start jumping. You can jump by shooting and go wherever you want. Draw your bow and shoot the arrow. You must collect all the boxes. Collect the boxes and kill all the invisible monsters. You cant see them until you collect the boxes. So, collect the boxes first and then hunt down all the monsters!",
        "instructions": "Click to shoot or tap with your finger Wherever you shoot you move in the opposite direction move according to the tab of the gun ",
        "url": "https://html5.gamemonetize.com/lwcf5mxxqj2dr0524y2kibp75t1j2yva/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Action, Arcade, Gun, Minecraft, Pixel, Shooter",
        "thumb": "https://img.gamemonetize.com/lwcf5mxxqj2dr0524y2kibp75t1j2yva/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48780",
        "title": "Wack a Grimace Shake",
        "description": "Wack a Grimace Shake is a thrilling unity script-based game that challenges your reflexes and precision. Dive into a whimsical world where you must whack quirky Grimace Shakes as they pop up randomly. Use your mouse or touch screen to strike them swiftly, but be careful not to miss! With its engaging graphics and dynamic gameplay, this game guarantees endless fun. Can you achieve the highest score and become the Grimace Shake whacking champion? Get ready to tap into your inner speedster in this addictive article rewriting-inspired gaming experience!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/aikv1zlc8dcefn3mbetxbeg8fsoxohsw/",
        "category": "Arcade",
        "tags": "1 Player, 3D, Arcade, Grimace, Grimace Shake, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/aikv1zlc8dcefn3mbetxbeg8fsoxohsw/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "37342",
        "title": "Multi Brick Breaker",
        "description": "Can you beat your opponent? Yes you are two challengers at same time. An AI will try to defeat you ! Keep up with the ball and deflect it with your paddle in this classic breakout game! Multi Brick Breaker is a whole new game! Pamboo want to eat some bamboo. You will need to break all of bamboo with your ball before the opponent. Break and destroy each brick, until you've succeeded each level's mission! Use bonus to help you and clear all levels! - Classic brick breaker breakout gameplay with a modern, mobile twist! - Challenging levels ! - Many power-up, aiding your quest to win each level ! - Easy to play, difficult to master: Try to achieve 3 stars on each level ! - Multi ball, smoke, freeze, big ball, dragon ball (oups not this one)",
        "instructions": "Click right under pad and Left Right controls with mouse ",
        "url": "https://html5.gamemonetize.com/bbx909f0j73fa4ny8p7x4z3ixjkr17vl/",
        "category": "Arcade",
        "tags": "2D, Arcade, Arkanoid, Skill",
        "thumb": "https://img.gamemonetize.com/bbx909f0j73fa4ny8p7x4z3ixjkr17vl/512x384.jpg",
        "width": "640",
        "height": "480"
    },
    {
        "id": "48667",
        "title": "Rodha",
        "description": "Get ready for a thrilling adventure in Rodha, the action-platformer that delivers fast-paced, heart-pumping gameplay. In this exciting ball game, youll take on the role of one of 9 unique characters, each with their own distinct personality, as you make your way through 60 challenging levels filled with exciting platforming action. As you explore the minimalist world of Rodha, youll encounter various obstacles and challenges, from cannons and moving saws to other contraptions designed to stop you in your tracks.",
        "instructions": "A D or Left Arrow Right Arrow to move Additionally you can also just tap on the screen if desired ",
        "url": "https://html5.gamemonetize.com/dzwgl9j7jg6vv7l1u9wfg9osqbscl6tb/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Action, Arcade, Best Games, Casual, Mobile, New, Platform, WebGL",
        "thumb": "https://img.gamemonetize.com/dzwgl9j7jg6vv7l1u9wfg9osqbscl6tb/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "48390",
        "title": "Rainbow Tunnel 3D",
        "description": "Dive into the Rainbow Tunnel 3D, a game that will test your reflexes and precision skills. Your mission? Dodge, weave, and survive as you chase high scores.",
        "instructions": "Use the left and right arrows or press A and D on a keyboard On mobile devices just tap on the screen in the desired direction ",
        "url": "https://html5.gamemonetize.com/q40nhbrm77pjoj4a80n1fjrvax1dbzeo/",
        "category": "Arcade",
        "tags": "1 Player, 3D, 3D Games, Arcade, Obstacle, Unity3D",
        "thumb": "https://img.gamemonetize.com/q40nhbrm77pjoj4a80n1fjrvax1dbzeo/512x384.jpg",
        "width": "840",
        "height": "480"
    },
    {
        "id": "48755",
        "title": "Skibidi Toilet City Jumper",
        "description": "Skibidi Toilet City Jumper is an adrenaline-packed mobile game that combines toilet humor with fast-paced city exploration. In this quirky adventure, players control Skibidi, a daring toilet paper roll, as they leap across skyscrapers and navigate bustling cityscapes. Avoid obstacles, collect power-ups, and race against the clock to reach news.With its humorous theme and addictive gameplay, Skibidi Toilet City Jumper promises endless laughter and challenging obstacles. Can you help Skibidi conquer the urban jungle in this hilarious and exciting toilet-themed escapade? Jump into the action now!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/oxg9qn3c372n1v95cbpn5pxufm8ro3uq/",
        "category": "Arcade",
        "tags": "Jumping, Platform, Skibidi, Skibidi Toilet, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/oxg9qn3c372n1v95cbpn5pxufm8ro3uq/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "48593",
        "title": "Fruit Slayer",
        "description": "In Fruit Slayer, unleash your swift slicing skills as you take on the role of a skilled ninja fruit slayer. Armed with razor-sharp reflexes, your task is to slice through an onslaught of juicy fruits while avoiding dangerous bombs. With its addictively satisfying gameplay, stunning visuals, and challenging levels, Fruit Slayer offers a fruit-slicing frenzy that keeps you on the edge of your seat. Are you up for the challenge of becoming the ultimate fruit-slicing master?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/rm57k8lh8xmwkrsmfj4og8urwsfjnngs/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Fruits, Sword, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/rm57k8lh8xmwkrsmfj4og8urwsfjnngs/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46594",
        "title": "Slime Knight",
        "description": "Slime Knight is an arcade-platform game where you have to explore an ancient castle with a tiny but brave knight! Defeat the enemies on the floor with the knights sword to help him to advance to the next one.",
        "instructions": "Desktop -X Space Up Arrow or Right Click to Jump -S C or Left Click to Throw Swords Mobile -Ingame Controls ",
        "url": "https://html5.gamemonetize.com/wyrv3daj2x60fpyxyyj6rvyv5e40aurx/",
        "category": "Arcade",
        "tags": "Action, Arcade, Pixel, Platform, Retro",
        "thumb": "https://img.gamemonetize.com/wyrv3daj2x60fpyxyyj6rvyv5e40aurx/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47701",
        "title": "Zrist DX",
        "description": "Dodge endless obstacles while you get used to constantly shifting rules! Extended and upgraded version of Zrist, an endless runner where the play rules are modified on the go. This new version has a progression system, a shop, and much more!",
        "instructions": "Desktop -X or Left Click to Jump -C or Right Click to Slide Mobile -Touch Right to Jump -Touch Left to Slide ",
        "url": "https://html5.gamemonetize.com/mmbnapzidjavkvd8kolb9s4a7rzyfr2w/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Action, Arcade, endless, Pixel, Retro",
        "thumb": "https://img.gamemonetize.com/mmbnapzidjavkvd8kolb9s4a7rzyfr2w/512x384.jpg",
        "width": "704",
        "height": "528"
    },
    {
        "id": "48641",
        "title": "Grimace Shake City Chaos",
        "description": "Welcome to Grimace Shake City Chaos! Immerse yourself in an exciting urban adventure where chaos reigns. Navigate through the bustling city as you face quirky challenges, eccentric characters, and unexpected twists. Use your wit and skills to restore order and uncover the secrets behind the chaos. With captivating visuals and a dynamic storyline, this game offers an adrenaline-pumping experience that will keep you hooked for hours. Are you ready to shake things up and conquer the chaos in Grimace Shake City?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/qynybbj95cb1gp7wr28l3zzq56qmptet/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, Grimace, Grimace Shake, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/qynybbj95cb1gp7wr28l3zzq56qmptet/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48618",
        "title": "Galactic Pixel Storm",
        "description": "Embark on an exciting cosmic adventure in Galactic Pixel Storm! Immerse yourself in a world of captivating pixel art graphics and mesmerizing sound effects. Pilot your spacecraft through a realm of pixel art targets, smashing them with rockets in a symphony of explosive brilliance. Your mission is to meticulously obliterate each pixel art piece, shattering them into a mesmerizing dance of one or two pixels. As a player, youll enjoy the thrill of upgrading your spacecraft, selecting from three unique ship types, and harnessing a variety of game-changing power-ups.",
        "instructions": "Engaging with Galactic Pixel Storm is intuitive and exhilarating Simply guide your spacecraft with precision using your mouse or touch controls on your devices screen Tap and drag within the designated area to move your ship and unleash rockets upon you",
        "url": "https://html5.gamemonetize.com/fszfewxqqrrfwmsowujftwglmlhlufry/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Action, Alien, Battle, Block, Bomb, demolition, Minecraft",
        "thumb": "https://img.gamemonetize.com/fszfewxqqrrfwmsowujftwglmlhlufry/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48615",
        "title": "Stickman Doodle Epic Rage",
        "description": "Stickman Doodle Epic Rage is fun and addictive beatemup game with realistic physics and hardcore gameplay. With simple controls you can perform amazing stunts and blows to defeat your opponents. Unknown enemies emerge in the city! Our Stick hero continues to fight them off with a wide array of deadly weapons as well as helicopters and robots, who can devastate all enemies at once! The followers of Stickman games still have not forgotten the feeling of tight guillotine and ecstatic graphics of Stickman Brawl of Rage. And what would you expect in a recent version of Stickman fight and this revenge? Whether this revenge will end or not?",
        "instructions": "Arrow key - move space - jump Z X C - attack defend",
        "url": "https://html5.gamemonetize.com/39619mhrok90ugn1szm24fsvagqqwucc/",
        "category": "Arcade",
        "tags": "Stickman, Street Fighting",
        "thumb": "https://img.gamemonetize.com/39619mhrok90ugn1szm24fsvagqqwucc/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "47796",
        "title": "Space War 3D",
        "description": "If you are a fan of space shooting games and experiencing sky shooting styles, then Space War is right up your alley. One day, our beautiful galaxy is attacked by space invaders. You are the last hero of the galaxy. Your goal will require quite a struggle because you have to save the galaxy from the enemies. Space War puts you in a front-line battle with space invaders. You will take control of the spaceship and protect the galaxy from alien swarms. As the game progresses, the spaceship qualifies for the upgrade and you will get the full lethal feature.",
        "instructions": "FEATURES - Great lighting and special effects - Includes Power Upgrades and Bosses - wheel of luck -100 well designed levels ",
        "url": "https://html5.gamemonetize.com/2nvgjwud82nthgbyy15nqlzbtlv07g6h/",
        "category": "Arcade",
        "tags": "3D, Adventure, Aircraft, Alien",
        "thumb": "https://img.gamemonetize.com/2nvgjwud82nthgbyy15nqlzbtlv07g6h/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "48567",
        "title": "Grimace Only Up!",
        "description": "Embark on a thrilling adventure with Grimace Only Up, a pulse-pounding platformer that will keep you on the edge of your seat! Take control of Grimace, our charismatic and agile hero, as you navigate through a perilous world of floating objects, deadly traps, and dizzying Your objective? Jump, dodge, and weave your way from one object to another as you ascend ever higher towards the ultimate goal: the finish line. With intuitive controls and eye-catching graphics, Grimace Only Up Website Developer <a href='https://www.crazygamesonline.com/'>https://www.crazygamesonline.com/</a>",
        "instructions": "WASD control the character SPACE jump",
        "url": "https://html5.gamemonetize.com/xwlonuuotjhcnb1ewnw57pzhvazbz4kj/",
        "category": "Arcade",
        "tags": "Action, Grimace, jump, Jumping, Mentolatux, OnlyUp",
        "thumb": "https://img.gamemonetize.com/xwlonuuotjhcnb1ewnw57pzhvazbz4kj/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48557",
        "title": "Duoland",
        "description": "Two siblings are on their way to becoming little pirates, and you should join the adventure too. The little pirates are searching for chests and collecting treasures in my name. Each sibling is looking for different gems and chests on the island, so they must sequentially find the chests that belong to them. The first rule of being a pirate is to collect everything on the island, including all the coins. After collecting everything, a hidden pirate ship will suddenly appear in the top right corner of the island. Get on that ship and escape from the island.",
        "instructions": " Players use WASD AND Arrow key keys to move Mobile gameplay mobile touch control is available Open all the chests collect all the diamonds and gather all the gold Run to the ship ",
        "url": "https://html5.gamemonetize.com/e3lfhbesog4ymwk5ihtp3vgdatnkq214/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Arcade, Baby, Best, Mobile, Pixel",
        "thumb": "https://img.gamemonetize.com/e3lfhbesog4ymwk5ihtp3vgdatnkq214/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48399",
        "title": "Happy Fishing Day",
        "description": "Happy Fishing This day promises to bring you the biggest catch or your life. But everything depends on you. Click on the screen to drop the fishhook and catch a fish. Dont miss it, or you can deliver a bomb to your ship! Happy Fishing is an exciting and addictive game that promises to bring you the biggest catch of your life. The game is available on mobile devices and is perfect for those who enjoy Happy Fishing Fishing game Mobile game Arcade-style gameplay Skill-based game Strategy game Addictive game Ocean environment Realistic sound effects Free download Challenging levels Big catch Avoid bombs Casual gaming Fun and engaging.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/q1poieomr0emj3k2ask84s2ep8wu2spr/",
        "category": "Arcade",
        "tags": "Bomb, Boy, Boys, Educational, Fish, Fishing, Girl, Girls, Kid, Kids",
        "thumb": "https://img.gamemonetize.com/q1poieomr0emj3k2ask84s2ep8wu2spr/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48334",
        "title": "Skibidi Toilet: Platform Jump",
        "description": "Skibidi Toilet: Platform Jump Game is a challenging and fun game where you control a toilet that must jump and avoid obstacles to reach the end of the level. The game features a variety of levels, each with its own unique challenges. Youll need to use your skills and reflexes to navigate the levels and avoid falling off the platforms.",
        "instructions": "Desktop Use the left click button of the mouse to jump and go forward Mobile Tap on the screen to jump and go forward ",
        "url": "https://html5.gamemonetize.com/wq002umwbc5pzlivky4olxsezbauqzcr/",
        "category": "Arcade",
        "tags": "Action, Adventure, Best Games, Games, NapTech Games, Platform, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/wq002umwbc5pzlivky4olxsezbauqzcr/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "48537",
        "title": "Skibidi Toilet Challenge",
        "description": "When there were too many Skibidi toilets, contradictions arose between them and they splashed out in the game Skibidi Toilet Challenge. Too many who want to become leaders have appeared among the toilet bowls with heads, and this means inevitable clashes. Choose the game mode: singles or doubles. The task is to throw opponents off the court. To increase your chances of winning, collect toilet paper, this will strengthen your character, and this is important, because enemies are rushing around and everyone strives to push the other out of the way and become the head of the entire toilet army in Skibidi Toilet Challenge.",
        "instructions": "Use mouse or touch on the screen ",
        "url": "https://html5.gamemonetize.com/owdcccc7xv2pp4blktxc5fv3igrpudbk/",
        "category": "Arcade",
        "tags": ".io, .io Games, 2 Player, 2 Player Games, Action, Adventure, Best, Fun, Funny, HTML5, Kids, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/owdcccc7xv2pp4blktxc5fv3igrpudbk/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48550",
        "title": "Skibidi War   Toilets Attack",
        "description": "Welcome to Skibidi War, a one-of-a-kind strategy shooter game set in the heart of Skibidi Toilet City. Here, the Skibidi Toilets face off against the innovative Camera Heads in a rousing war. Think youve experienced all shooter defense games? Skibidi war will redefine your expectations. Survive and defend your territory from a ceaseless attack of these dangerous rivals in a game that humorously mingles the epic with the everyday.",
        "instructions": "You need to control the toilet to run continuously and defeat other toilets to win You can also pick up some weapons and use them to strengthen yourself ",
        "url": "https://html5.gamemonetize.com/6nw0qptdh7pv9c6dv14rxserfbqqdoj5/",
        "category": "Arcade",
        "tags": ".io, .io Games, 1 Player, 2D, Skibidi, Skibidi Toilet, survival",
        "thumb": "https://img.gamemonetize.com/6nw0qptdh7pv9c6dv14rxserfbqqdoj5/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "48245",
        "title": "Cleaning the Islands",
        "description": "In the game, players need to act as a survivor living on a desert island, collect resources on the island and sell them in exchange for gold coins, use gold coins to build their own fantastic island, and you can also improve tools to carry out work faster and increase the capacity of the backpack, which will allow you to store more materials.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/tjd1v5htgmtk6dzou0r6gomjo5esb1zx/",
        "category": "Arcade",
        "tags": "2D, Arcade, Casual, HTML5, Island",
        "thumb": "https://img.gamemonetize.com/tjd1v5htgmtk6dzou0r6gomjo5esb1zx/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46587",
        "title": "Mini Swim",
        "description": "Mini Swim is a platformer game where you have to swim all over the stage evading obstacles and enemies to collect all the treasures on the ocean! You can also test your skills by collecting coins in the speedrun mode.",
        "instructions": "Mobile -Ingame Controls Desktop -WASD or Arrow Keys ",
        "url": "https://html5.gamemonetize.com/7c5r05xyykx8t8nv5xohrktff5ttbvhk/",
        "category": "Arcade",
        "tags": "Arcade, Pixel, Platform, Retro",
        "thumb": "https://img.gamemonetize.com/7c5r05xyykx8t8nv5xohrktff5ttbvhk/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48223",
        "title": "Skibidi Wall Jump",
        "description": "Skibidi Wall Jump is an exhilarating and visually captivating platformer game that thrusts players into a gravity-defying world of skill and reflexes. In this vibrant and energetic game, youll navigate a dynamic environment filled with intricate mazes and obstacles while controlling a quirky and agile character armed with an extraordinary ability &ndash; the power to perform daring wall jumps. Set against a backdrop of mesmerizing landscapes that seamlessly blend futuristic cityscapes, lush natural environments, and surreal dreamscapes, Skibidi Wall Jump offers a unique visual experience.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/8g5gnjea07n3h4079pw5a2k75t1x2834/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Clicker, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/8g5gnjea07n3h4079pw5a2k75t1x2834/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "48333",
        "title": "Buildy Island 3D",
        "description": "Buildy Islan is a trending idle game, a new sims experience is about to begin. You go from being a woodcutter with nothing to an island owner with a wealth of specialties. Practice logging, chopping wood, and collecting crops, then you can choose what kind of house to build and who to hire for the job, professional managers will be your right-hand man and easily manage your personal online. Buildy Island: An Exciting and Addictive IOS Game for Creative Minds Mobile gaming has become an integral part of our modern lifestyle, providing endless entertainment and challenges to players of all ages.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/vxqgh36ahgcptfs9xm2g06vsh73koscg/",
        "category": "Arcade",
        "tags": "Action, Adventure, Business, Creation, Island, Simulation, Unity3D, World",
        "thumb": "https://img.gamemonetize.com/vxqgh36ahgcptfs9xm2g06vsh73koscg/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48533",
        "title": "Spider Jump",
        "description": "Swing into action as Spider-Man in Spider Jump! Experience the exhilarating adventure of leaping through the cityscape, using your iconic web-slinging abilities to navigate towering skyscrapers and evade danger. Explore an immersive open world, master acrobatic stunts, and engage in thrilling battles against notorious villains. With stunning visuals and dynamic gameplay, Spider Jump delivers the ultimate superhero experience. Get ready to leap, swing, and save the day in this high-flying, web-slinging escapade!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ppmycc95caje6j812xqerol8zr1pugx6/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, Clicker, Jumping, Spiderman, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/ppmycc95caje6j812xqerol8zr1pugx6/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "48522",
        "title": "Among Us Arcade",
        "description": "(Among Us Arcade) Join your favorite characters on a precarious line! Keep them from falling in this thrilling arcade game where balance is key",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/g2woks3mcag5gl5poo60729lsd7y5dwa/",
        "category": "Arcade",
        "tags": "Arcade, Fun, Funny, Games, HTML5, Kid, Kids, Space",
        "thumb": "https://img.gamemonetize.com/g2woks3mcag5gl5poo60729lsd7y5dwa/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48286",
        "title": "Skibidi Toilet.io",
        "description": "This is Skibidi.io, the ultimate fusion of Skibidi and io gameplay that provides players with an adrenaline-filled experience! This game set in the heart of Skibidi Toilet City Here, you will control Skibidi Toilets and Cameramen in a rousing war.",
        "instructions": "Your goal is to eat grow and evolve As you grow and evolve you will unlock special abilities and powers to help you in your quest for victory What you have to do is just to swipe to control it to make you stronger Until you are the Lord of the Skibid",
        "url": "https://html5.gamemonetize.com/dffeouwj1z8gq8h73ad88wmdlcl7knp3/",
        "category": "Arcade",
        "tags": ".io, .io Games, 1 Player, 2D, Adventure, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/dffeouwj1z8gq8h73ad88wmdlcl7knp3/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "48467",
        "title": "Choo Choo Charles",
        "description": "All aboard Choo Choo Charles arcade game! Join Charles adventure as he navigates tracks filled with obstacles. Guide him to challenges, and set the high score in this thrilling railway journey.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/iak5zotv7e7ijzyikjea2gdstdlxrh38/",
        "category": "Arcade",
        "tags": "Arcade, Fun, Game, Highscore, HTML5, Kids, Train",
        "thumb": "https://img.gamemonetize.com/iak5zotv7e7ijzyikjea2gdstdlxrh38/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48445",
        "title": "Hot Air Balloon Game 2",
        "description": "Hot Air Balloon Game 2 is a fun game in which you need to avoid other objects in the sky, such as birds and planes, to avoid crashing your balloon. Dont let the people riding in the balloon down!",
        "instructions": "Tap the game screen to move the balloon or left mouse click if you are using a desktop computer Avoid other objects or you will pop your balloon ",
        "url": "https://html5.gamemonetize.com/lrzrnqxbra43pfakqsfq0x5oe5s1tvv6/",
        "category": "Arcade",
        "tags": "Action, Adventure, airplane, Arcade, Ballon, Bird, Clicker",
        "thumb": "https://img.gamemonetize.com/lrzrnqxbra43pfakqsfq0x5oe5s1tvv6/512x384.jpg",
        "width": "1366",
        "height": "768"
    },
    {
        "id": "48434",
        "title": "U Cleaner",
        "description": "In the captivating game U Cleaner, players step into the futuristic shoes of a skilled space janitor tasked with tidying up orbital debris. Navigate through challenging cosmic environments using advanced cleaning tools, and strategically collect space junk to clear the way for interstellar travel. With stunning visuals and immersive gameplay, U Cleaner offers a unique blend of strategy and action, challenging players to restore the cosmic balance and ensure safe passage for all. Get ready to sweep the stars clean in this out-of-this-world cleaning adventure.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/gi40oypme5w5btlcev94mlvuszpa21ud/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/gi40oypme5w5btlcev94mlvuszpa21ud/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "48400",
        "title": "Tiny Fishing Frenzy",
        "description": "In this fun and easy to play the game you are about to be the first fisherman ever who reached the ocean floor. Collect fish and treasures to buy fishing net upgrades to reach deeper depths. Find more characters trapped in the sea and try to fill in your trophy room. Catch as many fish and treasures as you can. Upgrade your net and fill your trophy room. Tiny Fishing Frenzy: Dive Into the Ocean Depths Fishing game Mobile game Ocean adventure Underwater world Fisherman Catch fish Treasure hunt Fishing net upgrades Trophy room Addictive gameplay Marine life User-friendly interface Unlock new fishing spots Swiping game Fun and easy-to-play.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/xvy1k9ozxycv29zcqoxj89l2unw4l3q1/",
        "category": "Arcade",
        "tags": "Boy, Boys, Fish, Fishing, Girl, Girls, Shoot, Shoot 'Em Up, Shooter, Shooting, Sport, Sports",
        "thumb": "https://img.gamemonetize.com/xvy1k9ozxycv29zcqoxj89l2unw4l3q1/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48181",
        "title": "Parking Lot Jam",
        "description": "Plunge into the world of business, where you will become the manager of your own parking! Let cars in and sell parking tickets to drivers to unlock new opportunities. In this fascinating browser game you have to completely manage the whole life of the parking lot. Accumulate banknotes to buy new parking spaces, improve performance, and eventually hire a boat worker who will work for you!",
        "instructions": "1 Tap the screen with your finger or press the left mouse button to make a joystick appear to control the player 2 Go to the barrier at the entrance and let the cars in 3 Take parking tickets at the yellow ATM and go to the cars to give them to the d",
        "url": "https://html5.gamemonetize.com/d4klvsuv087ov4v475mda0crr3ftgikj/",
        "category": "Arcade",
        "tags": "3D, Arcade, Car, Management",
        "thumb": "https://img.gamemonetize.com/d4klvsuv087ov4v475mda0crr3ftgikj/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48389",
        "title": "Skibidi Pop",
        "description": "Skibidi Pop: Dance and Groove is a lively rhythm-based game that puts your music skills to the test. Follow the beat of the catchy tunes as you control the adorable characters on screen. Swipe, tap, and dance your way through vibrant levels, collecting points and power-ups along the way. With its intuitive controls and colorful visuals, Skibidi Pop offers hours of fun for players of all ages. Get ready to pop and lock to the rhythm in this energetic and addictive musical adventure!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/cwtg0arc6ma1obfhi13hogq8zurp8nb9/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Shooting, Skibidi, Skibidi Toilet, Zombie",
        "thumb": "https://img.gamemonetize.com/cwtg0arc6ma1obfhi13hogq8zurp8nb9/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "48361",
        "title": "Pack It Right",
        "description": "Pack It Right is an engaging puzzle game that puts your spatial reasoning skills to the test! Your goal is to fit various items into designated cases efficiently, employing strategic placement and careful organization. With each level, the complexity increases, introducing new shapes and challenging constraints. Navigate through a series of brain-teasing puzzles as you strive to optimize space utilization and achieve the perfect fit. Ready to showcase your packing prowess? Immerse yourself in this addictive and satisfying game that promises hours of challenging fun for players of all ages!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/oxz7sfj3465p8kcnse34qemr06xsjzu1/",
        "category": "Arcade",
        "tags": "Arcade, Skills, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/oxz7sfj3465p8kcnse34qemr06xsjzu1/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48259",
        "title": "Skibidi Artist",
        "description": "Embark on a rhythm-fueled journey with the Skibidi Artist game! Dance and groove to the beat of Skibidis catchy tunes as you master challenging levels, mirroring the artists iconic moves. With vibrant visuals and addictive gameplay, its a whirlwind of fun and rhythm. Unlock costumes, discover hidden dance floors, and compete with friends for the highest scores. Whether youre a fan of the artist or just looking for a toe-tapping good time, the Skibidi Artist game is a must-play experience.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/c227drwnhldm3bt78fzulk5riktgscqf/",
        "category": "Arcade",
        "tags": "Arcade, Drawing, Skibidi, Skibidi Toilet, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/c227drwnhldm3bt78fzulk5riktgscqf/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "48299",
        "title": "Undead Horizons: Pirates Plague",
        "description": "Embark on a treacherous journey in Undead Horizons: Pirates Plague, a high-octane action-adventure game. Set in a world where the oceans are infested with undead creatures, you take on the role of a fearless pirate captain. As you navigate cursed waters, you must lead your crew through battles against both rival pirates and hordes of relentless zombies. Uncover the mystery behind the plague that has unleashed the undead scourge, and strategically plunder for resources to upgrade your ship and crew. Can you survive the cursed seas and conquer the Undead Horizons?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/x2vp69ktmnebqjqnvnivl9iaznrqzpap/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Fighting, Pirate, Zombie",
        "thumb": "https://img.gamemonetize.com/x2vp69ktmnebqjqnvnivl9iaznrqzpap/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "48252",
        "title": "Eat to Evolve",
        "description": "Start with and take control of a tiny and always-hungry worm to attack and survive as long as possible by devouring everything and everyone in your way! But watch out! You cannot let pesky enemies make dinner out of you!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/k36vh6ostf5sebdf9dlt6hk91fhvwqqs/",
        "category": "Arcade",
        "tags": "3D, Animal, Arcade, Casual, HTML5, Online",
        "thumb": "https://img.gamemonetize.com/k36vh6ostf5sebdf9dlt6hk91fhvwqqs/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48279",
        "title": "Skibidi Toilet Archer",
        "description": "Skibidi Toilet Archer: Unleash your aim and timing in this quirky arcade challenge! Armed with a plunger bow, become the ultimate bathroom warrior as you defend your realm from invading monsters. Tackle waves of foes with precise shots, unlocking power-ups and hilarious skins along the way. With fast-paced action and a dose of bathroom humor, Skibidi Toilet Archer offers addictive gameplay thats both entertaining and light-hearted. Ready to take the plunge and conquer the porcelain battlefield?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/rb41flywinafaizn0kuylqknktl9dt4n/",
        "category": "Arcade",
        "tags": "Arcade, Bow, Shooting, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/rb41flywinafaizn0kuylqknktl9dt4n/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "47709",
        "title": "Draw Climber 2 Game",
        "description": "Draw Climber 2 is an interesting race game. You have to draw a leg that makes sure the block could move. You will race with another block, there are obstacles will in your way. Be smart, change the shape of your legs anytime you could pass any obstacles.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/n0urux85ywqnnvqhbjklwp3k9yku3iwv/",
        "category": "Arcade",
        "tags": "Avoid, Boy, Hypercasual, Kid, Physics, Puzzle, run",
        "thumb": "https://img.gamemonetize.com/n0urux85ywqnnvqhbjklwp3k9yku3iwv/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "48137",
        "title": "Skibidi Toilet Bowling",
        "description": "Bowling Frenzy is an exhilarating Skibidi Toilet bowling game that delivers strikingly realistic physics and immersive gameplay. Roll your way to victory across various vibrant lanes, each with unique challenges. Customize your ball and unleash power-ups to outscore opponents in fast-paced matches. With intuitive controls and stunning visuals, Bowling Frenzy brings the classic sport to life, offering endless hours of competitive fun for players of all ages and skill levels.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/maarln8xleswz0yyhtarevg6dryrgg5y/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Clicker, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/maarln8xleswz0yyhtarevg6dryrgg5y/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "48210",
        "title": "Race of Toilet Madness",
        "description": "Controle o Skibidi Toilet como um personagem rapido e voraz, desvie dos inimigos cameraman, cuidado com os misseis, fuja de todos inimigos.",
        "instructions": "Move Key buttons",
        "url": "https://html5.gamemonetize.com/fzz1dy7e1nofxy7ry44rrrlg5adl2atm/",
        "category": "Arcade",
        "tags": "Action, Arcade, Escape, running, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/fzz1dy7e1nofxy7ry44rrrlg5adl2atm/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48212",
        "title": "SnowBall Adventure",
        "description": "Get ready for an exciting ride in SnowBall Adventure! Roll your snowball through snowy levels. Collect coins and face tricky challenges along the way. With lots of levels to beat and a never-ending mode, have a blast rolling and bouncing to win!",
        "instructions": "Use Right Arrow key to move forward Use Left Arrow key to move backwards Press Spacebar to jump ",
        "url": "https://html5.gamemonetize.com/1fbhloir9f33k3l7hb0h5yzlmig3kf8c/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Adventure, Arcade, Ball, Bounce, Snow, Winter",
        "thumb": "https://img.gamemonetize.com/1fbhloir9f33k3l7hb0h5yzlmig3kf8c/512x384.jpg",
        "width": "1000",
        "height": "450"
    },
    {
        "id": "48186",
        "title": "Skibidi Train Ninja",
        "description": "Skibidi Train Ninja is an electrifying mobile game where players become agile ninjas on a fast-paced train adventure. Swipe, jump, and slide through challenging obstacles while grooving to the iconic Skibidi track. Unleash your inner ninja skills, collect power-ups, and overcome hurdles with style. With vibrant graphics, rhythmic gameplay, and endless excitement, Skibidi Train Ninja offers an engaging and addictively fun experience for players of all ages. Embark on this musical ninja journey to prove your skills and conquer the train tracks!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/0865g46yh2vlqjellb537ivvx0o8nh6v/",
        "category": "Arcade",
        "tags": "Arcade, Jumping, Ninja, Skibidi, Skibidi Toilet, Train",
        "thumb": "https://img.gamemonetize.com/0865g46yh2vlqjellb537ivvx0o8nh6v/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "46580",
        "title": "Mini Bubbles",
        "description": "Mini Bubbles is a platform game where you have to pop bubbles to jump higher and reach the goal. It was inspired by some classics of the NES era with retro-style graphics and mechanics, with a flexible difficulty aiming to be an enjoyable and relaxing experience, although some skill is needed to complete the game.",
        "instructions": "Desktop -A D or arrow keys to move -W H Up Arrow key or space bar to jump Mobile -Touch controls ",
        "url": "https://html5.gamemonetize.com/3bk9l7xy8krxsy748vw8cc9p70821o29/",
        "category": "Arcade",
        "tags": "Arcade, Pixel, Platform, Puzzle, Retro",
        "thumb": "https://img.gamemonetize.com/3bk9l7xy8krxsy748vw8cc9p70821o29/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47721",
        "title": "Jive Jerry: Banana Bomblet",
        "description": "Jive Jerry, the agile monkey extraordinaire, is known far and wide for his funky moves and boundless energy. With a banana in hand, he transforms the simple fruit into a potent weapon&mdash;Banana Bomblet! He these fruity grenades with pinpoint precision, astounding friends and foes alike with his accurate aim. Jerry dazzles onlookers with his groovy dance routines when not showcasing his explosive prowess. From easily swinging through obstacles to orchestrating banana-fueled chaos, Jive Jerry proves that even the smallest adventurer can pack a big punch in the jungles rhythmic symphony.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/juokvuwip2q3w829srk7dainyx3d8f4o/",
        "category": "Arcade",
        "tags": "Adventure, Animal, Arcade, Jumping, Mario, Monkey, Platform",
        "thumb": "https://img.gamemonetize.com/juokvuwip2q3w829srk7dainyx3d8f4o/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "47162",
        "title": "Dungeon Adventures",
        "description": "Help steve stuck in dungeons.Find the coal, gold, diamond mines needed to run the portal.Be careful not to touch the thorns and poisonous insects!Hover over the mines, wait for a certain time and put them in your inventory",
        "instructions": "W - Jump A - Move Left D - Move Right Double Jump Active",
        "url": "https://html5.gamemonetize.com/xdoqbcg8typ77jixuwczsuz1dgi0dje3/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Action, Adventure, Arcade, Best, Boy, Dungeon, Girl, Minecraft, Miner",
        "thumb": "https://img.gamemonetize.com/xdoqbcg8typ77jixuwczsuz1dgi0dje3/512x384.jpg",
        "width": "344",
        "height": "208"
    },
    {
        "id": "48119",
        "title": "Run of Life Game",
        "description": "Run Of Life is an exhilarating arcade game where players must navigate through a chaotic world infested with zombies. As the last survivor, your goal is to sprint to the finish line while evading the relentless pursuit of the undead. Dodge obstacles, gather power-ups, and use your wits to outsmart the zombies and secure your escape. Can you outrun the apocalypse and reach safety? The challenge is on!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/1cy806f24lmzqxv62qfu07jrn5hetuzo/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Fun, Games, Highscore, HTML5, Kids, run, running, Zombie",
        "thumb": "https://img.gamemonetize.com/1cy806f24lmzqxv62qfu07jrn5hetuzo/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48090",
        "title": "Toilet Plumber",
        "description": "Dive into the messy and hilarious world of Toilet Plumber, a fast-paced and quirky puzzle game that challenges players to become ultimate bathroom heroes! In this zany adventure, you play as a skilled and daring plumber tasked with fixing a variety of absurdly malfunctioning toilets in a whimsical town. From toilets that spew forth confetti instead of flushing properly to ones that launch rubber ducks across the bathroom, the challenges are as wild as they are entertaining.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/z4uixqz9avw10iixbx1auramd6yf99rq/",
        "category": "Arcade",
        "tags": "Arcade, Business, Skibidi, Skibidi Toilet, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/z4uixqz9avw10iixbx1auramd6yf99rq/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "48083",
        "title": "Noob Minecraft VS Skibidi Toilet",
        "description": "Now noob minecraft fight skibidi toilet in the market. Be careful",
        "instructions": "arrow key move Z punch WASD camera",
        "url": "https://html5.gamemonetize.com/m4hw41ycxokk784an6nnw02ank54by3j/",
        "category": "Arcade",
        "tags": "Brawl, Minecraft, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/m4hw41ycxokk784an6nnw02ank54by3j/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48088",
        "title": "Funny Bomber",
        "description": "Funny Bomber, The Amazing Free-to-Play Online action game! Get ready for an exhilarating gaming experience with Funny Bomber, an action-packed game that will keep you entertained for hours. As you step into the virtual world, youll find yourself immersed in a vibrant and dynamic environment filled with excitement and challenges. In Funny Bomber, your objective is simple yet thrilling: blow up all the crystals scattered throughout the level to open the door and get in the temple!",
        "instructions": "Use WASD to move and left mouse click to activate the bomb ",
        "url": "https://html5.gamemonetize.com/5inbebr101r64gfgm6pfflggrbudip0k/",
        "category": "Arcade",
        "tags": "1 Player, 3D, Action, Avoid, Bomb, HTML5, Hypercasual, Kill, Maze, Skill",
        "thumb": "https://img.gamemonetize.com/5inbebr101r64gfgm6pfflggrbudip0k/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "48044",
        "title": "Skibidi Pocalypse",
        "description": "Welcome to the adrenaline-pumping world of Skibidi-Pocalypse, where driving skills and reflexes are your only allies against a whimsical and chaotic end-of-the-world scenario! In this thrilling car game, players find themselves in the drivers seat of customized vehicles, racing through a post-apocalyptic landscape with a twist. Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/zef45d6qwz0embgwyil8pymhz2uhhn88/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Car, Driving, Skibidi, Skibidi Toilet, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/zef45d6qwz0embgwyil8pymhz2uhhn88/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "46582",
        "title": "LinQuest",
        "description": "LinQuest is a 2D adventure-platformer game where you have the mission to help adventurer Lin to search for a mysterious treasure in 3 different dangerous zones. The game is inspired by retro classics featuring a GameBoy graphics style.",
        "instructions": "Desktop -A D or arrow keys to move -W H Up Arrow key or space bar to jump Mobile -Touch controls ",
        "url": "https://html5.gamemonetize.com/usf7zmty0n8iacs3no33o4seqigo3v67/",
        "category": "Arcade",
        "tags": "Adventure, Arcade, Pixel, Platform, Retro",
        "thumb": "https://img.gamemonetize.com/usf7zmty0n8iacs3no33o4seqigo3v67/512x384.jpg",
        "width": "860",
        "height": "600"
    },
    {
        "id": "47360",
        "title": "MechLoop",
        "description": "Youve never played a platform game like this before. Its a game where you have to use your mind completely. use your mind! You have to use your brain. There are different intelligence levels and different intelligence difficulties in each section. Sometimes the roads are easy, sometimes the roads are very difficult. You have to pass many challenges to overcome the obstacles on the roads. Sometimes the button may not work with one touch. Sometimes you have to touch many times. sometimes the wall is just visible but never stops. Everything is up to your brain power.",
        "instructions": " Use Arrow Keys to move Sometimes the keys may work differently Mobile play is available Push the button and remove the wall ",
        "url": "https://html5.gamemonetize.com/uyxfh8jzwph5oyqc2y14d022bus5843r/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Action, Adventure, Android, Arcade, Brain, Platform",
        "thumb": "https://img.gamemonetize.com/uyxfh8jzwph5oyqc2y14d022bus5843r/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48013",
        "title": "ShapeShifter",
        "description": "ShapeShifter is an enthralling puzzle game that challenges your wits and reflexes. Immerse yourself in a world of vibrant shapes, where you must swiftly transform to fit through evolving obstacles. Unleash your strategic prowess to solve intricate puzzles and progress through captivating levels. With stunning visuals and intuitive controls, ShapeShifter promises a thrilling gaming experience for all ages. Unravel the mysteries of shape manipulation and embark on an epic adventure to become the ultimate ShapeShifter! Are you ready to reshape your destiny and conquer this mind-bending journey?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/vkhf3f2uh7g02s2f04j5wjx0qy6hipdt/",
        "category": "Arcade",
        "tags": "1 Player, 3D, Action, Adventure, Arcade, Clicker, Skills, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/vkhf3f2uh7g02s2f04j5wjx0qy6hipdt/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "47992",
        "title": "Skibidi Toilet Smash",
        "description": "Get ready to unleash chaos and laughter in your bathroom with the Skibidi Toilet Smash! This revolutionary and hilarious bathroom game will transform your ordinary toilet into a wall-breaking frenzy of fun. In Skibidi Toilet Smash, you take on the role of a mischievous bathroom adventurer whose mission is to skid the toilet down the track and smash through walls like a whirlwind. Using an easy-to-control sliding mechanism, guide the toilet with precision, timing, and a touch of silliness, aiming to shatter as many walls as possible. Website Developer <a href='https://www.coolcrazygames.com'>https://www.coolcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/e9bdwcmlg2l3vovljyft55ppvg5er1pc/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, Skibidi, Skibidi Toilet, Skill, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/e9bdwcmlg2l3vovljyft55ppvg5er1pc/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "47968",
        "title": "Minecraft Skibidi Toilet",
        "description": "A never seen before scary Skibidi Toilet for MCPE creature will appear in the middle of the village. They are called Skibidi Toilet survival mod for MCPE, creatures with scary shapes. Their bodies consist of a walking toilet, complete with an open toilet lid with a large Skibidi Toilet skin for mcpe head poking out between the holes. Their faces were filled with devilish smiles and burning eyes. Skibidi toilet for mcpe adonss maps residents panicked and tried to escape. They run along the road of the village of Skibidi Toilet mobs event mcpe, looking for a place to hide. However, the scary Skibidi Toilet mod for mcpe skins continues to catch",
        "instructions": "Opening story mode arrow key - move Z X - Attack Open world mode WASD - move mouse move - camera F - enter vehicle ",
        "url": "https://html5.gamemonetize.com/7691kwidhl3lqydju0z553cs59qxy23o/",
        "category": "Arcade",
        "tags": "Boy, Brawl, Minecraft, Simulation, Simulator, Skibidi, Skibidi Toilet, Skills",
        "thumb": "https://img.gamemonetize.com/7691kwidhl3lqydju0z553cs59qxy23o/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47394",
        "title": "FLEET BLAST",
        "description": "Join the thrilling naval adventure of FLEET BLAST &ndash; the ultimate strategic board game of naval warfare. Deploy your fleet, plan your attacks, and outsmart your opponent in this classic Battleship showdown! Strategic Gameplay-Thrilling Battles - Stunning Visuals - Intuitive Controls - Customizable Fleets - Quick Play. Choose your targets wisely and aim for victory! Engage in heart-pounding battles as you take turns with your opponent to call out coordinates and attempt to sink each others ships. Every move counts &ndash; will you hit or miss? Are you ready to conquer the high seas and become ultimate Battleship Commander?",
        "instructions": "Use MOUSE for Controls Use mouse to drag the fleets and to place the fleets on the board Use mouse to select the position of the grid to blast the fleet ",
        "url": "https://html5.gamemonetize.com/p9kfi7cf5uxr4298m9g0vin2wdbahm6g/",
        "category": "Arcade",
        "tags": "1 Player, Board, Casual",
        "thumb": "https://img.gamemonetize.com/p9kfi7cf5uxr4298m9g0vin2wdbahm6g/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46585",
        "title": "Mini Flips Plus",
        "description": "Mini Flips is an arcade game where you must collect all the coins in the level by jumping, flipping sides, avoiding obstacles and enemies controlling a small blob character. Get ready for over 160 challenging levels!",
        "instructions": "Mobile -Touch Right to Jump -Touch Left to use the Arrow Panels Desktop -C Up Arrow or Left Click to Jump -Space or Right Click to use the Arrow Panels ",
        "url": "https://html5.gamemonetize.com/qlmdfnbyl52dq9k7u0yag51wa9atbeg0/",
        "category": "Arcade",
        "tags": "Arcade, Pixel, Platform, Retro",
        "thumb": "https://img.gamemonetize.com/qlmdfnbyl52dq9k7u0yag51wa9atbeg0/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47909",
        "title": "Skibidi Sling",
        "description": "Help the little Skibidi toilet and his friends to sling and bounce to the top but watch out the obstacles and deadly traps. Go up and race against the Lava for your life climbing the tomb tower, collecting coins, diamonds, and power ups. Use the coins to unlock new amazing characters and reach top and collect as much coins as you can.",
        "instructions": "Slide your finger or mouse click to aim the slingshot",
        "url": "https://html5.gamemonetize.com/bbp93rifyx1v0jrhzddd2mhmb61ixsca/",
        "category": "Arcade",
        "tags": "Action, Pokemon, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/bbp93rifyx1v0jrhzddd2mhmb61ixsca/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "46589",
        "title": "Mini Springs",
        "description": "Mini Springs is a retro-style platform game where you command a small blob character that cant jump; use the springs all over the stage to evade obstacles and enemies to reach the goal and complete all levels!",
        "instructions": "Mobile -Touch Right to Move Right -Touch Left to Move Left Desktop -AD or Arrow Keys to Move ",
        "url": "https://html5.gamemonetize.com/0fgjih85qhaqvnklaxe91x9h5bcfirlr/",
        "category": "Arcade",
        "tags": "Arcade, Pixel, Platform, Retro",
        "thumb": "https://img.gamemonetize.com/0fgjih85qhaqvnklaxe91x9h5bcfirlr/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47718",
        "title": "Huggy Wuggy Fight Skibidi Toilet",
        "description": "Huggy Wuggy and Killy Willy fight Skibidi Toilet in Poppy Playtime. Grab all rifle that cameramen has placed around, and avoid skibidi toilet",
        "instructions": "WASD Move Mouse move camera Space jump",
        "url": "https://html5.gamemonetize.com/prkhv6agzimcsupflnloixm4a7sr8jnh/",
        "category": "Arcade",
        "tags": "3D, Fighting, huggy, Play, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/prkhv6agzimcsupflnloixm4a7sr8jnh/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "34440",
        "title": "The Baby in yellow Craft Mod",
        "description": "Time to use your imagination! In this game you&rsquo;re going on an adventure quest to build a world for girls &amp; boys! Take time for some exploration like in typical sandbox building games and build a kindergarten in no time! Mine resources, design, craft &amp; build whatever you want - in a world of girls &amp; boys you&rsquo;ve to be smart! It&rsquo;s one of the most creative adventure games for girls &amp; boys alike, so don&rsquo;t limit yourself with simple kindergarten and build&hellip; a castle! Best game for teenagers or parents!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ermqmo8qh7h2alq6w4a9tofkpgdi6pbw/",
        "category": "Arcade",
        "tags": "Action, Arcade",
        "thumb": "https://img.gamemonetize.com/ermqmo8qh7h2alq6w4a9tofkpgdi6pbw/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47813",
        "title": "Legend Street Fighter",
        "description": "Hit the road and experience the excitement of street fighting in Legend Street Fighter. This Fighting game will challenge you to fight various tough opponents and become the King of Legend Fight Unleash your inner warrior to become the Legend Fighter - Get ready for the ultimate street fighting game where you have to use all your skills to defeat your opponents. With intuitive controls, stunning graphics and immersive sound effects, this game will keep you busy for hours and make you a cowboy street Fighter.",
        "instructions": "Choose your Legend fighter - Choose your favorite character from a variety of fighters each with their own unique moves combos and special attacks Whether youre a fan of classic fighting games or looking for a new challenge Legend Street Fighter has s",
        "url": "https://html5.gamemonetize.com/rc3jlg2z2zj6hy9b6vwlybfbokwxyod0/",
        "category": "Arcade",
        "tags": "Action, Arena, Fighting",
        "thumb": "https://img.gamemonetize.com/rc3jlg2z2zj6hy9b6vwlybfbokwxyod0/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "46588",
        "title": "Tiny Explorer",
        "description": "Tiny Explorer is a retro arcade-platforming game where you have to help a small explorer in his quest inside an ancient temple trying to find an epic treasure! Explore all 27 levels and test your skills on the speedrun mode!",
        "instructions": "Desktop -A D or Left and Right Arrow Keys to Move -W I or Up Arrow Key to Jump -Space U C or O to use Whip Mobile -Ingame Controls ",
        "url": "https://html5.gamemonetize.com/lyw3sfisojdeoun38rx091vlv3q34hsj/",
        "category": "Arcade",
        "tags": "Action, Arcade, Pixel, Platform, Retro",
        "thumb": "https://img.gamemonetize.com/lyw3sfisojdeoun38rx091vlv3q34hsj/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47826",
        "title": "Skibidi Toilet Geometry Rash",
        "description": "The objective of Skibidi Toilet Geometry Rash is to guide your chosen character through a series of geometry-based obstacles, cunningly designed to test players reflexes and problem-solving skills. Jump, slide, and dash your way through an array of creatively designed levels. Jump in and start playing now!",
        "instructions": "Mouse Up arrow letter W or space ",
        "url": "https://html5.gamemonetize.com/eckse54kyphdhxlj2tnd7yq3xtp4pbo4/",
        "category": "Arcade",
        "tags": "Arcade, Avoid, Boy, HTML5, Hypercasual, jump, Skill",
        "thumb": "https://img.gamemonetize.com/eckse54kyphdhxlj2tnd7yq3xtp4pbo4/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "47654",
        "title": "Draw Pen Rush",
        "description": "Draw Pen Rush is a fun and exciting parkour game. Players control a robot to compete in parkour races, avoiding obstacles and collecting various parts to enhance their abilities and turn into big robots. The game is played in portrait mode, allowing players to see further down the track and prepare to avoid traps. Help the robot defeat the ultimate brain.",
        "instructions": "Slide left and right to avoid the obstacles and pick the part up to transform into bit robots ",
        "url": "https://html5.gamemonetize.com/qbrhatbgvznrc319t64rwb90deypp9n4/",
        "category": "Arcade",
        "tags": "Boat, Draw, Drawing, HTML5, Hypercasual, Obstacle, Platform, running, Skills, Sword, weapons",
        "thumb": "https://img.gamemonetize.com/qbrhatbgvznrc319t64rwb90deypp9n4/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "46583",
        "title": "Mini Stilts",
        "description": "Mini Stills is a retro-style game where you guide a blob character to his goal: A delicious candy! Use the blob stilts to help him to surpass obstacles and evade enemies to advance between all levels.",
        "instructions": "Desktop -C Space or Left-Click to use your Stilts Mobile -Touch to use your Stilts ",
        "url": "https://html5.gamemonetize.com/mpodl0nk01rk4k2tckka7nf2mgz3mj9x/",
        "category": "Arcade",
        "tags": "Arcade, Pixel, Retro",
        "thumb": "https://img.gamemonetize.com/mpodl0nk01rk4k2tckka7nf2mgz3mj9x/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "45328",
        "title": "Lazy Jump Online",
        "description": "Slide, stumble, flip and flail your way through endless levels in this physics-based puzzle game. When your character has all the strength and coordination of a wet rag, you&rsquo;ll need really quick thinking and a firm grasp of the laws of physics to get them to complete even the simplest of tasks. Add to that a smattering of fiendish obstacles and unexpected mechanics, and it&rsquo;ll take all of your wits.",
        "instructions": "You go through endless levels of sliding stumbling flipping and flinging ",
        "url": "https://html5.gamemonetize.com/npycpi1rn91379sihu4cbzsvvn5oosjy/",
        "category": "Arcade",
        "tags": "Avoid, Boy, jump, Kids, Mobile, Online, Puzzle",
        "thumb": "https://img.gamemonetize.com/npycpi1rn91379sihu4cbzsvvn5oosjy/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "1072",
        "title": "Ballz Hit",
        "description": "In the captivating Ball Hit game,players are immersed in an exciting world where skill and precision meet fun and challenge. The objective is simple yet addictive: control a ball that must hit various objects, each adorned with a specific number. The ultimate goal is to destroy these objects by accurately colliding the ball with the corresponding numbers. As players progress through different levels, the games complexity increases, demanding precise timing and strategic thinking. They must carefully aim the ball and calculate the trajectory to hit the target numbers and achieve the highest score possible. With each successful des",
        "instructions": "Use your Mouse to play For mobile you can use the touch",
        "url": "https://html5.gamemonetize.com/d21puuhjmay6kcurt2niziu8i7j0nrr1/",
        "category": "Arcade",
        "tags": "Android, Ball, HTML5, Mobile, Skill, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/d21puuhjmay6kcurt2niziu8i7j0nrr1/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47628",
        "title": "Skibidi vs Noob &amp; Cameraman",
        "description": "Two friends are running away from the monster. The toilet monster is chasing. Escape the toilet monster. toilet monster can kill you. collect all the gold. Collect the gold to open the portal. Jump over obstacles, go faster than some. run with your friend, dont stop. reach the portal. boiler.",
        "instructions": " Noob player use Arrow keys to move Cameraman player use WASD to move Noob player only collects gold Cameraman player activate the wall by pressing the E key Mobile Touch Control",
        "url": "https://html5.gamemonetize.com/u1iivhtg4pg3nalkpqwo5jray0ku3g7r/",
        "category": "Arcade",
        "tags": "1 Player, 2 Player, 2 Player Games, 2D, Action, Adventure, Arcade, Minecraft, Pixel, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/u1iivhtg4pg3nalkpqwo5jray0ku3g7r/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47716",
        "title": "Cyborg Runner",
        "description": "Run as fast as you can! Avoid obstacles, monster and collect batteries of defense systems. You can find defense systems while running. The shield will protect you from some barriers and monsters. Good luck!",
        "instructions": "keyboard mouse or touch turn left arrow left A swipe left turn right arrow right D swipe right jump arrow up W swipe up roll arrow down S swipe down",
        "url": "https://html5.gamemonetize.com/mh9m7p1cul2hvk3614saal7ll5kboc9y/",
        "category": "Arcade",
        "tags": "1 Player, 3D, 3D Games, Action, Adventure, Android, Arcade, endless, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/mh9m7p1cul2hvk3614saal7ll5kboc9y/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "47726",
        "title": "Snake Eats Apple",
        "description": "Snake Eats Apple is a fun online game where you control a snake and try to eat as many apples as possible. The objective of the game is to grow your snake by eating the apples, but be careful not to run into the walls or your own tail! The game gets more challenging as your snake grows longer, so make sure to plan your moves carefully. So, stay focused and try to beat your high score with each playthrough! Enjoy playing",
        "instructions": "Use the arrow keys on your keyboard to control the snakes movements The snake will move in the direction of the arrow key you press Also you can use the mouse or tap on the game screen if you play on a mobile device ",
        "url": "https://html5.gamemonetize.com/znd57xkipqdx5tj7nh5lhwcxgcbhm1kj/",
        "category": "Arcade",
        "tags": "Arcade, HTML5, Puzzle, Snake",
        "thumb": "https://img.gamemonetize.com/znd57xkipqdx5tj7nh5lhwcxgcbhm1kj/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "47665",
        "title": "Pest Control",
        "description": "Pest Control is a thrilling and action-packed game where players become fearless exterminators on a mission to save the city from a relentless insect invasion. Armed with an array of powerful bug-blasting weapons, players must navigate through challenging levels, strategically shooting down hordes of creepy crawlies. Players earn rewards and unlock upgrades with each victory to strengthen their arsenal and combat new, formidable bug species. The games immersive graphics and dynamic gameplay create an adrenaline-pumping experience that keeps players engaged as they face off against swarms of pests in a race against time to safeguard the city.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/mj4z1z6s22g42knn6ux06la1r7rzwdei/",
        "category": "Arcade",
        "tags": "Action, Animal, Arcade, Ladybug, Shooting",
        "thumb": "https://img.gamemonetize.com/mj4z1z6s22g42knn6ux06la1r7rzwdei/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "47609",
        "title": "Skibidi Toilet Rush",
        "description": "Skibidi Toilet Rush is a fun online game that you can play for free. No download needed to play it. The aim of the game is to go all the way to the finish line. Avoid obstacles on the way and kill the enemies before they kill you. Start playing and have fun.",
        "instructions": "Arrow keys to play Up arrow twice for dubble jump ",
        "url": "https://html5.gamemonetize.com/c0juvuf7w31kjh9vkcj3muy9e3qdxby0/",
        "category": "Arcade",
        "tags": "Arcade, Avoid, Boy, Hypercasual, Jumping, Kill, Platform, run, Skibidi Toilet, Skill",
        "thumb": "https://img.gamemonetize.com/c0juvuf7w31kjh9vkcj3muy9e3qdxby0/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "47653",
        "title": "Robo Running 3D",
        "description": "Run with an ink man who does parkour. He holds a magical pen that can turn your drawings into real objects, such as boats, weapons, or even swim rings. But you must collect ink because without it, the pen will lose its magical power. Your ultimate goal is to overcome all obstacles and win the final Boss battle.",
        "instructions": "Swipe left and right to move left and right Run close to the parts to pick them up ",
        "url": "https://html5.gamemonetize.com/k353r7i70su81n9px0spde5ayi6m6yjb/",
        "category": "Arcade",
        "tags": "Avoid, Collecting, Collection, HTML5, Obstacle, Online, Platform, Robot, run, running, Skills",
        "thumb": "https://img.gamemonetize.com/k353r7i70su81n9px0spde5ayi6m6yjb/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "47563",
        "title": "Mini Coins",
        "description": "Mini Coins is an arcade game where you must collect all the coins in the level by jumping, wall jumping, avoiding obstacles and enemies controlling a small blob character. Get ready for over the speedrun mode!",
        "instructions": "Mobile -Touch to Jump Desktop -C Up Arrow or Left Click to Jump ",
        "url": "https://html5.gamemonetize.com/iu5fpa6ap40naojpo1592oacpx80wriv/",
        "category": "Arcade",
        "tags": "Arcade, Pixel, Platform, Retro",
        "thumb": "https://img.gamemonetize.com/iu5fpa6ap40naojpo1592oacpx80wriv/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47350",
        "title": "Super Coin Pusher",
        "description": "try to get the coin droped in the hook, after you do it,you can get the coin droped in coin+5 or bonus+1, if the coin is droped in coin+5,5 coins will fall, if bonus reach 5,you can go to bonus scene and get more rewards.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/v7hm395kspiyn4upyt22uygvl2av5uff/",
        "category": "Arcade",
        "tags": "1 Player, 3D Games, Arcade, Casual, Hot, HTML5, Physics, Skill, WebGL",
        "thumb": "https://img.gamemonetize.com/v7hm395kspiyn4upyt22uygvl2av5uff/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "46581",
        "title": "Mini Dash",
        "description": "Mini Dash is a retro-style platform game where you command a small blob character; use his air-dashing skills to evade obstacles and collect the level coins! Also, you have a speedrun mode to test your skills.",
        "instructions": "Desktop -X Left Click C or Right Click to Jump -X or Left Click in the air to Dash Left -C or Right Click in the air to Dash Right Mobile -Touch Left or Right to Jump -Touch Left in the air to Dash Left -Touch Right in the air to Dash Right ",
        "url": "https://html5.gamemonetize.com/fvqazkrlhtsw9ad3bcz0fbslwh100qf4/",
        "category": "Arcade",
        "tags": "Action, Arcade, Pixel, Platform, Retro",
        "thumb": "https://img.gamemonetize.com/fvqazkrlhtsw9ad3bcz0fbslwh100qf4/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46610",
        "title": "Hot Air Balloon Game",
        "description": "Fly your hot air balloon over the ocean by tapping the game screen to move your balloon up. Avoid obstacles such as birds and planes. Also avoid landing the ocean and avoid hitting the boats. Dont crash your balloon or its game over!",
        "instructions": "Mouse click or tap to play Avoid obstacles Dont crash your balloon or its game over ",
        "url": "https://html5.gamemonetize.com/1vnequr3pabvkw585kjhzgv79bt4cpkw/",
        "category": "Arcade",
        "tags": "Action, Aircraft, Arcade, Ballon, Bird, Casual, Clicker, Game",
        "thumb": "https://img.gamemonetize.com/1vnequr3pabvkw585kjhzgv79bt4cpkw/512x384.jpg",
        "width": "1366",
        "height": "768"
    },
    {
        "id": "40369",
        "title": "Snake Dash Challenge",
        "description": "This game Snake passing is a new mode for a regular snake, in which you do not need to collect food, but go through levels. 8 incredible levels of varying difficulty from easy to hard are waiting for you. Snake passing will help you develop qualities such as determination, attentiveness, analytical skills, perseverance, resourcefulness, optimism.Snake passing is another game that the whole family can play, competing to see who completed more levels, but only the persistent person can win. So lets download the game Snake worms io and wait for the next updates.",
        "instructions": "Go from point A to point B overcoming obstacles on your way",
        "url": "https://html5.gamemonetize.com/yrpi1yijqjpno2q5u08d8pqihznxgm3w/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Arcade, Snake",
        "thumb": "https://img.gamemonetize.com/yrpi1yijqjpno2q5u08d8pqihznxgm3w/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "47337",
        "title": "Handslap",
        "description": "Handslap is a game for 2 players. You can choose whatever arm you want and compete with your friends. Red side is one that is attacking, blue side need to dodge that attack. Players change sides if blue side successfully dodged. To win you need to score 10 points. You earn 1 point with each successful attack you make.",
        "instructions": "Tap on your half to attack dodge on mobile On PC you need to use W and Arrow Up keys ",
        "url": "https://html5.gamemonetize.com/hcktfoyek2b5htexp6z645sub6kppc8b/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, Action, Arcade, Game, Games, HTML, HTML5, PvP, Skill, Skills, unity, WebGL",
        "thumb": "https://img.gamemonetize.com/hcktfoyek2b5htexp6z645sub6kppc8b/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "47527",
        "title": "Skibidi Toilet vs Wario",
        "description": "Skibidi Toilet vs Wario is an amazing ans super fun running game that you can play online for free. Its in HTML5, No Need to Install! The aim of the game is to win the race, you as a Skibidi Toilet vs Wario! Collect boost to run extra fast. have fun playing!",
        "instructions": "Arrow keys or WAD to play ",
        "url": "https://html5.gamemonetize.com/h7n4mqfxk6143vxdktdgdsxszgkve7jg/",
        "category": "Arcade",
        "tags": "Android, Arcade, Avoid, Boy, Fun, HTML5, Hypercasual, jump, Jumping, Mario, Obstacle, run, running, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/h7n4mqfxk6143vxdktdgdsxszgkve7jg/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "47462",
        "title": "Ragdoll Rise Up",
        "description": "Ragdoll Rise Up is an immersive game experience that takes you on a thrilling adventure through ingeniously designed puzzle levels. Fly through the air, avoiding obstacles and deadly traps, while unleashing your power to shatter anything in your path with a simple tap. Balloons will be your companions, but beware of the deadly spikes! Ascend to the top, ensuring the safety of the balloons, and brace yourself for excitement and tension in each level.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/o89li8eh437jmxy3klcmeurj88sbvkib/",
        "category": "Arcade",
        "tags": ".io, 1 Player, Arcade, Ballon, Boys, fly, Fun, Funny, Game, Games, HTML, HTML5, Kid, Kids",
        "thumb": "https://img.gamemonetize.com/o89li8eh437jmxy3klcmeurj88sbvkib/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47477",
        "title": "Avoid the Sharks",
        "description": "You went out swimming in the ocean, but hadnt realized until you were already in the water that there were a lot of sharks nearby. Touch the game screen to move right and left to avoid the sharks so you dont get eaten!",
        "instructions": "Touch the game screen to move right and left to avoid the sharks If on a desktop use the mouse to move the swimmer right and left ",
        "url": "https://html5.gamemonetize.com/u2rjkywt9c1yuw51vutja0kv3wnh4okq/",
        "category": "Arcade",
        "tags": "Mobile, Shark",
        "thumb": "https://img.gamemonetize.com/u2rjkywt9c1yuw51vutja0kv3wnh4okq/512x384.jpg",
        "width": "480",
        "height": "864"
    },
    {
        "id": "47513",
        "title": "New Bottle Shooting Game",
        "description": "Bottle Gun Shooting is a new shooting operation with ultimate shooting fun and entertainment which enhances you shooting visions in free and frank manner in this bottle shooter game. Have faith in your shooting abilities and join this new application of free shooting games to expand you shooting ranges. You targeted role is to take an exact and accurate aim at your bottle target of ultimate bottle shoot 3d games.",
        "instructions": "use screen buttons to shoot with gun and use mouse",
        "url": "https://html5.gamemonetize.com/7tcd7m0kytx8m8j7hkblc5megj70pqyi/",
        "category": "Arcade",
        "tags": "Bubble Shooter, Games, Gun, Robot, Shooter, Shooting",
        "thumb": "https://img.gamemonetize.com/7tcd7m0kytx8m8j7hkblc5megj70pqyi/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "46953",
        "title": "Crazy Helicopter",
        "description": "Make the right shot without touching the ground and destroy your enemy. The one who shoots five accurate shots and destroys his enemy wins. Compete with your friends and try to shoot down his helicopter with five accurate shots. Have fun, good games.",
        "instructions": "Up arrow key symbol on mobile phones Left arrow key and D key on keyboards Good games and have fun",
        "url": "https://html5.gamemonetize.com/zck56cadhrdfyf13bdmv76ystwho4im8/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, airplane, Arena, endless, Fighting, fly, Helicopter, Mobile",
        "thumb": "https://img.gamemonetize.com/zck56cadhrdfyf13bdmv76ystwho4im8/512x384.jpg",
        "width": "480",
        "height": "240"
    },
    {
        "id": "47480",
        "title": "Skibidi Toilet Rage",
        "description": "Skibidi Toilet takes action in some country with a rage to conquer. Save with your hero. While Skibidi Toilet say Dop Dop Yes Yes, be careful. He is so angry about you! The first Skibidi Toilet appeared. At first, many people thought that short videos or short videos were unclear, but because many watched, making Skibidi Toilet episodes. Over time, many people sa Start with memes, walk with battles. Skibidi Toilet initially only tells about a human head sticking out of the toilet, but over time it becomes a battle between the Cameraman and Speakerman against the Skibidi Toilets.",
        "instructions": "Arrow Keys - Move Z and X - Attack C - Defend Space - Jump",
        "url": "https://html5.gamemonetize.com/fmamys2l2en0gi8f85096wgpveejy7da/",
        "category": "Arcade",
        "tags": "3D, Brawl, Fighting, Skibidi Toilet, Street Fighting, Unity3D",
        "thumb": "https://img.gamemonetize.com/fmamys2l2en0gi8f85096wgpveejy7da/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47486",
        "title": "Depicting the Perfect Parking Spot",
        "description": "Prepare yourself for a thrilling parking experience! Engage in an exhilarating game where your task is to skillfully park cars while steering clear of collisions. Immerse yourself in an incredible puzzle game with captivating gameplay. Utilize your finger to draw a path and skillfully navigate the car to its designated parking spot. Stay alert, as the risk of colliding with other vehicles is ever-present! Exercise caution and avoid crashing into walls or any other vehicles to successfully complete each puzzle. Plan your moves ahead of time and put your drawing skills to the test as you aim to safely park cars of various colors.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/autb243qdmik6hgy48ua2dbsi61aq73e/",
        "category": "Arcade",
        "tags": "1 Player, Arcade, Car, Cars, Driving, Fun, Games, HTML5, Kids, Parking, Supercars",
        "thumb": "https://img.gamemonetize.com/autb243qdmik6hgy48ua2dbsi61aq73e/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47071",
        "title": "Turn Based",
        "description": "Turn Based is a 3D game aim to test your defence and attack by tanks where this game simulates a fight between tanks where you have to save much as possible of your tanks from getting destroyed and repear them each time they are low health.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/nwhdcyiilovm0p9f5569lyquqaas4thm/",
        "category": "Arcade",
        "tags": "3D, Action, Avoid, Clicker, Educational",
        "thumb": "https://img.gamemonetize.com/nwhdcyiilovm0p9f5569lyquqaas4thm/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47343",
        "title": "Pink Finn",
        "description": "Adventure time finn is on a new adventure with his new clothes dyed pink.This challenging adventure consists of 10 different levels and various enemies.Collect kiwi, watermelon and bananas to complete the levels and open the portal",
        "instructions": "W - Jump A - Move Left D - Move Right Double Jump Active",
        "url": "https://html5.gamemonetize.com/3djfypgi5130lc6o7hzaqxpc33h7t5e7/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Action, Adventure, Arcade, Cartoon, Cartoon Network",
        "thumb": "https://img.gamemonetize.com/3djfypgi5130lc6o7hzaqxpc33h7t5e7/512x384.jpg",
        "width": "720",
        "height": "320"
    },
    {
        "id": "47298",
        "title": "Only Up!",
        "description": "Only Up! is an exciting arcade game in which you have to overcome obstacles and conquer Inspired by the popular game Your task is to guide the character through a vertical labyrinth full of various obstacles. You must react quickly, jump accurately and climb up dexterously to avoid crashing into obstacles and falling down. As you progress through the various levels, you will encounter increasing difficulty and new challenges such as moving platforms and rotating obstacles.",
        "instructions": "PC Move - WASD Jump - Space Pause - P Restart - R Mobile Landscape Management is carried out by virtual joysticks on the screen",
        "url": "https://html5.gamemonetize.com/56gnglfyvrjub5gbxbzg6x471tao89db/",
        "category": "Arcade",
        "tags": "3D, Adventure, Arcade, Casual, Simulation",
        "thumb": "https://img.gamemonetize.com/56gnglfyvrjub5gbxbzg6x471tao89db/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "47385",
        "title": "Super Hero Race",
        "description": "Overcome many obstacles and reach the finish line to win the award and become the best. Facing various obstacles, choose the right hero to get to the finish line faster. Be careful not to stumble into traps.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/edergx7hlhyz8mzvdymrqvp6yrj4q8ff/",
        "category": "Arcade",
        "tags": "3D, Arcade, HTML5, Online",
        "thumb": "https://img.gamemonetize.com/edergx7hlhyz8mzvdymrqvp6yrj4q8ff/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "43843",
        "title": "Yatosan",
        "description": "Yatosan is a 2D cute little platformer where you have to collect the slices of cheese while avoiding the enemies, spikes, ground saws and reach the Exit door in order to go to the next level. There are 8 levels to play and the difficulty increases as you proceed.",
        "instructions": "Use WASD or Arrow keys for the player s movement Use W or Up arrow key twice for double jump ",
        "url": "https://html5.gamemonetize.com/svsosg1djiyd6sjm3lzw89kfwauofh1s/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Adventure, Animal, Arcade, Cartoon, Collecting, Cute, jump, Jumping, Pixel, Platform, Retro",
        "thumb": "https://img.gamemonetize.com/svsosg1djiyd6sjm3lzw89kfwauofh1s/512x384.jpg",
        "width": "800",
        "height": "640"
    },
    {
        "id": "45150",
        "title": "Simple Snake",
        "description": "Snake game is a classic arcade-style game where the player controls a growing snake. The goal of the game is to eat as many pieces of food as possible while avoiding colliding with the walls or the snake\\\\s own body. As the snake eats the food, it grows longer, making it harder to maneuver without running into itself. The game ends when the snake collides with a wall or its own body. It is a simple yet addictive game that has been enjoyed by players for decades.",
        "instructions": "Touch Controls or Keyboard Arrow Keys",
        "url": "https://html5.gamemonetize.com/bh2bcd2pjsmrqxpgur4myck3st8gctrj/",
        "category": "Arcade",
        "tags": "Classic, Collecting, Highscore, Mobile, Snake",
        "thumb": "https://img.gamemonetize.com/bh2bcd2pjsmrqxpgur4myck3st8gctrj/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47339",
        "title": "Tractor Trail Challenge",
        "description": "Tractor Trail Challenge is an adrenaline-pumping off-road adventure that puts your driving skills to the test. Jump behind the wheel of a powerful tractor and navigate treacherous terrains, including rugged mountains, dense forests, and muddy swamps. Tackle challenging obstacles like steep inclines, deep water crossings, and slippery slopes. With realistic physics and stunning graphics, this game offers an immersive experience. Customize your tractor with upgrades and unlock new levels as you master each course. Can you conquer the Tractor Trail Challenge and become the ultimate off-road champion?",
        "instructions": "WASD to drive Space to Brake CLICK to navigate through the menu",
        "url": "https://html5.gamemonetize.com/wl8unuugy3b3qobbsx7v2hvxkhaiiw2n/",
        "category": "Arcade",
        "tags": "3D, Adventure, Driving, tractor, WebGL",
        "thumb": "https://img.gamemonetize.com/wl8unuugy3b3qobbsx7v2hvxkhaiiw2n/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47035",
        "title": "Girl Money Rush",
        "description": "an exciting journey and shape your destiny by choosing from a myriad of captivating professions. In this thrilling adventure, you have the power to elevate your current career or embrace a fresh path brimming with possibilities. The ultimate goal is to reach the end of the day, but thats not all&mdash;along the way, youll encounter numerous money bills waiting to be collected. Keep your eyes peeled and seize every opportunity to amass a fortune!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/n3u4ol4qqhs4fo2mifr6qnr18bb7r28d/",
        "category": "Arcade",
        "tags": "Android, Collecting, iPad, iPhone, Mobile, Mouse, run, running",
        "thumb": "https://img.gamemonetize.com/n3u4ol4qqhs4fo2mifr6qnr18bb7r28d/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47277",
        "title": "WuggyMissy Change",
        "description": "Have you ever escaped from a forest with monsters before? yes you need to collect stars in this forest. Help sisters Wuggy and Missy on their adventure in the forest. join the adventure. Protect yourself from dangers in your adventures. How many monsters are everywhere from dangers. be careful monsters can kill you. You have to reach the finish line in order. Remember time is running. If the time in the game runs out, you lose. You can play with 2 friends in turns or you can play alone. dont stop run get the stars and reach the finish line.",
        "instructions": " Use WASD Keys to move and jump Collect the yellow stars first and then the green stars in order Both mobile and desktop playability ",
        "url": "https://html5.gamemonetize.com/p3q92k7ajuvyzkx6fvs28u41hx1v7phw/",
        "category": "Arcade",
        "tags": "2 Player, 2 Player Games, 2D, Action, Adventure, Android, Arcade, Mobile",
        "thumb": "https://img.gamemonetize.com/p3q92k7ajuvyzkx6fvs28u41hx1v7phw/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46056",
        "title": "Rise in Sky",
        "description": "Welcome to Rise in Sky Game! Protect fragile creatures from a variety of obstacles and falling objects. Clear your way as you reach higher and higher! Challenge your friends for the highest score or play Arcade mode to complete small missions!",
        "instructions": "Move your shield with one finger or mouse click to protect your player ",
        "url": "https://html5.gamemonetize.com/yfecjwaf7w3gdc0krjylm7dvtkd1iphs/",
        "category": "Arcade",
        "tags": "Arcade",
        "thumb": "https://img.gamemonetize.com/yfecjwaf7w3gdc0krjylm7dvtkd1iphs/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "47206",
        "title": "SkyTractor Parking",
        "description": "Welcome to SkyTractor Park, the ultimate thrill-seeking adventure where youll experience the adrenaline rush of maneuvering tractors on towering skyscrapers. Get ready to test your skills in this heart-pounding parking challenge as you navigate through precarious  and tight spaces. With realistic physics and stunning urban landscapes, SkyTractor Park offers an immersive and exhilarating gameplay experience. Show off your precision and control as you perform daring stunts and perfect your parking techniques. Can you conquer the urban  and become the master of SkyTractor Park? Get behind the wheel and embark on this sky-high trac",
        "instructions": "WASD to Drive SPACE to brake and click to interact with the menu",
        "url": "https://html5.gamemonetize.com/p55ys1z4esv4ostmoseqvddb05dauziw/",
        "category": "Arcade",
        "tags": "Arcade, Driving, Puzzle, tractor, WebGL",
        "thumb": "https://img.gamemonetize.com/p55ys1z4esv4ostmoseqvddb05dauziw/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46351",
        "title": "UFO Space Shooter 2",
        "description": "A simple space shooter in which you will shoot flying saucers of various colors. Dont let them hit your spaceship! The game gets progressively harder as more flying saucers start descending on the screen. Good luck!",
        "instructions": "Your spaceship auto shoots Move your spaceship by touching the screen and moving it left and right If on a desktop use the mouse to move your ship left and right ",
        "url": "https://html5.gamemonetize.com/d1u8qg70j2pph8hfl814zkvidaqghl93/",
        "category": "Arcade",
        "tags": "Shooting, Space, Spaceship",
        "thumb": "https://img.gamemonetize.com/d1u8qg70j2pph8hfl814zkvidaqghl93/512x384.jpg",
        "width": "480",
        "height": "854"
    },
    {
        "id": "46930",
        "title": "Ball Or Nothing",
        "description": "Ball Or Nothing is a 2D platformer where the goal is to get the ball to the blue door at the end of each level by jumping over rotating blades and spikes, dashing over gaps and blasting through walls! Use the dash and shooting ability to help you as you try to conquer all the levels. The abilities are only active for a limited amount of time before they will need to recharge, before they can be used again, use them wisely! Good Luck!",
        "instructions": "Left mouse button to use the buttons Press the left and right arrow keys to move Press the up arrow key to jump Hold the up arrow key to jump higher and further Press the F key to pause the game Press the E key to dash Press the R key to shoot a blue arr",
        "url": "https://html5.gamemonetize.com/q2gavgtvbq2nndjfkdi86upkcd5dhk5d/",
        "category": "Arcade",
        "tags": "2D, Ball, Platform",
        "thumb": "https://img.gamemonetize.com/q2gavgtvbq2nndjfkdi86upkcd5dhk5d/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "47142",
        "title": "Tower Tumble",
        "description": "Tower Tumble: Embark on a heart-pounding journey with this exhilarating 3D Jenga game. Challenge your dexterity and nerves of steel as you carefully extract blocks from the towering structure, delicately maintaining balance to prevent a catastrophic collapse. Engage in strategic thinking, weighing each move with precision and anticipation. Feel the adrenaline rush as the tower teeters and totters, the suspense building with every block removed. Can you defy gravity and emerge victorious, standing tall amidst the tumbling chaos? Brace yourself for a thrilling adventure in Tower Tumble!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/qmsjwajoy38yknnbq0s2vv0vpmjj4k66/",
        "category": "Arcade",
        "tags": "1 Player, 2 Player Games, 3D, Arcade, Block, Bricks, Clicker, HTML5",
        "thumb": "https://img.gamemonetize.com/qmsjwajoy38yknnbq0s2vv0vpmjj4k66/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "46409",
        "title": "Head Volley",
        "description": "Have you ever played head volleyball before? Now is the time to play head volleyball. You must win the volleyball match by fighting with your friend or by fighting with artificial intelligence. You should join this volleyball fun too. Play with different costumes and win this match. Its up to you to win the match. You can play for two players or single player.",
        "instructions": " The players head jumps in that direction when we jump Use the w and Up Arrow buttons to jump Just tap to play on mobile ",
        "url": "https://html5.gamemonetize.com/bmyr6k97k4bl6od1gczgn9bmg0owbya2/",
        "category": "Arcade",
        "tags": "1 Player, 2 Player, 2 Player Games, 2D, Arcade, Arena, Casual",
        "thumb": "https://img.gamemonetize.com/bmyr6k97k4bl6od1gczgn9bmg0owbya2/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "44673",
        "title": "Aroka",
        "description": "Aroka is a 2D anime themed platformer where you play as a cute anime girl who have to collect all of the bottles containing medicine while avoiding the enemy monsters, flying creatures, rotating blades, spikes, fire and reach the yellow flag in order to go to the next level. There are 8 levels to play and the difficulty increases as you proceed.",
        "instructions": "Use WASD or Arrow keys for the player s movement Use W or Up arrow key twice for double jump ",
        "url": "https://html5.gamemonetize.com/na5f71e3aeoiiln8z1bycn20qc338vvv/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Adventure, Anime, Arcade, Cartoon, Collecting, Cute, Girl, jump, Jumping, Pixel, Platform, Retro",
        "thumb": "https://img.gamemonetize.com/na5f71e3aeoiiln8z1bycn20qc338vvv/512x384.jpg",
        "width": "800",
        "height": "640"
    },
    {
        "id": "47031",
        "title": "MC Crazy Craft ",
        "description": "You will change the hours with its beautiful levels and very fluid gameplay. Have fun with this excellent parkour game. Remember, there are difficult traps that are beyond perfect in the game, you may have a little difficulty, but I have no doubt that you will not pass.",
        "instructions": "Hello the controls are very smooth I dont think you will have any problems Movement A D Jump W",
        "url": "https://html5.gamemonetize.com/0j89us4rd81f36rqaj9o2etdvjkyd9z1/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Action, Adventure, Arcade, Battle, Crafting, Crazy, HTML5, Minecraft",
        "thumb": "https://img.gamemonetize.com/0j89us4rd81f36rqaj9o2etdvjkyd9z1/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "44495",
        "title": "House Renovation Master Game",
        "description": "House Renovation Master is a casual idle game of building houses. Want to become a real estate tycoon? Buy old houses, renovate them into new ones and sell them for money. Fix the damaged furniture and floors and give the walls a new paint job. This is not a small project, upgrade your character to be more efficient! May you become a real estate tycoon soon!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/5aq47nhnf6lzjnalhe9dvadwx7wa7eoq/",
        "category": "Arcade",
        "tags": "3D, Boys, Business, Kids, Relaxation",
        "thumb": "https://img.gamemonetize.com/5aq47nhnf6lzjnalhe9dvadwx7wa7eoq/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "46956",
        "title": "Sky Emoji: Flutter",
        "description": "Sky Emoji: Flutter is an enchanting mobile game that takes you on a whimsical journey through the vast skies of imagination. As a cheerful and vibrant emoji, you must navigate through an assortment of obstacles by fluttering your wings with grace and precision. Immerse yourself in the ethereal beauty of the games atmospheric visuals and soothing melodies. Unlock various emoji characters with unique fluttering styles and embark on challenging quests to earn rewards. Prepare for a delightful adventure filled with joyful flutters, captivating challenges, and a sky full of endless possibilities. Let your emotions soar with Sky Emoji: Flutter!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/07y8lnps39i8w7l6g0bt9ifscnhbv7l6/",
        "category": "Arcade",
        "tags": "1 Player, 2D, Adventure, Arcade, Bird, Jumping, Mobile",
        "thumb": "https://img.gamemonetize.com/07y8lnps39i8w7l6g0bt9ifscnhbv7l6/512x384.jpg",
        "width": "800",
        "height": "600"
    }
]