[
    {
        "id": "51938",
        "title": "Electronic Pop It",
        "description": "Introducing the electrifying web version of the beloved Pop It toy &ndash; a sensory delight that transcends boundaries! Immerse yourself in the world of tactile satisfaction with our innovative electronic rendition, featuring four exciting game modes: Breakthrough, Memory, Scoring, and Multiplayer.",
        "instructions": "Just pop it ",
        "url": "https://html5.gamemonetize.com/z3lunh8ml6w3yhbje8c21008bay1ruax/",
        "category": "Clicker",
        "tags": "Bubble, Click, Point And Click",
        "thumb": "https://img.gamemonetize.com/z3lunh8ml6w3yhbje8c21008bay1ruax/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "51802",
        "title": "Pop It Party",
        "description": "Pop It Party is a fun relaxing game and a unique game to play on. This is a super relaxing game to play for hours; we have got different shapes of pop gadgets, click on the pops to smash them and clear the board. Website Developer <a href='https://www.giugames.com/'>https://www.giugames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/v5ucev9vha3kgt6ftdhket0a5h7wwhfl/",
        "category": "Clicker",
        "tags": "Family, free html5 games for your website, HTML, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/v5ucev9vha3kgt6ftdhket0a5h7wwhfl/512x384.jpg",
        "width": "1280",
        "height": "800"
    },
    {
        "id": "51624",
        "title": " Skibidi Toilet Seasons 3 FNF",
        "description": "FNF Skibidi Invasion introduces a unique musical challenge for Boyfriend as he faces one of his most peculiar adversaries to date! Engage in wacky, up-tempo rap battles against Skibidi Toilet, a fictional character with a quirky blend of human and toilet elements. In this mod, Boyfriend must prove his singing prowess by tackling distinct musical challenges against Skibidi Toilet, who is renowned as the hero of numerous videos on the Youtube channel DaFuq!?Boom! The inspiration for the mods music comes from the Skibidi Toilet series, comprising 44 episodes where the distinctive track Skibidi Dop Dop Yes Yes Yes! is prominently featured. Thi",
        "instructions": "Use Mouse To Play or arrow keys in keyboard ",
        "url": "https://html5.gamemonetize.com/cosa34aqlsi7ply14qaat1bsu29tftkr/",
        "category": "Clicker",
        "tags": "Memory, Movie, New, Point And Click, Puzzle",
        "thumb": "https://img.gamemonetize.com/cosa34aqlsi7ply14qaat1bsu29tftkr/512x384.jpg",
        "width": "600",
        "height": "800"
    },
    {
        "id": "51804",
        "title": "Mini Bartender Game",
        "description": "Move the bartenders hand to collect the largest number of glasses with which you can mix different drinks, decorate with many caves and attractive objects. Be careful because you will come across some obstacles that could prevent you from reaching your goal in each level with complete bases.Website Developer <a href='https://kiz10.com/'>https://kiz10.com/</a>",
        "instructions": "Controls Use the mouse to move on Desktop Tap the screen and drag to move on mobile devices ",
        "url": "https://html5.gamemonetize.com/cmqty6741av9dx7dxsfw7yulhj45qqgr/",
        "category": "Clicker",
        "tags": "3D Games, Hypercasual, kiz10, Mouse",
        "thumb": "https://img.gamemonetize.com/cmqty6741av9dx7dxsfw7yulhj45qqgr/512x384.jpg",
        "width": "550",
        "height": "750"
    },
    {
        "id": "51611",
        "title": "Glactic Saucer",
        "description": "Galactic Saucer is an exhilarating game where players tap the screen to soar into space and journey towards different planets. However, caution is key! Players must navigate carefully to avoid collisions with asteroids, creating a thrilling and engaging adventure.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/za8ve12x4ab0bbb586ylouwdia0tzzm4/",
        "category": "Clicker",
        "tags": "1 Player, 2D, Adventure, Android, Arcade, Casual, Click, Clicker, iPhone, onetouch, touch, touchscreen",
        "thumb": "https://img.gamemonetize.com/za8ve12x4ab0bbb586ylouwdia0tzzm4/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "51526",
        "title": "World of Alice   My Dog",
        "description": "World of Alice - My Dog World of Alice - My Dog is an educational game developed for children in which you can have the experience of having a pet, you will be able to feed it, play with it, bathe it and give it medical care. Excellent resource for Preschool Education. In World of Alice learning is fun. Game developed by: Nau.kids",
        "instructions": "Click on the corresponding button to play eat bathe or get medical care ",
        "url": "https://html5.gamemonetize.com/022a0joskxn9psxztolkpn0gtxsduwgw/",
        "category": "Clicker",
        "tags": "Animal, Baby, Baby Games, Best Games, Cartoon, Cute, Educational, free games for your site, free games for your website, free html5 games for your website, Games, games for your website, html games for your website, html5 games for your site",
        "thumb": "https://img.gamemonetize.com/022a0joskxn9psxztolkpn0gtxsduwgw/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "47512",
        "title": "World of Alice   Farm Animals",
        "description": "World of Alice - Farm Animals With the help of Alice, learn in a fun way which animals live on the farm and their names from your mobile phone, tablet or computer. Content: chicken, cow, rabbit, sheep, dog, donkey, pig, cat, duck, goat, turkey and horse. Excellent resource for Preschool Education. By: Nau.kids",
        "instructions": "Click on the displayed animal to see and hear its name ",
        "url": "https://html5.gamemonetize.com/85ensryy753w4gprkwwl4h4rpz6yvjz1/",
        "category": "Clicker",
        "tags": "Animal, Cartoon, Cat, Chicken, Click, Farm, Game, Horse, HTML5, Kids, Letters, Mobile, School, Word",
        "thumb": "https://img.gamemonetize.com/85ensryy753w4gprkwwl4h4rpz6yvjz1/512x384.jpg",
        "width": "450",
        "height": "800"
    },
    {
        "id": "51420",
        "title": "Arrow Hit",
        "description": "Embark on an exhilarating adventure in the virtual realm with Arrow Hit, the ultimate arcade game that puts your archery skills to the test! Immerse yourself in a captivating world where precision, timing, and accuracy are the keys to victory.",
        "instructions": "Mouse click or tap to play ",
        "url": "https://html5.gamemonetize.com/k2mc55bpl19x1bfumfotpd0jicr18gso/",
        "category": "Clicker",
        "tags": "Arcade, Casual, Clicker, free html5 games for your website, HTML, html games for your website, HTML5, html5 games, html5 games for your site, onetouch, Shooting, Skill, weapons",
        "thumb": "https://img.gamemonetize.com/k2mc55bpl19x1bfumfotpd0jicr18gso/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "51223",
        "title": "Clickerdon",
        "description": "The aim of the game is simple - press the button. The more times you click on the button, the more points you earn and the sooner you will lead the Clickerdon rating. There is no strategy, no puzzle - just hardcore and just press. The fastest Clickerdon wins.",
        "instructions": "There are three buttons each of which has the ability to increase your world ranking There are also 4 accelerators that are described inside the game The essence of the game is very simple - your goal is the top of the ranking reach the end if you can",
        "url": "https://html5.gamemonetize.com/owkwrqwsgr8b4na6o9ygeb4g0n3yla63/",
        "category": "Clicker",
        "tags": "1 Player, 2D, Android, Best, Click, Clicker, iPhone, unity, Unity3D",
        "thumb": "https://img.gamemonetize.com/owkwrqwsgr8b4na6o9ygeb4g0n3yla63/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50189",
        "title": "Xmas Breakout",
        "description": "Welcome to Xmas Breakout game! Move left and right to control the ball and start beaking christmas items. Clear all the screen to unlock the next level. Have fun!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/sa7bc26nqbkqz1uheyajpy4ihu23h1yw/",
        "category": "Clicker",
        "tags": "Arcade, Bricks, Christmas",
        "thumb": "https://img.gamemonetize.com/sa7bc26nqbkqz1uheyajpy4ihu23h1yw/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "50714",
        "title": "Pixel Demolisher Cannon",
        "description": "In Pixel Demolisher Cannon, we destroy various objects consisting of pixel maps. Shoot bombs at objects and make the explosions bigger. Upgrade your Cannon with the money you earn and make it more effective and powerful! You can also earn much more money on Bonus Maps.",
        "instructions": "Use Mouse to adjust the angle of the Cannon ",
        "url": "https://html5.gamemonetize.com/rc7y1jaqoouace0d1xbaj2dstj3uup0i/",
        "category": "Clicker",
        "tags": "Fun, Funny, Pixel, Point And Click",
        "thumb": "https://img.gamemonetize.com/rc7y1jaqoouace0d1xbaj2dstj3uup0i/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "51219",
        "title": "Amazing Gold Miner",
        "description": "Embark on an exciting mining adventure with Amazing Gold Miner! Dig deep into the earth, navigate treacherous obstacles, and collect precious gold and gems. Use your skill and strategy to grab as much treasure as possible within the time limit. With addictive gameplay and stunning graphics, this game is a true gem!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/t8k58aanuju13yejjbwp9oh84avpxdzb/",
        "category": "Clicker",
        "tags": "1 Player, Adventure, free html5 games for your website, HTML5, html5 games, Online",
        "thumb": "https://img.gamemonetize.com/t8k58aanuju13yejjbwp9oh84avpxdzb/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51147",
        "title": "Archer Castle",
        "description": "Create your army, use magic and soldiers to block invading monsters, challenge level bosses, get gold coin rewards, and purchase powerful magic.",
        "instructions": "Click To Play",
        "url": "https://html5.gamemonetize.com/4bqi0lez8o1hpw6b17v853rw4q0axxx8/",
        "category": "Clicker",
        "tags": "Castle, Click, Defense",
        "thumb": "https://img.gamemonetize.com/4bqi0lez8o1hpw6b17v853rw4q0axxx8/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50983",
        "title": "Match Card",
        "description": "Ignite your brain cells with the mind-boggling Memory Game! Flip cards, find matching pairs, and feel like a mental acrobat. Prove your memory skills and unleash your inner genius. But beware, one false move and your brain might explode with confusion (just kidding, it wont, but its still super fun)!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/h3heboxsl4hsd2ot943kclmwsxinbpbj/",
        "category": "Clicker",
        "tags": "1 Player, Card",
        "thumb": "https://img.gamemonetize.com/h3heboxsl4hsd2ot943kclmwsxinbpbj/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51057",
        "title": "Santa Ice Jump",
        "description": "Welcome to Santa Ice Jump winter game! Tap Left and right to jump from iceberg to other one and collect bounties along your way like cookies and candies. Collect gift boxes to revive when you fall from iceberg edge. Can you get the highest score?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/26j043x0hrjq19mxjq3kshj1n27gdox8/",
        "category": "Clicker",
        "tags": "Christmas, Santa, Santa Claus, Winter",
        "thumb": "https://img.gamemonetize.com/26j043x0hrjq19mxjq3kshj1n27gdox8/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "44261",
        "title": "Skibidi Elastic Head",
        "description": "In the entertaining puzzle game Skibidi Elastic Head, your goal is to assist the Skibidi Toilet in escaping from the cameraman and completing each level. Play the part of a courageous skibidi toilet and see if you can elude the camera crew. Make sure you finish each level before the alarm goes off; if you do, youll get a lot of cash, but if you pause for too long, youll be caught and killed. You may access a wide variety of skins for your skibidi, including characters from Rick and Morty, Five Nights at Freddys, Monster Rainbow, and many more.Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "DESKTOP CONTROLS Use the mouse to stretch the skibidi toilets head across the map TOUCH CONTROLS Tap the screen to stretch the skibidi toilets head across the map ",
        "url": "https://html5.gamemonetize.com/mzhcqhok1b5whltst1sscbgd85ewzn2q/",
        "category": "Clicker",
        "tags": "Interactive, kiz10, Levels, Puzzle",
        "thumb": "https://img.gamemonetize.com/mzhcqhok1b5whltst1sscbgd85ewzn2q/512x384.jpg",
        "width": "900",
        "height": "500"
    },
    {
        "id": "50950",
        "title": "Strong Fighter",
        "description": "Fight your opponent and destroy him with your ultimate punch! In this action role playing game you can chose your strategy to become a great fighter. Its your choice to fight like a martial artist, a grappler or like a shaolin master. And become the ultimate dojo kung fu master! If you can beat them you can beat everyone!",
        "instructions": "Mouse Clicker",
        "url": "https://html5.gamemonetize.com/nxotysqbir7qxsp2qw432ybzfiji436v/",
        "category": "Clicker",
        "tags": "Action, Clicker, Fighting, Street Fighting",
        "thumb": "https://img.gamemonetize.com/nxotysqbir7qxsp2qw432ybzfiji436v/512x384.jpg",
        "width": "600",
        "height": "960"
    },
    {
        "id": "50889",
        "title": "Santa Swing",
        "description": "Winter is Here! Welcome to Santa Swing Game. Tap to hook and make incredible jumps using the rope. Avoid falling and every obstacle that stands in your way. Can you make it to the finish line?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/w6npanu26kj9ieqeg5kclckgedc79kyw/",
        "category": "Clicker",
        "tags": "Christmas, Santa, Santa Claus, Winter",
        "thumb": "https://img.gamemonetize.com/w6npanu26kj9ieqeg5kclckgedc79kyw/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "39808",
        "title": "Fireball Vs Ice Cream",
        "description": "Enjoy a new and exciting online game &ndash; Fireball Vs Ice Cream! This game is perfect for those who want to have fun and challenge themselves. Test your skills by jumping and escaping from the fireballs. Can you make it to the end? Play now and find out!",
        "instructions": "tap to play",
        "url": "https://html5.gamemonetize.com/xymznd2m8001gvwww7vebyzjr4biw7os/",
        "category": "Clicker",
        "tags": "2D, Arcade, Best, Fun, Funny, HTML, HTML5, Ice, NapTech Games, Online",
        "thumb": "https://img.gamemonetize.com/xymznd2m8001gvwww7vebyzjr4biw7os/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "50225",
        "title": "Capybara Beaver Evolution: Idle Clicker",
        "description": "Capybara-Beaver Evolution: Idle Cliker - a game with Capybara or Beaver? Get ready to have fun with a capybara or beaver, start playing it right now! The gameplay in Capybara-Beaver Evolution: Idle Cliker gives you the opportunity to play endlessly. Become a Capybara-Beaver God when you get 200 millions coins!",
        "instructions": "Mouse click or tap to play Get as many coins as possible by clicking on the CAT When you get a lot of coins go to the store and use your coins bull Watch your CAT evolve Dont forget about the gift that gives 30x to your clicks ",
        "url": "https://html5.gamemonetize.com/bz6qvqpnf9fgmomalylvms1w9iwmx1ww/",
        "category": "Clicker",
        "tags": "1 Player, 2D, Android, Animal, Boys, Click, Clicker, Game, Games",
        "thumb": "https://img.gamemonetize.com/bz6qvqpnf9fgmomalylvms1w9iwmx1ww/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "50209",
        "title": "Super Mario Stacks",
        "description": "Here comes the super plumber! Tap left and right to jump over stacks! Play quickly before the stack disappear and do not fall from edges. Collect boxes to earn points and mushroom to revive after the fall! Good luck!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/9k2zdddsiz73bqbhlmf9duz21iwf570x/",
        "category": "Clicker",
        "tags": "Mario, Superhero",
        "thumb": "https://img.gamemonetize.com/9k2zdddsiz73bqbhlmf9duz21iwf570x/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "50173",
        "title": "Eternal Fly",
        "description": "Eternal Fly is game created by Eternal Play Networks. Published by Eternal Organizer platform. Leapy the dragon is mascot of Eternal Organizer platform. all of this brand copyright game goes to Eternal Organizer. under licensed company PT.Eternal Indonesia Kreatif",
        "instructions": "Touch Screen Mouse Click",
        "url": "https://html5.gamemonetize.com/uy798mpibrtlfxb24zwf3pcf7p6c5d0m/",
        "category": "Clicker",
        "tags": "1 Player, 2D",
        "thumb": "https://img.gamemonetize.com/uy798mpibrtlfxb24zwf3pcf7p6c5d0m/512x384.jpg",
        "width": "600",
        "height": "800"
    },
    {
        "id": "50033",
        "title": "DevilRoom",
        "description": "DevilComing is a 2D survival gamePlayers will play a human and survive in Devils worldPlayers can use generators, turrets, and defense gates to resist and defeat DevilDefeat Devil, player can achieve victory.",
        "instructions": "PC Mouse click to play Phone Click on the screen",
        "url": "https://html5.gamemonetize.com/t3h0oichgcbsmug6wqz96bngj5bltwhe/",
        "category": "Clicker",
        "tags": "2D, Ghost, Halloween, survival",
        "thumb": "https://img.gamemonetize.com/t3h0oichgcbsmug6wqz96bngj5bltwhe/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "50117",
        "title": "CAT EVOLUTION: CLICKER",
        "description": "CAT EVOLUTION: CLICKER - a game with cats. Get ready for endless fun and start playing it right now! The gameplay in CAT EVOLUTION: CLICKER gives you the opportunity to play endlessly. Become a Cat God when you get 5 BILLION coins!",
        "instructions": "Get as many coins as possible by clicking on the CAT When you get a lot of coins go to the store and use your coins bull Watch your CAT evolve Dont forget about the gift that gives 30x to your clicks ",
        "url": "https://html5.gamemonetize.com/wdn9zu5bree9jff4zo17yc1ga9cexwlq/",
        "category": "Clicker",
        "tags": "Animal, Arcade, Cat, Click, Clicker",
        "thumb": "https://img.gamemonetize.com/wdn9zu5bree9jff4zo17yc1ga9cexwlq/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "48828",
        "title": "Aim Locker",
        "description": "A small game about aim. In this game you have 60 seconds to destroy as many balls as possible. 3 levels of balls (points) 1 - Small ones give the most points for them. 2 - The average for them is also not bad. 3 - Large ones give less points for them. Set new records and share them with your friends, improve your aim every day.",
        "instructions": "all you need is to click on the balls and collect points",
        "url": "https://html5.gamemonetize.com/qwqxvclw65knxgmbbtyhxrsv25yk687y/",
        "category": "Clicker",
        "tags": "1 Player, 2D, Action, Android, Ball, Best Games, Boys",
        "thumb": "https://img.gamemonetize.com/qwqxvclw65knxgmbbtyhxrsv25yk687y/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49473",
        "title": "Grimace Blocks",
        "description": "Welcome to Grimace Blocks physics puzzle game. Tap or click on wooden blocks to eleminate them but remember to leave grimace sitting on 1 block and dont let him fall on the grass. Have fun unlocking more than 40 challenging levels! Website Developer <a href='https://vodogame.com/'>https://vodogame.com/</a>",
        "instructions": "Tap or mouse click to eleminate blocks ",
        "url": "https://html5.gamemonetize.com/nxjq2ij1aliq4tfwfwkeire8h7qnrlm7/",
        "category": "Clicker",
        "tags": "Grimace, Grimace Shake, Physics",
        "thumb": "https://img.gamemonetize.com/nxjq2ij1aliq4tfwfwkeire8h7qnrlm7/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49255",
        "title": "Grimace Jumper",
        "description": "Welcome to Grimace Jumper Game! Tap or click to jump and try to get a high score. Be careful and do not fall from edges. Can you get the highest score? Enjoy!",
        "instructions": "Tap and hold or mouse click to jump",
        "url": "https://html5.gamemonetize.com/74s5efwpl6zz9g6kw9iwgvfe9lcpmohn/",
        "category": "Clicker",
        "tags": "Grimace, Grimace Shake",
        "thumb": "https://img.gamemonetize.com/74s5efwpl6zz9g6kw9iwgvfe9lcpmohn/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "49031",
        "title": "My Sliding Blocks",
        "description": "Move the blocks to the stars of the same color. Time is not limited. Good luck!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/z28ckv5057loeuw7ill8ih14s51pb86j/",
        "category": "Clicker",
        "tags": "Arcade, Block, HTML5, Online, Puzzle",
        "thumb": "https://img.gamemonetize.com/z28ckv5057loeuw7ill8ih14s51pb86j/512x384.jpg",
        "width": "800",
        "height": "480"
    },
    {
        "id": "48955",
        "title": "Earth Clicker: Idle Clicker",
        "description": "Dive into cosmic riches with Earth Clicker , the ultimate incremental clicker game! Click your way to wealth by tapping on Earth, collect coins , and visit the in-game shop to unlock powerful upgrades. Conquer 110 levels , complete epic quests , and turbocharge your earnings with random asteroid drops . Immerse yourself in captivating pixel art graphics , connect with fellow players on Instagram at @earthclickerofficial , and stay engaged with regular updates . Enjoy Earth Clicker on multiple platforms , and its all FREE! Join the cosmic adventure today!",
        "instructions": " Tap or Click Use your finger or mouse to tap or click on the Earth to collect coins and advance in the game ",
        "url": "https://html5.gamemonetize.com/7m6h616gqacdj70c5kjh8271zgnplfdr/",
        "category": "Clicker",
        "tags": "1 Player, Clicker, Fun",
        "thumb": "https://img.gamemonetize.com/7m6h616gqacdj70c5kjh8271zgnplfdr/512x384.jpg",
        "width": "640",
        "height": "360"
    },
    {
        "id": "48516",
        "title": "Skibidi Smasher",
        "description": "Skibidi Toilet Smasher is an exciting alien-killing game where you have to defend your area without getting infected! Kill as many Skibidi Toilet and they will become faster on further waves, so boost your reflexes and kill the fast-paced game!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/2qexn83qkjlbjo55cg9brqgadhlbk9uv/",
        "category": "Clicker",
        "tags": "Alien, Clicker, HTML, Mobile, Shooting, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/2qexn83qkjlbjo55cg9brqgadhlbk9uv/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "47705",
        "title": "Mini Monkey Mart",
        "description": "Monkeys need a grocery store for shopping. Open your mini market right now. What is their favorite food? Of course, you should start growing bananas first. Collect the ripening bananas and place them on the counter. Here, the customers have already started to arrive. Collect the eggs of the chickens you feed with bananas and place them on the counter as well. Start selling food such as banana puree canned food, flour, bread, milk with the money you have saved. Lets run to the most fun of shopping!",
        "instructions": "Movement Mouse LEFT CLICK Control your monkey with the mouse start the game by growing bananas Buy new products and stalls with the money you have saved ",
        "url": "https://html5.gamemonetize.com/epq7wp0eex4cz9qfj8yjyt0atj9hz8tb/",
        "category": "Clicker",
        "tags": "Animal, Hypercasual, Monkey, Shopping",
        "thumb": "https://img.gamemonetize.com/epq7wp0eex4cz9qfj8yjyt0atj9hz8tb/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "48770",
        "title": "Grimace And Skibidi Whack A Mole",
        "description": "This is a fun game for You, your friends and your family! Your objective is to hit all the popping Grimaces to get points the more you can! Do you like Whack A Mole? then you will love this game too! Enjoy it!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/d072erc0bmwxni5l601mant1z5na8gxs/",
        "category": "Clicker",
        "tags": "Boy, Grimace, Grimace Shake, HTML, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/d072erc0bmwxni5l601mant1z5na8gxs/512x384.jpg",
        "width": "1024",
        "height": "600"
    },
    {
        "id": "48570",
        "title": "Skibidi Hop",
        "description": "Its just a really simple endless hyper casual game! Help Skibidi and try to avoid the Red triangle when you run; is simple: you just make a jump! but you run in a planet so you need to resist the more you can and sign the best record possible! This game i suitable for every one, enjoy it!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/l284s89f3akdbsqmh0aeembigze9nisz/",
        "category": "Clicker",
        "tags": "HTML, HTML5, jump, Jumping, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/l284s89f3akdbsqmh0aeembigze9nisz/512x384.jpg",
        "width": "600",
        "height": "1024"
    },
    {
        "id": "48594",
        "title": "Grimace Wood Cutter",
        "description": "Happy Birthday Grimace! In this game you need to chop wood and avoid the branches. It could be an easy task? Its easy to play but hard to master! So help Grimace as every lumberjack does and chop the tree as fast the more you can! &middot; One-touch control system! &middot; Simple and addictive gameplay! Hmmm... So Delicious!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/67mgdpiz125xptemyjku86m0hr0vlonv/",
        "category": "Clicker",
        "tags": "Arcade, Grimace, Grimace Shake, HTML, Mobile",
        "thumb": "https://img.gamemonetize.com/67mgdpiz125xptemyjku86m0hr0vlonv/512x384.jpg",
        "width": "768",
        "height": "1024"
    },
    {
        "id": "48420",
        "title": "Grimace Shake Classify",
        "description": "Grimace Monster Classify is a color sort game. You are working for grimace monster to win your life back. Help him to match colors correctly into the grimace shake. If you fail you will be his slave forever!!",
        "instructions": "Tap the screen to switch the gate to match the ball color you will have different ball colors and each color should go to a specific gate ",
        "url": "https://html5.gamemonetize.com/p7pgiqz0ourqj87643n1kalakae0pmyv/",
        "category": "Clicker",
        "tags": "1 Player, 2D, Best, Best Games, Boy, Boys, Casual, Click, Grimace",
        "thumb": "https://img.gamemonetize.com/p7pgiqz0ourqj87643n1kalakae0pmyv/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48423",
        "title": "Vape Addict",
        "description": "Experience the ultimate vaping adventure in our Vape Simulator Game! Dive into a world of endless options, where you can explore various vape models, fine-tune your vaping experience, and even earn virtual currency to unlock new devices and customize your vaping style. Immerse yourself in the captivating world of vapes, where you control every aspect of your vaping journey.",
        "instructions": "Choose Your Vape Start your vaping journey by selecting from a wide range of vape models Each model offers a unique vaping experience from classic designs to cutting-edge innovations Adjust Your Heat Settings Achieve the perfect vape by adjusting t",
        "url": "https://html5.gamemonetize.com/jvwvg59yl5edqw4rschfxsrjmtbncytt/",
        "category": "Clicker",
        "tags": "1 Player, 3D, Best, Best Games, Click, Color, Fun, Funny, Games, Simulation, Simulator",
        "thumb": "https://img.gamemonetize.com/jvwvg59yl5edqw4rschfxsrjmtbncytt/512x384.jpg",
        "width": "1600",
        "height": "900"
    },
    {
        "id": "46320",
        "title": "Crafty Town Merge City",
        "description": "The latest strategy is here! If you want to build a town or rule your own kingdom, do it now! Here, you can build a house and turn it into the biggest castle in your kingdom. If you like architecture or strategy games, I guess you do, you will have a good time! Playing the new kingdom builder is absolutely free! Make your empire great!",
        "instructions": "Slide on the screen to merge the same buildings and get a higher-level building ",
        "url": "https://html5.gamemonetize.com/zjmlmxofq5r7vagyrrz714ybrutwvt8k/",
        "category": "Clicker",
        "tags": "Android, Best, Boy, Casual, city, Hypercasual, Kids, Mobile, Relaxation",
        "thumb": "https://img.gamemonetize.com/zjmlmxofq5r7vagyrrz714ybrutwvt8k/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "45394",
        "title": "Merge Miners 3D",
        "description": "Merge Miners 3D is a classic fusion game that is very popular with the public. Easy to pick up and play! Get rich by buying tools, upgrading them, and letting physics do the rest. Dont forget to synthesize the same level of tools to speed up success! Start your mining empire today! Have fun!",
        "instructions": "Left mouse to buy spades drag to merge the same spades and get a higher level spade ",
        "url": "https://html5.gamemonetize.com/jytyxk63rx85lrko91pe76d8727wygtm/",
        "category": "Clicker",
        "tags": "1 Player, 3D, Android, Casual, Hypercasual, Kids, Mine, Miner, Mobile",
        "thumb": "https://img.gamemonetize.com/jytyxk63rx85lrko91pe76d8727wygtm/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "48023",
        "title": "Skibidi Survival Challenge ",
        "description": "Skibidi Survival Challenge is a fast-paced, endless roadrunner survival game. In this game, you must control a Skibidi dancer as they run down a never-ending road, dodging obstacles and collecting coins. The longer you survive, the more points you earn. But be careful! If you hit an obstacle or fall off the road, its game over.",
        "instructions": "Desktop Use the right click button to go up or down Mobile Tap on the screen to go up or down ",
        "url": "https://html5.gamemonetize.com/01uzxw3lvdpouep1q0u2hl5rb6benr7a/",
        "category": "Clicker",
        "tags": "2D, Adventure, Arcade, Casual, Classic, Fun, Game, Games, HTML, HTML5, Hypercasual, Online, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/01uzxw3lvdpouep1q0u2hl5rb6benr7a/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "4129",
        "title": "Elemental Rescue Adventure",
        "description": "Elemental Rescue Adventure is a captivating online platform game that will take you on an exciting adventure in the digital world and provide you with hours of fun and amusement. This game takes its cues from the popular film Elemental and puts players in the role of the heroic protagonist, Wade, as he attempts to free the beautiful Ember from her captors by completing a series of increasingly difficult stages. Elemental Rescue Adventure, a free game, combines Disneys enchantment with exciting game play.",
        "instructions": "Controls Desktop Use the WASD keys to move and Jump Touch controls Use Buttons Game to move and Jump",
        "url": "https://html5.gamemonetize.com/3i3r6o3wtan90k2tdtvngpnu8o3f7o5a/",
        "category": "Clicker",
        "tags": "Jumping, Level, Platform, Timing",
        "thumb": "https://img.gamemonetize.com/3i3r6o3wtan90k2tdtvngpnu8o3f7o5a/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47152",
        "title": "Flopppy Skibidi",
        "description": "Welcome to an amazing game of the famous Skibidi Toilet. The rules are very simple : Tap to fly and pass between obstacles without touching them. Avoid the flying TV and eat the brown poop to earn point. Can you get the highest score? Lets begin!",
        "instructions": "Tap on screen or mouse click to fly and avoid obstacles",
        "url": "https://html5.gamemonetize.com/vw94czwz209sibmjmjf9mn3svcrdyv7g/",
        "category": "Clicker",
        "tags": "fly, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/vw94czwz209sibmjmjf9mn3svcrdyv7g/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "48074",
        "title": "Skibidi Wood Cutter",
        "description": "In this game you need to chop wood and avoid the branches. It could be an easy task? Its easy to play but hard to master! So help Skibidi Toilet as every lumberjack does and chop the tree as fast the more you can! &middot; One-touch control system! &middot; Simple and addictive gameplay!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/9a9joxk6z8fdxy04zskmw0s80lbkyzwr/",
        "category": "Clicker",
        "tags": "Casual, HTML5, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/9a9joxk6z8fdxy04zskmw0s80lbkyzwr/512x384.jpg",
        "width": "768",
        "height": "1024"
    },
    {
        "id": "48002",
        "title": "Blast The Ball",
        "description": "It is a fun game that combines speed and skill Decoupled. Your goal is to explode the number of balls set in 100 different levels by firing. improve your strategy with 10 different weapons and 4 bonuses. Get high scores, get to the top of the leaderboard!",
        "instructions": "Move with A and D or LEFT and RIGHT ARROWS or LEFT CLICK ",
        "url": "https://html5.gamemonetize.com/dcsqar3hkv4dhesei2uth6w166s0yre0/",
        "category": "Clicker",
        "tags": "2D, Ball, Bubble Shooter, HTML5, Kids, Shooter, Skill",
        "thumb": "https://img.gamemonetize.com/dcsqar3hkv4dhesei2uth6w166s0yre0/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47578",
        "title": "Noob Chicken Farm Tycoon",
        "description": "Help Noob run a chicken farm: breed and upgrade chickens, buy useful tools for the farm. Put on the heads of the feathered masks of Noob, zombies, demons, cats and more. Tired of chicken? Swap them out for a Skibidi Toilet that makes toilet paper instead of eggs. Or buy a dinosaur - its eggs are bigger and more expensive to sold! Build a farm in different locations: in the forest, on sea days or in hell. Protect your chickens from the fox - buy a dog to protect the birds. Compete with other chicken breeders to see who manages the best chicks!",
        "instructions": "Mouse click oUse your mouse or click and swipe to control chickens collect eggs buy goods or purchase upgrades r tap to play",
        "url": "https://html5.gamemonetize.com/awv0pcqjg5wtq21l6fz048q3wqzq1m2s/",
        "category": "Clicker",
        "tags": "1 Player, 2D, Arcade, Best, Brain, Business, Casual, Chicken, Classic, Clicker, Collecting, Minecraft, Pixel, Zombie",
        "thumb": "https://img.gamemonetize.com/awv0pcqjg5wtq21l6fz048q3wqzq1m2s/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47940",
        "title": "Flappy Skibidi Toilet",
        "description": "Help Skibidi Toilet to avoid the pipes obstacles in this flappy bird game and try to survive as long as you can to sign the best possible score! Enjoy it!",
        "instructions": "You can use the mouse click button or tap the screen to play ",
        "url": "https://html5.gamemonetize.com/zku0lg98kwfjy1cu7jjdkcrop0qrvzvd/",
        "category": "Clicker",
        "tags": "Arcade, Boy, Flight, HTML, HTML5, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/zku0lg98kwfjy1cu7jjdkcrop0qrvzvd/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "47922",
        "title": "Hungry Shark Vs Skibidi",
        "description": "Hungry Shark vs. Skibidi Jump Challenge Game is a fun and addictive game that is sure to keep you entertained for hours on end. With its simple but addictive gameplay, variety of different sharks to choose from, and Skibidi Jump Challenge event, there is something for everyone to enjoy.",
        "instructions": "Desktop Click left button on the mouse to jump and survive from shark Mobile Tap on the mobile screen to jump and survive from shark ",
        "url": "https://html5.gamemonetize.com/kr1ychpm2es9yd93rq6tsxx7tusi8swk/",
        "category": "Clicker",
        "tags": "2D, Game, Games, HTML, HTML5, jump, Jumping, Online, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/kr1ychpm2es9yd93rq6tsxx7tusi8swk/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "47855",
        "title": "Floppy Skibidi",
        "description": "In the tough arcade game Floppy Skibidi, you take control of a flying toilet. Your objective is to avoid striking any pipes as you soar through the air between them. As you advance, the pipes will be closer together, making the game harder and harder.",
        "instructions": "Desktop Use the right click button of the mouse to jump Mobile Tap on the screen to jump Controls and Indicators The scores and levels are shown in the upper middle of the screen ",
        "url": "https://html5.gamemonetize.com/nm7q4xeh80joyap5ezh1b6lfub0lyh8c/",
        "category": "Clicker",
        "tags": "2D, Action, Adventure, Android, Cartoon, Fun, Funny, Game, HTML, HTML5, Online, Ski, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/nm7q4xeh80joyap5ezh1b6lfub0lyh8c/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "47862",
        "title": "Skibidi Jump Adventure",
        "description": "Playing as a small child named Skibidi, youll engage in nonstop platforming action in the game Skibidi Jump Adventure. Skibidi is a skilled dancer who uses his abilities to jump, slide, and avoid danger as he makes his way through a series of challenging levels.",
        "instructions": "Desktop Use the right click button of the mouse to jump Mobile Tap on the screen to jump Controls and Indicators The scores and levels are shown in the upper middle of the screen ",
        "url": "https://html5.gamemonetize.com/ek5dmvtn1jhel2opck9vpcx3dmsvvbhx/",
        "category": "Clicker",
        "tags": "Classic, Click, Clicker, Game, HTML, HTML5, jump, Jumping, Online, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/ek5dmvtn1jhel2opck9vpcx3dmsvvbhx/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "46996",
        "title": "Skibidi  Coloring",
        "description": "The danger is coming and the enemys weapons are aimed at you, watch your path, and avoid danger. You are a master of evasion. Of course, we are not easy to bully! Strike back quickly and let the bullets fly. Kill all enemies. How many levels can you get through?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/n04wrmo9woey1ejcr1o1c28xzooiuonz/",
        "category": "Clicker",
        "tags": ".io, 3D, Action, Android, Fun, HTML5, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/n04wrmo9woey1ejcr1o1c28xzooiuonz/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "47074",
        "title": "Skibidi Jumping",
        "description": "Cube Jumping is a 3D Game that you absolutely like. the game aimes to test your reaction speed by making mutliple platforms moving to left and right and you job is to click each time that there is a platform infront of your cub.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/33ek6qw5gbnqpi7mtkcgykgjcklbi4r7/",
        "category": "Clicker",
        "tags": "Adventure, Android, Click, Fun, HTML5, iPhone, Kids, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/33ek6qw5gbnqpi7mtkcgykgjcklbi4r7/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "47779",
        "title": "Jungle Adventures",
        "description": "Let the monkey jump! The more the monkey will jump, the more bananas he will collect. Jungle Adventure is a fun game to play with it&rsquo;s graphics and sounds. Play attention to the monkey while he jumps. Do not let him fall. Use your keyboard to play the game if you are playing with your computer.",
        "instructions": "Desktop Use the right and left arrow keys of the keyboard to move characters left and right Click the right buttons of the mouse to jump characters Mobile Click on the screen to jump characters And swipe the screen to move left right Controls and I",
        "url": "https://html5.gamemonetize.com/8jimnb4cw0j2t3petlfv2dhb09j88tqy/",
        "category": "Clicker",
        "tags": "2D, Adventure, HTML, HTML5, Hypercasual, Monkey, Online",
        "thumb": "https://img.gamemonetize.com/8jimnb4cw0j2t3petlfv2dhb09j88tqy/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "47496",
        "title": "Skibidi Toilet Attack",
        "description": "Skibidi Toilet Attack is a thrilling and addictive casual online shooter game that promises hours of entertainment for players of all ages. With its simple yet engaging gameplay, the game allows players to immerse themselves in a fast-paced shooting experience while trying to survive against waves of enemies in various challenging levels. As an action-packed free online game, Skibidi Toilet Attack offers a unique and amusing concept that is perfect for those seeking fun games that can be played directly in their favorite web browser. Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "PC controls Use the mouse to shoot Touch controls touch the screen to shoot",
        "url": "https://html5.gamemonetize.com/r4c7bg2psgoq3xj3vsed965dli6hm3ue/",
        "category": "Clicker",
        "tags": "kiz10, Platform, Shooter, Skibidi Toilet, survival",
        "thumb": "https://img.gamemonetize.com/r4c7bg2psgoq3xj3vsed965dli6hm3ue/512x384.jpg",
        "width": "550",
        "height": "750"
    },
    {
        "id": "47652",
        "title": "Skibidi Jump",
        "description": "Do you love Skibidi Toilet? Well! you are in the right place to play a skibidi toilet game. Tap or click to jump colorful bathtubs to collect the little poops. Once you collect all poops, a toilet door will appear. Go to that door to unlock the next level and be careful with traps suction cups. Have fun and explore tons of amazing and challenging levels.",
        "instructions": "Tap or click to jump over obstacles and collect poops",
        "url": "https://html5.gamemonetize.com/sy2m9vrlnwoa34qzsq95lkqh0nrg6o1z/",
        "category": "Clicker",
        "tags": "Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/sy2m9vrlnwoa34qzsq95lkqh0nrg6o1z/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "47528",
        "title": "Pop It Pop It",
        "description": "Welcome to the game Pop It Pop It. Select the Pop It toy you want from the menu. Start relaxing by tapping on the Pop It toy. If you get bored with the Pop It toy, return to the menu and choose another Pop It toy. You can play unlimited with all Pop It toys. Have fun.",
        "instructions": "Click with the mouse on Pop It Tap on Pop It for mobile devices with your finger ",
        "url": "https://html5.gamemonetize.com/w8jdx0bfqkosta9kzcm9q6gid2hpcbwz/",
        "category": "Clicker",
        "tags": "Android, Baby, Bubble, Click, Clicker, Cool, Cute, endless, Girl, Girls, HTML, HTML5, Magic, Mobile",
        "thumb": "https://img.gamemonetize.com/w8jdx0bfqkosta9kzcm9q6gid2hpcbwz/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47354",
        "title": "Super Mario Wonder",
        "description": "Super Mario Wonder is an exciting online game set in the magical world of Mario, where players embark on an epic journey to help Mario conquer various castles. Offering an engaging mix of action and fun, this game has become a favorite among casual gamers seeking thrilling gameplay without the need for downloads or installations. Best of all, Super Mario Wonder can be enjoyed entirely for free on the popular gaming platform, kiz10.com. Casual gamers are often drawn to games that provide instant entertainment without the complexities of traditional. Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "PC controls Use the mouse to jump Touch controls touch the screen to jump",
        "url": "https://html5.gamemonetize.com/zk99zkldgfzm89l2g56hhf5rfzitm9x8/",
        "category": "Clicker",
        "tags": "kiz10, Mario, Platform, run",
        "thumb": "https://img.gamemonetize.com/zk99zkldgfzm89l2g56hhf5rfzitm9x8/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46762",
        "title": "Ninja Block",
        "description": "A ninja who needs to complete impossible tasks. New Amazing ModesClassic, Survive, Escape, Storm, Outcast, Rampage, Deadfall, Shuttle&hellip;&hellip;More... Coming Soon! No One Dies! You have one brain, two eyes, and ten fingers. You will need all them to survive. Can you last out 10s? Helping one dude to run and jump over objects is one thing. Have you got what it takes to control 2 - 36 stickman at the same? No One Dies is a test your brain hand game. Find out which one of you can run faster without tripping!",
        "instructions": "Stretch the stick in order to reach and walk on the platforms Watch out If the stick is not long enough you will fall down --5 Awesome Game Modes --You need quick - witted --Test your brain hand --Full languages Support --SImple Control ",
        "url": "https://html5.gamemonetize.com/i99e0jhggxucyl2jd73ustf72w2lafa8/",
        "category": "Clicker",
        "tags": "1 Player, 2D, Arcade, Bricks, Ninja, Ninjago",
        "thumb": "https://img.gamemonetize.com/i99e0jhggxucyl2jd73ustf72w2lafa8/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "46776",
        "title": "dunk FallBall",
        "description": "dunk BasketBall is a really simple game where you have to only left click for pc players or touch screen for mobile players to make the basketball go up to a specific direction the ball must go into the basket to go to the next level.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/5oep3jqa7ey05jzs9en7bthq199pz98z/",
        "category": "Clicker",
        "tags": "Android, Click, Collecting, Fun, HTML5, iPhone, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/5oep3jqa7ey05jzs9en7bthq199pz98z/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "47367",
        "title": "Rescue from Rainbow Monster Online",
        "description": "A small Impostor is tied up and confined to the room.He cuts the rope, rescues and collects unique skins. Simple and fun. Rescue from Rainbow Monster Online is an exciting casual puzzle game that brings the popular cut the rope concept to life. Available for free on Kiz10.com, this game offers a delightful and challenging experience for players of all ages. With its colorful visuals, engaging gameplay, and a touch of action, Rescue from Rainbow Monster Online is sure to captivate gamers seeking a fun and entertaining adventure. Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "Computer controls Use the mouse to cut the rope and free the character Touch controls Tap and slide to cut the rope and free the character ",
        "url": "https://html5.gamemonetize.com/747v6poddba7w1b1n39dihdf6tmz34gn/",
        "category": "Clicker",
        "tags": "cut, kiz10, Monster, Rescue",
        "thumb": "https://img.gamemonetize.com/747v6poddba7w1b1n39dihdf6tmz34gn/512x384.jpg",
        "width": "550",
        "height": "750"
    }
]