[
    {
        "id": "52019",
        "title": "Speedy Bartender",
        "description": "Step into the fast-paced world of a master mixologist in Speedy Bartender, a thrilling arcade game where quenching thirst meets adrenaline pumping action! Thirsty customers line the bar, their eyes pleading for a taste of your liquid artistry. Will you be the hero who delivers the perfect pour, or will frustration bubble over with spilled drinks and disappointed sighs?",
        "instructions": "Mobile Touch PC Mouse",
        "url": "https://html5.gamemonetize.com/tevy36r7qnipasd04yrutfp3jaikpo1v/",
        "category": "Cooking",
        "tags": "1 Player, Adult, Cooking, Hypercasual",
        "thumb": "https://img.gamemonetize.com/tevy36r7qnipasd04yrutfp3jaikpo1v/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "50833",
        "title": "Bakery Chefs Shop",
        "description": "Bakery Chefs Shop is a delicious and fun cooking adventure game for girls and kids. You are a talented cook who has many loyal customers in your 2D cartoon bakery. You can make orders and learn how to bake a cake in 60 levels. You can also decorate your cakes with extra items that you can unlock with gold coins. You have to serve the order well to get all 3 yellow stars and more bonus coins. Have a blast baking cakes!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/9cn5c1omowu3y2t8qn65vuwhci3srppz/",
        "category": "Cooking",
        "tags": "2D, Cook, Cooking, Design, Food",
        "thumb": "https://img.gamemonetize.com/9cn5c1omowu3y2t8qn65vuwhci3srppz/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "46786",
        "title": "Sweet Cotton Candy Maker",
        "description": "Blue, pink, yellow, white, wow! Marshmallows have many amazing colors and flavors. You can create your own marshmallows anytime. In cotton candy manufacturers, grab your candy and add your favorite flavor to make yummy desserts. The machine is hot and waiting for you! This dessert is easy to make, and you will be a professional soon. Mix your sugar and pick yours. There are many options to try, so let&rsquo;s cook!",
        "instructions": "Tap to play",
        "url": "https://html5.gamemonetize.com/duay2vzk328wwhrufwowb0gy5nlqvql2/",
        "category": "Cooking",
        "tags": "2D, Cartoon, Casual, Food, Girls, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/duay2vzk328wwhrufwowb0gy5nlqvql2/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "49016",
        "title": "Bartender: The Right Mix",
        "description": "Help Miguel the bartender mix cocktails for himself in the right ratios! Choose from a shelf full of different drinks and mix them together to make the ultimate cocktail for a good night out. Add ice or lemon to give it that extra kick but be careful, mixing in the wrong amounts or simply mixing the wrong drinks could end in the worst of ways! No bartending school required!",
        "instructions": "- Click to choose items - Click and hold to pour and shake",
        "url": "https://html5.gamemonetize.com/a3kq2m27xqrt0vfitkakrwu36oi1ylbp/",
        "category": "Cooking",
        "tags": "1 Player, Adult, Cooking",
        "thumb": "https://img.gamemonetize.com/a3kq2m27xqrt0vfitkakrwu36oi1ylbp/512x384.jpg",
        "width": "900",
        "height": "660"
    },
    {
        "id": "47599",
        "title": "Pizza Cafe Tycoon",
        "description": "Are you ready to build a successful cafe empire with you? You currently own a pizza shop and customers love their delicious pizza. Your task is to deliver various pizza orders on time and quickly. Remember, speed and quality are everything in the cafe business. You have to work with dedication to ensure the satisfaction of your customers. Manage orders quickly and effectively without slowing down and offer your customers an unforgettable experience. Build your own strategies for success in your cafe empire and seize opportunities to grow your business.",
        "instructions": "How to play Desktop Mouse Mobile Touch control ",
        "url": "https://html5.gamemonetize.com/ozrihsbvi9tirbdb9cnyu7rks1ydj8hc/",
        "category": "Cooking",
        "tags": "Cook, Cooking, Game, Restaurant, Simulation, Street Fighting, Timing",
        "thumb": "https://img.gamemonetize.com/ozrihsbvi9tirbdb9cnyu7rks1ydj8hc/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "47313",
        "title": "Cooking Trendy",
        "description": "Do you want your food to bring joy to everyone? Theres nothing better than cooking in your own restaurant.Let Cooking Trend make your dreams come true ??When playing Cooking Trend, you will transform into a famous chef, creating delicious dishes to satisfy diners every day.Not only that, you will receive attractive rewards after completing each mission and use them to upgrade items, build your own restaurant.",
        "instructions": "1 Delight customers with well-prepared meals 2 Upgrade your restaurant and kitchen appliances with the gold you get after each level 3 Unlock more delicious ingredients and condiments 4 Cooking games teach you how to do business and quality service 5 Ex",
        "url": "https://html5.gamemonetize.com/docrms4jca8iu8kndsglrihp3ihf3xh8/",
        "category": "Cooking",
        "tags": "Cooking, Food, Restaurant",
        "thumb": "https://img.gamemonetize.com/docrms4jca8iu8kndsglrihp3ihf3xh8/512x384.jpg",
        "width": "800",
        "height": "600"
    }
]