[
    {
        "id": "52185",
        "title": "Prism Fashionistas Dress To Impress",
        "description": "Explore Prism Girls, a captivating dress-up game with seven dolls embodying rainbow colors. From fiery Ruby to elegant Luna, each brings a unique vibe. Seamlessly blend makeup and dress-up, experimenting with eyeshadow, lipstick, and more. In the dress-up level, mix accessories and outfits for endless creativity. Prism Girls is a joyful adventure into colorful expression and fashion possibilities. Unleash your creativity and enjoy the pure fun of style exploration!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/diddwgqy8uum94bqxj6gk6zuknh1gvku/",
        "category": "Girls",
        "tags": "Dress Up, Girl, Kids",
        "thumb": "https://img.gamemonetize.com/diddwgqy8uum94bqxj6gk6zuknh1gvku/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "52152",
        "title": "The Digital Circus Paint   Pomni",
        "description": "The Digital Circus Paint - Pomni: is a fascinating coloring app inspired by the world of the popular cartoon series . In this interactive coloring you can meet the main character - the mysterious Remember. He is a versatile character who lives in the magical world of the digital circus. You have a unique opportunity to plunge into this fascinating world and revive it through your creative abilities. Immerse yourself in the extraordinary digital circus universe, where magic, puzzles, and amazing events meet. Choose your favorite coloring book with Remember. Take your pencils and let your imagination run wild! Remember - it&rsquo;s not just a chara",
        "instructions": "On pc Click the mouse to select On mobile and tablet Finger taps the screen to select ",
        "url": "https://html5.gamemonetize.com/h21xczgmvscp2p29iwfv3jprht1e5283/",
        "category": "Girls",
        "tags": "digital circus, Drawing",
        "thumb": "https://img.gamemonetize.com/h21xczgmvscp2p29iwfv3jprht1e5283/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51808",
        "title": "Dinos Coloring Book",
        "description": "Coloring Dinosaurs Book is a painting, drawing and coloring game for kids! Hello my little friend, have fun with Dinosaurs in this fantastic Coloring App designed especially for you! It will be fantastic to watch your baby coloring, interacting, having fun and improving his technique thanks to this fantastic musical and educational application. The game is a classic color the dinosaurs but you can choose to color them freehand or you can choose the version where you click on the images to color them.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/vhmwaqu4rg0dwic0s3239kab6ek7x91k/",
        "category": "Girls",
        "tags": "Color, Coloring, Dinosaur, Educational",
        "thumb": "https://img.gamemonetize.com/vhmwaqu4rg0dwic0s3239kab6ek7x91k/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "52060",
        "title": "Influencers Aesthetic Fashion Challenge",
        "description": "Welcome to the Influencers Aesthetic Fashion Challenge. Omg, the BFFs are going to participate in a new Influencer challenge. Complete the Look is the latest trend and you will have to pick cute makeup and a fabulous outfit for them. Pick a unique costume for all the girls. Play and have fun!",
        "instructions": "Left Mouse Button Click",
        "url": "https://html5.gamemonetize.com/bgg4m52gmt89msb0syj7t5bk4jv73g22/",
        "category": "Girls",
        "tags": "Cute, Dress Up, Fashion, Girls",
        "thumb": "https://img.gamemonetize.com/bgg4m52gmt89msb0syj7t5bk4jv73g22/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51857",
        "title": "Rock Art",
        "description": "Discover the hottest new trend in 3D coloring and DIY Rock Art. Enjoy hours of fun and relaxation coloring rocks and creating your unique gallery of painted rock masterpieces. Discover your inner artist and share your art with your friends! How to digitally color rocks and create your rock art masterpieces? Simply select a rock from the gallery and paint it according to the color number on the palette. Creating your art collection has never been easier! Choose from a huge variety of 3D illustrations, drawings, and colors in this adult coloring book - animals, mandalas, patterns, flowers, fantasy creatures, seasonal scenes, and more - and paint",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/wc8rbawkkw47oi1bkhlkx2ga7iaieut1/",
        "category": "Girls",
        "tags": "Brain, Coloring, Educational, Fun, HTML5, Kids, Mobile, Puzzle, Skill",
        "thumb": "https://img.gamemonetize.com/wc8rbawkkw47oi1bkhlkx2ga7iaieut1/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51785",
        "title": "Love In Style",
        "description": "Make Valentines Day special by playing Love In Style, our brand-new dress-up game for girls! Get creative and help our girl pick the perfect kitchen outfits for baking a sweet treat for her boo. Afterward, get her ready for her big date with lots of fashionable options. Have a blast playing the Love In Style dress-up game for girls! Website Developer",
        "instructions": "Use your mouse to play this game ",
        "url": "https://html5.gamemonetize.com/nv0nlbrcy5q03532s54g8ejm6dmubbcj/",
        "category": "Girls",
        "tags": "1 Player, Dress Up, Fashion, Girls, Holiday, valentine, valentine day",
        "thumb": "https://img.gamemonetize.com/nv0nlbrcy5q03532s54g8ejm6dmubbcj/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "51858",
        "title": "Cooking Games For Kids",
        "description": "Are you ready to put on your apron, tie on your chefs hat, and make some mouthwatering dishes in this restaurant game? Become the ultimate mini chef with Cooking Game for Kids! In the kids cooking dinner game, you can create masterpiece pizzas in your virtual kitchen, including your favorite toppings like cheese, pepperoni, and vegetables. You can also cook delicious apple pies and sandwiches. Want to know more about this game? Come and play it.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/x6jve4a7h4x3e672io7j8v2lfc266s4k/",
        "category": "Girls",
        "tags": "Animal, Cake, Cook, Cooking, Educational, Food, Fun, HTML5, Mobile",
        "thumb": "https://img.gamemonetize.com/x6jve4a7h4x3e672io7j8v2lfc266s4k/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "52058",
        "title": "Celebrity Foodie Style",
        "description": "Welcome to the Celebrity Foodie Style. These Celebrity girls are more obsessed with both food and fashion. They planned to try this food and fashion in new trends. Yes! It&rsquo;s a foodie fashion. Browse the wardrobe and pick a suitable costume for each girl. Give a unique costume for them and prepare them to show their stunning look.",
        "instructions": "Left Mouse Button Click",
        "url": "https://html5.gamemonetize.com/nexqafdesueaytc2l6gva29bdss3je0m/",
        "category": "Girls",
        "tags": "Celebrity, Cute, Dress Up, Fashion, Girls",
        "thumb": "https://img.gamemonetize.com/nexqafdesueaytc2l6gva29bdss3je0m/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51860",
        "title": "ASMR Makeover Beauty Salon",
        "description": "ASMR Makeover Beauty Salon is a very fun Makeover game. In this game, some customers are bothered by pus in their ears, some are bothered by scalp ulcers, and some are even more bothered by belly button infections. In the game, you, as an experienced beautician, are responsible for treating these skin problems to your customers. And you can also use your keen sense of fashion to match your customers with trendy clothes. Doesnt it sound fun and challenging? Come and play this game!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/k7v8y4tyzhcfk6rnwlio2f6uvdk4juko/",
        "category": "Girls",
        "tags": ".io, Cleaning, Doctor, Dress Up, Fun, Hair, HTML5, Kid, Kids, Makeover, Mobile, Relaxation",
        "thumb": "https://img.gamemonetize.com/k7v8y4tyzhcfk6rnwlio2f6uvdk4juko/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51962",
        "title": "Kids Hand Care",
        "description": "Are you interested in becoming a great hand doctor? Embrace the opportunity to wear a stethoscope and exude professionalism with this engaging hand doctor game. It offers a perfect blend of fun and educational experiences. Dont miss out, grab it now! Website Developer",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/u9v770bnqsjlzx4kynxdil83zbpgtdhw/",
        "category": "Girls",
        "tags": "Doctor, Family, Simulation",
        "thumb": "https://img.gamemonetize.com/u9v770bnqsjlzx4kynxdil83zbpgtdhw/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "51830",
        "title": "Celebrity Social Media Adventure",
        "description": "Welcome to the Celebrity Social Media Adventure. Celebrity girls planned to try some adventure fashion over social media. Each one tries different fashions and posts them on social media and finds who trends the most. Sounds fun! right? Help the girls by browsing their wardrobes and picking the suitable costumes in each fashion. And then pick cute accessories and hairstyles.",
        "instructions": "Left Mouse Button Click",
        "url": "https://html5.gamemonetize.com/ny4y2sufrumy2dut6e2skgcsuzdjnja5/",
        "category": "Girls",
        "tags": "Celebrity, Dress Up, Fashion",
        "thumb": "https://img.gamemonetize.com/ny4y2sufrumy2dut6e2skgcsuzdjnja5/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51912",
        "title": "Happy ASMR Care",
        "description": "Happy ASMR Care is a fun cleaning simulator game. When life starts to get messy, its time to clean. This game offers you four modes of cleaning, including cleaning turtle barnacles, carpet cleaning, shaving, and hoof trimming. What do you prefer to clean? Come join us to start your cleaning journey!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ii0klnpwbijkuzhfuwc4jmaaj2lkjfp6/",
        "category": "Girls",
        "tags": "Animal, Cleaning, Fun, HTML5, Kids, Mobile, Simulation",
        "thumb": "https://img.gamemonetize.com/ii0klnpwbijkuzhfuwc4jmaaj2lkjfp6/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "51786",
        "title": "Valentines Makeup Trends",
        "description": "If youre still seeking inspiration for your upcoming Valentines Day look, then look no further Our social media influencers bring a selection of super sweet makeup looks that are going to impress your Valentine tonight. In the Valentines Makeup Trends game for girls, you can discover the secrets of a sophisticated fantasy makeup look in candy colors. Play today and have fun!",
        "instructions": "Use your mouse to play this game on desktops or tap to play on mobile devices ",
        "url": "https://html5.gamemonetize.com/36vstupubrys7ckfbihi9wf7hf8d1g4w/",
        "category": "Girls",
        "tags": "1 Player, Girls, Makeover, valentine, valentine day",
        "thumb": "https://img.gamemonetize.com/36vstupubrys7ckfbihi9wf7hf8d1g4w/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "51945",
        "title": "Girls Christmas Ball",
        "description": "Christmas is the most important holiday in a year, Fun Land will hold a grant ball to celebrate the holiday on Christmas Eve. Chloe, Adella, Sofia, Bella, Flora, Rebeccal, they are all going to the party, but now they are facing a very important problem, what to wear to the party? Every girl wants to attract the gaze of people in the ball! Could you give some good advice for them?",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/1610wwienqnilzvpguigrkfeh1d1mimq/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Ball, Christmas, Dress Up, Hair, Holiday, Kid, Kids, Relaxation",
        "thumb": "https://img.gamemonetize.com/1610wwienqnilzvpguigrkfeh1d1mimq/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51331",
        "title": "My Super Slime Pet",
        "description": "My Super Slime Pet is an amazing simulation game at yiv.com. Join the slime pet on a journey into the world of virtual pet care! He is no ordinary pet. He is an adorable animated slime blob. He is here to provide you with endless fun, relaxation, and enjoyment. If youre looking for a fun experience, The Slime Pet is a perfect choice. He will keep you entertained while providing your unique form of ASMR relaxation. Watch him bounce, squirm, and react to your every touch. Have fun!",
        "instructions": "On PC Mouse drag and click to play On Mobile Finger drag and click to play ",
        "url": "https://html5.gamemonetize.com/fx9689izaqwmv6xruq40nh2yrvfjzlv5/",
        "category": "Girls",
        "tags": "Boys, Cat, Cleaning, Cute, Educational, Food, Fruit, Fun, Funny, HTML5, Kids, Mobile, Simulation",
        "thumb": "https://img.gamemonetize.com/fx9689izaqwmv6xruq40nh2yrvfjzlv5/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51907",
        "title": "Cosmo Pet Starry Care",
        "description": "Immerse yourself in the wonderful world of space and get to know cute alien creatures better. Choose your pet and find out how best to take care of them. Feed, walk and play with your space friends to give them happiness and care. Support your pets so that they please you with their devotion and love.",
        "instructions": "Depending on the gaming device a computer mouse click or a simple touch on touch screens is used for control ",
        "url": "https://html5.gamemonetize.com/h0vghwox6hvlsbha01d803e9sjqv9mqg/",
        "category": "Girls",
        "tags": "Animal, Creation, Dress Up, Fantasy, Funny, Monster",
        "thumb": "https://img.gamemonetize.com/h0vghwox6hvlsbha01d803e9sjqv9mqg/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51119",
        "title": "Hippo Hair Salon",
        "description": "Hippo Hair Salon is a very unique and fun makeover game. In this game, the adorable animals are going to attend a party tonight. They need to have their hairstyles done. But the barber in the shop got sick. She cant work. So, Hippo decided to help her cut hair for animals. As Hippos close friend, come and help her design cool hairstyles for the animals. You are going to try lots of interesting tools and outfits. Have fun!",
        "instructions": "On PC Mouse click to play On Mobile Finger click to play ",
        "url": "https://html5.gamemonetize.com/u5aeq4wc4mxwpm6jg2g0bjba0j89xx17/",
        "category": "Girls",
        "tags": "Animal, Baby, Baby Games, Cute, Dress Up, Fashion, Fun, Hair, HTML5, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/u5aeq4wc4mxwpm6jg2g0bjba0j89xx17/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "50364",
        "title": "Baby Taylor Homecoming Day",
        "description": "Baby Taylor Homecoming Day is an educational girls game for young girls and little babies. In the game, you have to spend the busy first day back to school with Taylor. First you have to help Taylor dress up beautifully and cutely. This semester Taylor can ride a bicycle to school by herself. Help her design a beautiful bicycle! Oh my god, after a long holiday, the teachers and the playground have become so dirty. Lets clean up the school with Taylor! So, let your creativity shine and make Taylors homecoming day unforgettable Join us now and create magical moments with Baby Taylor on her Homecoming Day!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/0697tk7vniaqqfuttt1wdr67dlpx8i1b/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Cleaning, Cute, Decorate, Design, Dress Up, Educational, Fashion, Girl, Girls, Kids",
        "thumb": "https://img.gamemonetize.com/0697tk7vniaqqfuttt1wdr67dlpx8i1b/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50763",
        "title": "Emoji Make Up",
        "description": "Emoji Make Up is a very stylish makeup game. In the game, you need to wear makeup. The make-up needs to be according to a random emoji theme. The themes are Cookie, Angel, and Evil. You will also be matched with a random opponent. She will also wear the same makeup. After the makeup, you will be graded by the judges based on how well the makeup matches the subject. Also based on how beautiful the makeup is. I hope you like it. Come and call your good friends to try it.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/uh53ja663yv0a66brlnoo8a2tcfbjggq/",
        "category": "Girls",
        "tags": "Cute, Dress Up, Fashion, Fun, Girls, Hair, Highscore, HTML5, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/uh53ja663yv0a66brlnoo8a2tcfbjggq/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51456",
        "title": "My Winter Knit Fashion",
        "description": "Welcome to the My Winter Knit Fashion. Winter is here! Hairdorable girls Dee dee, Willow, and Noah are more adorable in fashion. They planned to try knit fashion. Browse the wardrobe and help the girls to pick cute winter knit outfits. Join and play with the girls and have fun!",
        "instructions": "Left Mouse Button Click",
        "url": "https://html5.gamemonetize.com/ag8liq4q82u7xq3rix6br8t2i1ys9p5f/",
        "category": "Girls",
        "tags": "Cute, Dress Up, Fashion, Girls, Winter",
        "thumb": "https://img.gamemonetize.com/ag8liq4q82u7xq3rix6br8t2i1ys9p5f/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51859",
        "title": "Little Panda Ice Cream Game",
        "description": "Little Panda Ice Cream Game is a cute cooking game at yiv.com. Come and make delicious ice cream with a little panda. In this game, you can choose to make a refreshing popsicle or a soft cone. These ice creams, with their rich flavors and different shapes, will surely satisfy your creative pleasure! The game also offers a wide variety of fruits as ingredients for your ice cream. You can also decorate the ice cream with colorful candies and chocolates. Want to know more? Play this game now!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/zwsn2jbyzvlukuu1wkdr4ic15e455881/",
        "category": "Girls",
        "tags": "Animal, Cook, Cooking, Educational, Food, Fruit, Fun, HTML5, Ice, Mobile, Panda, Summer",
        "thumb": "https://img.gamemonetize.com/zwsn2jbyzvlukuu1wkdr4ic15e455881/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "51531",
        "title": "Girls Prom Dress Fashion",
        "description": "Dear friends, are you going to do something for the ball tonight? Would you like to try different colors? Now we have blue, red, purple, green and rainbow dresses for you. Come and have a try. Have fun!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/w0968xoo1z0iy8em7c9exx6x2h1nyti3/",
        "category": "Girls",
        "tags": "Android, Baby, Baby Games, Dress Up, Fashion, Hair, HTML5, Kid, Kids",
        "thumb": "https://img.gamemonetize.com/w0968xoo1z0iy8em7c9exx6x2h1nyti3/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51579",
        "title": "Pair Matching Puzzle 2D",
        "description": "Engage your mind with Pair Matching Puzzle 2D! Exercise your memory and concentration in this addictive matching game. Explore various levels of challenge, from easy to expert, and enjoy vibrant visuals. Sharpen your cognitive skills, unlock new levels, and immerse yourself in the joy of pair matching. Perfect for all ages, this 2D puzzle game is a delightful way to entertain and stimulate your brain. Get ready for hours of fun and mental agility!",
        "instructions": "Use the left mouse button or touch to drag and drop",
        "url": "https://html5.gamemonetize.com/w18hmc6af9flz8cpqx91rxo1okehj8ps/",
        "category": "Girls",
        "tags": "Casual, Educational, Hypercasual, Matching",
        "thumb": "https://img.gamemonetize.com/w18hmc6af9flz8cpqx91rxo1okehj8ps/512x384.jpg",
        "width": "480",
        "height": "854"
    },
    {
        "id": "51831",
        "title": "Sisters Ice Vs Flame",
        "description": "Welcome to the Sisters Ice Vs Flame. Princesses have a debate on Ice Vs Flames fashion trends. So they planned to try both and compete with each other with their stunning look. Help the princesses by browsing their wardrobes and picking a suitable outfit for each one of them. Try different hairstyles and accessories. Have fun!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/wnxip3s2kb4q8qqaqn7qkfb99t0wwbil/",
        "category": "Girls",
        "tags": "Cute, Dress Up, Fashion, Girls, Princess",
        "thumb": "https://img.gamemonetize.com/wnxip3s2kb4q8qqaqn7qkfb99t0wwbil/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51856",
        "title": "Princess Makeup Game 2",
        "description": "Do you like makeup? Want to become a makeup artist? Run a beauty salon, expand your ideas of good makeup styling, change your girl image, and make your clients look more beautiful and cuter! Whats wrong? Worried about how to do makeup styling? There are a variety of makeup manipulations, tools, accessories, outfits, hairstyles, and all kinds of easy-to-use cosmetics in this DIY makeup game, including cleansers, foundations, brushes, eyeshadows, and more. In addition, you can choose accessories, clothing, and hairstyles to use as models to make your customers cooler and flashier! Then they will be happy to get more likes among their friends!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/1y91jn5m7cehf4xj5mx4bh1pzbcroa7e/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Fun, Hair, HTML5, Kids, Makeover, Mobile, Nail, Princess",
        "thumb": "https://img.gamemonetize.com/1y91jn5m7cehf4xj5mx4bh1pzbcroa7e/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51821",
        "title": "Makeup Art Salon",
        "description": "Makeup Art Salon is a fun makeup game. With your creativity and personal style, you can create the perfect makeup look as a DIY makeup artist in the beauty salon of girls makeup games. Choose your favorite color combinations in beauty games and fashion games. Why not become a DIY makeup artist in our beauty games and fashion games? Have fun with makeup games for girls! Have fun!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/1d4sfr1ck5nxez0ljlw3e7eqvz37n3mp/",
        "category": "Girls",
        "tags": "Cleaning, Design, Fashion, HTML5, Kid, Kids, Makeover, Mobile",
        "thumb": "https://img.gamemonetize.com/1d4sfr1ck5nxez0ljlw3e7eqvz37n3mp/512x384.jpg",
        "width": "640",
        "height": "1136"
    },
    {
        "id": "51502",
        "title": "Suitable Outfit Dressup",
        "description": "Suitable Outfit Dressup is a fashionable and exciting dress up game. If you are a big fan of fashion games, then you will surely enjoy this game! Try different dress styles, hairstyles to make your anime girl character stand out and show off your skills as a fashion line master in the game! Have fun playing!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ko3ky6jlw2cm13qbalh6qulkbhepmi9n/",
        "category": "Girls",
        "tags": "Anime, Dress Up, Fashion, H5, Hair, HTML5, Kid, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/ko3ky6jlw2cm13qbalh6qulkbhepmi9n/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "51774",
        "title": "Baby Taylor Little Princess Makeover",
        "description": "Step into the magical world of Baby Taylor Little Princess Makeover! Meet Taylor, the little fashionista who dreams of being a princess. Help her transform into a fairy, a mermaid, or a princess in this enchanting game. Dive into a world of hair dye, makeup, manicures, and fabulous outfits! Your creativity will make Taylor shine and feel like a real-life princess. Get ready to explore a magical realm of colors and styles and make Taylors dream come true. Are you ready to embrace the princess magic and make Taylor the belle of the ball? Lets make Taylors princess dreams a reality!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/z2s40cxp7608c4fxh600qju8r3lmn946/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Design, Dress Up, Hair, HTML5, Kids, Makeover, Mobile, Nail, Princess",
        "thumb": "https://img.gamemonetize.com/z2s40cxp7608c4fxh600qju8r3lmn946/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51794",
        "title": "Royal Couple Wedding Invitation",
        "description": "Sofia and Jack are getting married! Now, they are preparing their wedding invitations. They want to take a picture to put in the invitation, so they need to dress up for the photoshoot first, could you help them? Then, its time to design the invitation card!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/o26wqe1m4emhaqns6dpu6lbzywrg881x/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Design, Dress Up, Fashion, Hair, HTML5, Kid, Kids",
        "thumb": "https://img.gamemonetize.com/o26wqe1m4emhaqns6dpu6lbzywrg881x/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50671",
        "title": "Paris Fashion Week Fall Couture",
        "description": "Welcome to Paris Fashion Week Fall Couture. Join with Bffs in their awesome journey in Paris Fashion Week and prepare yourself to be amazed by the designers, models, and trends gracing the runways. Help the girls to choose the perfect fashion costumes. Have fun!",
        "instructions": "Left Mouse Button or Tap to Play",
        "url": "https://html5.gamemonetize.com/e5c9xhjf0jlztjg2lhe8riiw9liynp8x/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girls",
        "thumb": "https://img.gamemonetize.com/e5c9xhjf0jlztjg2lhe8riiw9liynp8x/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50578",
        "title": "Fairy Tale Find 5 Differences",
        "description": "In this game you will find different images to have fun with Fairy Tale. This is an interesting puzzle game. You need to seek the differences between the two pictures. It needs you to be patient. Do not miss any details. If you really dont know, click the hint. Time of the game is not limited. Have fun!",
        "instructions": "Mouse or touch screen",
        "url": "https://html5.gamemonetize.com/q920pn4ueotlppqc6j0wwewzfgt3c1ha/",
        "category": "Girls",
        "tags": "Difference, Funny, Girl, Kids, Mobile, Skill",
        "thumb": "https://img.gamemonetize.com/q920pn4ueotlppqc6j0wwewzfgt3c1ha/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "51726",
        "title": "Braid Hair Salon Girls",
        "description": "Let&rsquo;s become a professional hairstylist of stylish hairstylists and design beautiful braided hairstyles for many fun activities. Get ready to give the ladies a beautiful makeover and enjoy this amazing free girl game. Style their hair, choose gorgeous makeup, give them cute outfits and have lots of fun. Let&rsquo;s create amazing designs with a wide variety of braided hairstyles to prove yourself a professional fashion stylist. Make beautifu make your lady look sleeker by straightening her hair or choosing a nice color.",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/bvi1ew7fdjsq1x6rsn12de5nh8smgn7n/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Cleaning, Design, Dress Up, Fashion, Hair, HTML5, Kid, Kids",
        "thumb": "https://img.gamemonetize.com/bvi1ew7fdjsq1x6rsn12de5nh8smgn7n/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51589",
        "title": "Hippo Christmas Calendar",
        "description": "Christmas is the most awaited holiday. Everyone looks forward to the holidays. The Hippo Christmas Calendar was created to make the holiday wait easier and to create a holiday spirit. Millions of children and adults around the world open the windows of the Advent Calendar every day before the holiday season. There they can find candy, souvenirs, toys, funny pictures, and good wishes. Our Advent Calendar is full of such surprises too! Unforgettable adventures, funny puzzles, interesting riddles, and other activities for boys and girls, adults and children are inside! All the surprises could be yours! Meet the hippos for the holidays, open the",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ynmofh5983zdu3lvu1pu2l9kvbd5i81u/",
        "category": "Girls",
        "tags": "Animal, Christmas, Cute, Decoration, Educational, Fun, Hidden, Holiday, HTML5, Mobile, Obstacle",
        "thumb": "https://img.gamemonetize.com/ynmofh5983zdu3lvu1pu2l9kvbd5i81u/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "51458",
        "title": "Influencers Girly Vs Tomboy",
        "description": "Welcome to the Influencers Girly Vs Tomboy. What should these celebrities choose today? A cute, girly girl outfit or maybe a tomboy one? It&rsquo;s going to be your task to help them decide on that! Join them in getting this amazing dress-up game started, run your fingers through their amazing wardrobe, and help them decide on the style that best suits their mood today.",
        "instructions": "Left Mouse Button Click",
        "url": "https://html5.gamemonetize.com/d0g6b510ur6nod9zhis688unbw8fy8wv/",
        "category": "Girls",
        "tags": "Boys, Celebrity, Dress Up, Fashion, Girls",
        "thumb": "https://img.gamemonetize.com/d0g6b510ur6nod9zhis688unbw8fy8wv/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51590",
        "title": "Insta Celebrity Hashtag Goals",
        "description": "Unlock your inner star with Insta Celebrity Hashtag Goals! Celebrities plan to elevate their fashionista in social media. Join and help them to complete their goal at each level. Mix and match the outfit on each level. Take a picture and post it on social media to earn more points. Have fun!",
        "instructions": "Left mouse button click or Tap to play",
        "url": "https://html5.gamemonetize.com/tbxteb00wo6knj66zp03os5or7f56sw6/",
        "category": "Girls",
        "tags": "Celebrity, Dress Up, Fashion, Girls",
        "thumb": "https://img.gamemonetize.com/tbxteb00wo6knj66zp03os5or7f56sw6/512x384.jpg",
        "width": "915",
        "height": "600"
    },
    {
        "id": "50640",
        "title": "Prinxy Winterella",
        "description": "If youre still seeking inspiration for your upcoming winter ball, then look no further Our social media influencers bring a selection of jaw-dropping makeup looks that are going to help you steal the spotlights during the most glamorous night of the year. In the Prinxy Winterella game for girls, you can discover the secrets of a sophisticated fantasy makeup look in icy cold colors. Play today and have fun! Website Developer <a href='https://prinxy.app/'>https://prinxy.app/</a>",
        "instructions": "Use your mouse to play this game on desktops or tap to play on mobile devices ",
        "url": "https://html5.gamemonetize.com/ekcnjpwkh98ga7xs7zb46pgsl63440p6/",
        "category": "Girls",
        "tags": "1 Player, 2D, Fashion, free html5 games for your website, Makeover, Winter",
        "thumb": "https://img.gamemonetize.com/ekcnjpwkh98ga7xs7zb46pgsl63440p6/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "44630",
        "title": "Cooking Mania Express",
        "description": "Prepare, cook and serve in an amazing cooking game! Cooking Mania Express is one of the most engaging and addictive restaurant cooking games with strategy and simulation fun along with fast action, this game will bring you a better cooking experience. Satisfy incoming customers and grow your business with the right sequence and strategy.",
        "instructions": "MOUSE",
        "url": "https://html5.gamemonetize.com/bzdcdke6v8ygedgcc3c7lnisiitr4izw/",
        "category": "Girls",
        "tags": "Food, Management, Restaurant",
        "thumb": "https://img.gamemonetize.com/bzdcdke6v8ygedgcc3c7lnisiitr4izw/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51587",
        "title": "Baby Panda Kids Crafts DIY",
        "description": "Baby Panda Kids Crafts DIY is a very popular game. Come and make crafts with Baby Panda. You can choose to make cool vehicles out of recycled items, a sophisticated Xylophone, and delicious candy canes out of fruits. This is not an unusual DIY game. This is not an ordinary DIY game. It has smooth and beautiful animations and a lively voice-over. Through this game, you will not only know how to make handicrafts but also experience unprecedented relaxation.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/d6jkc4nr6p6xr1jqw4sk1fvdrxtln5dl/",
        "category": "Girls",
        "tags": "Baby, Craft, Crafting, Educational, Fun, HTML5, Kid, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/d6jkc4nr6p6xr1jqw4sk1fvdrxtln5dl/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "51682",
        "title": "Romantic Wedding Dress Shop",
        "description": "Adella is a fashion wedding dress designer, she runs a wedding shop. Sofia is going to get married, so today she comes to Adellas wedding dress shop to order a wedding dress. Could you help Adella design a most fashionable wedding dress for Sofia? And dont forget to match other wedding accessories!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/byl191l9f860dd5vxd0odhw8oy30sa3d/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Dress Up, Fashion, HTML5, Kid, Kids, Shopping",
        "thumb": "https://img.gamemonetize.com/byl191l9f860dd5vxd0odhw8oy30sa3d/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51595",
        "title": "Lucy All Season Fashionista",
        "description": "Lucy All Season Fashionista invites you to four seasonal clothing adventures! From spring to winter, create combinations that cover every season. Experience the freedom to create your own style by complementing Lucys fashion with accessories. This fun and heartfelt game is ideal for anyone who is interested in fashion!",
        "instructions": "LEFT CLICK Touch for mobile ",
        "url": "https://html5.gamemonetize.com/so8wwta9ssvtcl9zwl69l5e3s60ttm3z/",
        "category": "Girls",
        "tags": "2D, Dress Up, Girl, Mobile",
        "thumb": "https://img.gamemonetize.com/so8wwta9ssvtcl9zwl69l5e3s60ttm3z/512x384.jpg",
        "width": "560",
        "height": "853"
    },
    {
        "id": "51585",
        "title": "Little Panda Pet Salon",
        "description": "Have you ever wanted to dress your pooch in a funky outfit or paint your cat in cute makeup? All of these can be realized at Little Pandas Pet Salon! You will run this pet grooming salon and provide comprehensive services such as makeup, hair, and nails for your pets. Experience endless fun in this dress-up game.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/epy4jf2qyt2xs62ncb2ak88g4pdytv96/",
        "category": "Girls",
        "tags": "Animal, Cute, Educational, Fashion, Fun, Hair, HTML5, Kids, Makeover, Mobile, Nail, Panda",
        "thumb": "https://img.gamemonetize.com/epy4jf2qyt2xs62ncb2ak88g4pdytv96/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "51532",
        "title": "Ice Princess Beauty Spa",
        "description": "Play as the queen of the magical frozen castle, your dreams come true and you rule them all! Start at the Mystical Spa where you can have a beautiful facial. Cleanse, exfoliate and tone your skin with potions from the frozen north! Apply the ice mask and rinse with warm mountain water to remove impurities. Finish with a magical moisturizer to leave your skin glowing. You can also choose your favorite cosmetics!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/19n4g51k2rpyxwdwr14kk4us363d35w0/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Dress Up, Fashion, HTML5, Ice, Kids, Makeover, Mobile, Princess",
        "thumb": "https://img.gamemonetize.com/19n4g51k2rpyxwdwr14kk4us363d35w0/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51641",
        "title": "Chinese Food Cooking Game 2",
        "description": "Tie up your apron! This new Chinese Lunar Year shows the world that you too can cook the worlds best Chinese recipes in no time. We offers brand new cooking games for girls, learn to cook Chinese noodles, master cooking skills, follow original Chinese dumpling recipes, fry the best spring rolls in the world, who doesnt love hot Chinese soup in the cold winter? We all love Chinese food!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/wmofe5krnngdztc7t36oe60smeelt7po/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Cook, Food, Fun, Kid, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/wmofe5krnngdztc7t36oe60smeelt7po/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51588",
        "title": "Lovely Doll Dress Up Game",
        "description": "Lovely Doll Dress Up Game is a cute dress-up game at yiv.com. In the game, you need to match your character with a fashionable look. The characters eyes, mouth, hairstyle, and outfit can be customized. This is a fun way to experience dressing up while developing your fashion sense. In this game, you can also dress up your pet and design your favorite pet look. Both the type of pet and the pets outfit can be customized. The game has hundreds of cute-style decorations to dazzle you. Show off your fashionable taste to your hearts content. Have fun.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/1adubvqilky66u838dqr7fnc94j310s8/",
        "category": "Girls",
        "tags": "Animal, Cat, Cute, Dress Up, Fashion, Fun, Hair, HTML5, Kid, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/1adubvqilky66u838dqr7fnc94j310s8/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51577",
        "title": "Sweet Bakery Girls Cake",
        "description": "This sweet cake baking game will make you the best baker! Have fun cooking delicious kitchen food. Start a new adventure in a sweet dessert pastry shop where the best cake games will bring you endless fun. Dress up your awesome dessert baker! Dress her up in a nice new outfit and start... We welcome you to the best cake making shop in town cake games. This sweet cake making bakery also offers you non-stop amazing decorating fun. Make a delicious chocolate cake and become the best baking dessert chef in this cooking game for girls!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/03cfqt74wq9bijwwxm7lvc2k6dz6lpj6/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Cake, Cooking, Decorate, Dress Up, Fruit, Kid, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/03cfqt74wq9bijwwxm7lvc2k6dz6lpj6/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "51405",
        "title": "Crazy Baby Toddler Games",
        "description": "Crazy Baby: Toddler Games is a fun and educational 2D cartoon baby-sitting simulation game. You are a babysitter for this house, and you have to care for 3 crying babies. You don&rsquo;t need to know much, just follow the hand hints to get all 5 yellow stars. You can also watch ads and unlock more items. You will face different requests from 3 babies even if you have done one of them.",
        "instructions": "Tap select items or tools Swipe move the items",
        "url": "https://html5.gamemonetize.com/d9wjo2p6ownh3amenmvsad882e92cmma/",
        "category": "Girls",
        "tags": "2D, Boys, Casual, Dress Up, Educational, Food, Girls, Kids",
        "thumb": "https://img.gamemonetize.com/d9wjo2p6ownh3amenmvsad882e92cmma/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "51586",
        "title": "Dog Hospital",
        "description": "Dog Hospital is a very cute caring game. In the game, you play as an experienced vet. There are 4 very cute puppies. They all need your treatment. All you need to do is follow the prompts and choose the corresponding tools to operate on the puppies. Choose a puppy and start your treatment.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/cfjc0ykp51ajk5glc9wubaef2t7p7sjd/",
        "category": "Girls",
        "tags": "Animal, Cute, Doctor, Educational, Fun, HTML5, Kid, Kids, Mobile, Surgery",
        "thumb": "https://img.gamemonetize.com/cfjc0ykp51ajk5glc9wubaef2t7p7sjd/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51593",
        "title": "Ice Princess All Around The Fashion",
        "description": "Welcome to the Ice Princess All Around The Fashion. Enter the enchanting world of the Ice Princess, where fashion knows no bounds! Explore a realm of icy elegance and timeless style. From regal ball gowns to chic modern looks, discover a wardrobe fit for a princess. Join her on a journey through the world of fashion, where every outfit tells a story. Unleash your inner fashionista and embrace the magic of the Ice Princess&rsquo;s style!",
        "instructions": "Left mouse button click or Tap to play",
        "url": "https://html5.gamemonetize.com/22nzyhp9vf1z9be0yido3vqwkrg93jtb/",
        "category": "Girls",
        "tags": "Cute, Dress Up, Fashion, Frozen, Girls, Princess",
        "thumb": "https://img.gamemonetize.com/22nzyhp9vf1z9be0yido3vqwkrg93jtb/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51395",
        "title": "Rainbow Princess Pony Makeup 2",
        "description": "Come with us to have an adventure in the dreamy forest! Here you can match makeup and choose clothes for the beautiful rainbow fairy! Following the fantastic unicorns across the Rainbow Bridge is everyone&rsquo;s dream, and now you have the chance to be a part of it! How happy it would be if one day you could choose various styles of clothing for the Rainbow Fairy! Here, you can not only choose clothing for the beautiful fairy, but also do facial care. Your goal is to make the rainbow fairy unique! Of course, don&rsquo;t forget that her unicorn is waiting for you!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/6tcsznnphs6e9lsb6oevoa9wilvx457a/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Dress Up, Fashion, Girl, HTML5, Kids, Makeover, Princess",
        "thumb": "https://img.gamemonetize.com/6tcsznnphs6e9lsb6oevoa9wilvx457a/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51330",
        "title": "Cute Doll Dress Up",
        "description": "Cute Doll Dress Up is a very popular dress-up game. The game has a school theme and offers many school-style outfits. Sports style, JK style, cute style, sweet and cool style dresses are available. If you are a dress-up game lover, this game will be your first choice. In this game, you wont be limited to dressing up characters of one gender. First of all, you start the game as a boy, but as soon as you put a long hairstyle and a cute dress on the character, the character will become a girl. You can also customize your character to your liking. The game has hundreds of the latest fashion accessories and hundreds of beautiful backgrounds and d",
        "instructions": "On PC Mouse click to play On Mobile Finger click to play ",
        "url": "https://html5.gamemonetize.com/7gzi8m8d15qaxah5huat9qiltzit98dy/",
        "category": "Girls",
        "tags": "Cute, Decorate, Dress Up, Fashion, Fun, Girl, Hair, HTML5, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/7gzi8m8d15qaxah5huat9qiltzit98dy/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "51419",
        "title": "Winter CosmoFest",
        "description": "Immerse yourself in a magical winter adventure in the Honkai universe. Show your creativity by creating festive cosplay outfits for the heroes of the game. Combine gorgeous costumes, accessories and hairstyles to capture the spirit of your favorite characters among snowflakes and winter landscapes. Show off your fashion skills by choosing the perfect ensemble for the winter cosplay festival. Win the hearts of Honkai fans and share your ideas with your friends!",
        "instructions": "Depending on the gaming device a computer mouse click or a simple touch on touch screens is used for control ",
        "url": "https://html5.gamemonetize.com/hfu6iuzbtc1twjqja1qyaibxybkc8j02/",
        "category": "Girls",
        "tags": "Anime, Christmas, Cute, Dress Up, Fantasy, Fashion, Hair, Makeover, Princess, Space, Train, Winter",
        "thumb": "https://img.gamemonetize.com/hfu6iuzbtc1twjqja1qyaibxybkc8j02/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51422",
        "title": "Shining Anime Star Dress Up",
        "description": "Want to put makeup on the anime Barbie princess? Want to have a cute anime girl? Want to become a fashionable dress up master? Come and use your rich creativity and imagination to create your own princess! The latest hairstyles, personalized makeup, gorgeous earrings and necklaces, unique nail polish, and glamorous dresses... Thousands of beautifully designed outfits will fill your wardrobe and make your fashion fantasies come true! You will become the most sparkling fashion queen at the party, the shining superstar on the stage, and you will define what fashion is!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/22lexr0tte6cgl65sdtpxhzmhrtl66k7/",
        "category": "Girls",
        "tags": "Anime, Baby, Baby Games, Design, Dress Up, Fashion, Hair, HTML5, Kids",
        "thumb": "https://img.gamemonetize.com/22lexr0tte6cgl65sdtpxhzmhrtl66k7/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51117",
        "title": "Sheep Sheep Duck",
        "description": "Sheep Sheep Duck is a very novel casual multiplayer party interactive game. You are free to choose and match the battle scenarios to your liking. The game has all kinds of cool scenes. You can control the game character flexibly by tapping directly on the screen, and take more challenges here. Show off your ability to defeat more enemies in this game, so you can get more weapons. You can challenge yourself better with great strength, so you can unlock new game maps.",
        "instructions": "On PC WASD and HJK to move and attack On Mobile Finger clicks the buttons to move and attack ",
        "url": "https://html5.gamemonetize.com/zj0i32ubsdke3gg5aqdg0eedb6h3etmm/",
        "category": "Girls",
        "tags": "Action, Adventure, Arcade, Avoid, Fighting, Fun, Highscore, HTML5, Kids, Mobile, Obstacle, Shooting, Skill",
        "thumb": "https://img.gamemonetize.com/zj0i32ubsdke3gg5aqdg0eedb6h3etmm/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "51297",
        "title": "Pet Makeup Master",
        "description": "Do you like baby pets? Have you tried grooming your pets yourself? This game offers you the opportunity to try out the pet grooming process yourself, because we are Pet-Grooming Simulator! We prepare all kinds of pet care procedures for you, and make your pet become the cutest one! So, you are also a pet makeup artist! Lets enjoy the fun of pets makeover!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/0p9clr0ghgpir2z8w88cn66b394lo37w/",
        "category": "Girls",
        "tags": "Animal, Baby, Baby Games, Cleaning, Dress Up, HTML5, Kids, Simulator",
        "thumb": "https://img.gamemonetize.com/0p9clr0ghgpir2z8w88cn66b394lo37w/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51275",
        "title": "Royal Girl Wedding Day",
        "description": "Today is Rebeccas wedding day! She cooked the wedding cake by herself but she needs someone to help her to decorate it. Help the girl design one of the most beautiful wedding cakes in the world. After finishing the cake, can you decorate the wedding room to make it as romantic as possible? And then pick a most beautiful wedding dress for her. Make sure Rebecca will have a perfect wedding!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/jfftak9pkt4m3ho7bii8xqw26257yltt/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Cake, Decorate, Design, Dress Up, Fashion, Food, HTML5, Kids, Makeover",
        "thumb": "https://img.gamemonetize.com/jfftak9pkt4m3ho7bii8xqw26257yltt/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51332",
        "title": "Christmas Coloring Game 2",
        "description": "Christmas Coloring Game 2 is a very popular drawing game. As you can see from the name, this game is full of Christmas elements. Christmas is coming soon and there is a festive atmosphere everywhere. In this day full of Christmas atmosphere, this game is undoubtedly your best choice. The game has 12 coloring pages, hundreds of colors and stickers, and dozens of brush styles for you to choose from. This game is not only a sequel to the Christmas Coloring Game, but also a continuation of the Christmas holiday spirit.",
        "instructions": "On PC Mouse click and drag to play On Mobile Finger click and drag to play ",
        "url": "https://html5.gamemonetize.com/lys08vv89r4l4zb6sc381ecewhy157rp/",
        "category": "Girls",
        "tags": "Boys, Christmas, Coloring, Cute, Drawing, Educational, Fun, Holiday, HTML5, Mobile, Winter",
        "thumb": "https://img.gamemonetize.com/lys08vv89r4l4zb6sc381ecewhy157rp/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50906",
        "title": "Giggle Babies",
        "description": "Giggle Babies is a very cute Caring game. In this game, you will take care of cute and lively babies. There are snacks and milk powder on the top right of the game page. You can feed them to help them grow up quickly and healthily. You can get gold by playing small games, and you can get gold by cleaning up garbage. After getting enough gold coins, you can buy your favorite baby. You can also get new fancy babies by generating them with 2 babies. If you pass the mini-game, you can also get toys for the babies. You can also drag the babies to the dressing scene and change them into cute clothes. Want to know more about this game? Come and play",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/c1mlsal9q28v2yxidfbc7z46g6kxa6d9/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Cute, Decorate, Dress Up, Educational, Fashion, Food, Fun, HTML5, Magic, Mobile",
        "thumb": "https://img.gamemonetize.com/c1mlsal9q28v2yxidfbc7z46g6kxa6d9/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "51118",
        "title": "Roblox Coloring Game",
        "description": "The Roblox Coloring Game has been very popular recently. If you like both Roblox and Coloring games, this is the game for you. The game provides 12 coloring pages. It has 3 drawing modes. You can color it in, outline it, or set off fireworks. The game also offers hundreds of stickers for you to decorate your pages. You are sure to find your favorite patterns and pages. Have a good time in this game.",
        "instructions": "On PC Mouse click or drag to play On Mobile Finger clicks or drag to play ",
        "url": "https://html5.gamemonetize.com/9c4o1wj3f0rdkzqu29we3pcghr2sc4ls/",
        "category": "Girls",
        "tags": "Coloring, Cute, Drawing, Educational, Fun, HTML5, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/9c4o1wj3f0rdkzqu29we3pcghr2sc4ls/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51245",
        "title": "Rainbow Girls Perfect Winter Outfits",
        "description": "Welcome to Rainbow Girls Perfect Winter Outfits. Winter is not a season, It&rsquo;s a celebration. Enjoy this winter with these cute rainbow girls. These rainbow girls want to try something special this winter. Join and help the girls to pick cute outfits and accessories. Play and have fun!",
        "instructions": "Left Mouse Button click or Tap to play",
        "url": "https://html5.gamemonetize.com/6nr4qls53nd4lot5ah2fnjiufp416jo3/",
        "category": "Girls",
        "tags": "Cute, Dress Up, Fashion, Winter",
        "thumb": "https://img.gamemonetize.com/6nr4qls53nd4lot5ah2fnjiufp416jo3/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50622",
        "title": "K pop New Years Concert 2",
        "description": "Right after midnight, the most famous K-pop band of the moment will entertain the gathering with their cool songs, and these best friends girls can&rsquo;t wait to see the BlackPink girls performing. Theyve got the tickets, and they need the right looks, and here is where you can help them out! Get ready to prove your stylist skills, ladies, and get them the right BlackPink-inspired looks while playing the K-Pop New Years Concert 2 dress-up game for girls online!",
        "instructions": "Use your mouse to play the game on desktops or tap to play on mobile devices ",
        "url": "https://html5.gamemonetize.com/6jcoziqrlyqiu46fc9ifgao1avb8asta/",
        "category": "Girls",
        "tags": "1 Player, Barbie, Dress Up, Fashion, Girl, Holiday, Princess, Winter",
        "thumb": "https://img.gamemonetize.com/6jcoziqrlyqiu46fc9ifgao1avb8asta/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "51246",
        "title": "Princess Get Ready For Winter",
        "description": "Welcome to the Princess Get Ready For Winter. Winter is almost there! Princess Anna, Elsa, Moana, Ariel, Jasmine, and Snow White are the best friends. They are more passionate about the latest trends. But these princesses still have a dilemma in welcoming the most lovable season. Join and help the princesses to pick cute outfits and costumes. Have fun!",
        "instructions": "Left Mouse Button Click or Tap to play",
        "url": "https://html5.gamemonetize.com/l1buqeiqp9s96jnwy7bm96p7pyck08wi/",
        "category": "Girls",
        "tags": "Cute, Dress Up, Fashion, Princess, Winter",
        "thumb": "https://img.gamemonetize.com/l1buqeiqp9s96jnwy7bm96p7pyck08wi/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51166",
        "title": "Spa Salon Makeup Artist",
        "description": "Looking for a new trendy hairstyle or a makeover at the hair salon? Want to get your hair, hair and nails done in hair salon games or need some special makeup or a big makeover? There is no better place than this hair salon game. Beautiful girls need your help to spa, trim, dye and style their hair to make it look better than before. Choose your model and make her the star of the fashion show in beauty and hair salon games! We have 6 different services. Start with a soothing facial spa. Wash her face, pluck her eyebrows, pop her pimples. Then get ready to DIY hair mask using real hair spa tools. Dont forget to pick up fashion accessories f",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/w7jo7xkse7d0309wu5g8xjvvsugm0plb/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Cleaning, Fashion, Girl, Hair, Kids, Makeover, Nail, Simulator",
        "thumb": "https://img.gamemonetize.com/w7jo7xkse7d0309wu5g8xjvvsugm0plb/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51156",
        "title": "Princess Winter Ice Skating Outfits",
        "description": "Welcome to Princess Winter Ice Skating Outfits. Girls enjoy this winter with your favorite princess. Princesses Anna, Elsa, Moana, Ariel, Jasmine, and Snow White are planning to go for Ice skating. But before that, they need perfect outfits. Help the princesses with their outfits with matching boots. Have fun!",
        "instructions": "Left Mouse Button Click",
        "url": "https://html5.gamemonetize.com/7365b4b7lpwr6la6h6476i6v8e5ep2nu/",
        "category": "Girls",
        "tags": "Boys, Cute, Dress Up, Fashion, Girls, Holiday, Winter",
        "thumb": "https://img.gamemonetize.com/7365b4b7lpwr6la6h6476i6v8e5ep2nu/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51161",
        "title": "BTS Chibi Claw Machine",
        "description": "BTS Chibi Claw Machine is an addictive game for girls dedicated to the seven members of the BTS band. Take control of an arcade machine to win cute and exclusive chibi from the BTS universe. Show off your skills in this addictive claw machine game by choosing the right position to grab the desired items. Every click and every car will take you closer to victory, allowing you to collect a complete collection of super cute chibi figures. You can decorate your room with these sets and create the perfect ambience inspired by your favorite singers. Be persistent, collect all the chibi figures and win the hearts of all BTS fans. You will need luck,",
        "instructions": "Use mouse left click to control the claw by clicking the right and left arrow buttons Once the claw is on the desire spot click the claw button to grab your prize The prize from surprised egg can range from toys to BTS Chibi figures Be persistent to c",
        "url": "https://html5.gamemonetize.com/fj3z2wrx3tgykilfkqqhc3df8l0phmkf/",
        "category": "Girls",
        "tags": "1 Player, Anime, Arcade, Boys, Cartoon, Casual, Celebrity, Cute, Fantasy, Fashion, free html5 games for your website, games for your website",
        "thumb": "https://img.gamemonetize.com/fj3z2wrx3tgykilfkqqhc3df8l0phmkf/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50355",
        "title": "Digital Circus Coloring Adventure",
        "description": "This delightful coloring game is tailor-made for kids seeking a burst of imaginative fun. Dive into a virtual circus tent filled with a myriad of enchanting images waiting for your artistic touch. Are you ready to join the circus of colors and make your masterpiece come alive?",
        "instructions": "Mouse to play ",
        "url": "https://html5.gamemonetize.com/io5a53tylbaxk9pgnlebqwrvmomidzgv/",
        "category": "Girls",
        "tags": "circus, Coloring, digital circus, HTML5, Hypercasual, Kids, School",
        "thumb": "https://img.gamemonetize.com/io5a53tylbaxk9pgnlebqwrvmomidzgv/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "51120",
        "title": "Infinity Zoom Art",
        "description": "Infinity Zoom Art is a puzzle game at yiv.com. This game provides lots of fun pictures and hidden objects for you to discover. As you can see from the name, some pictures are shrunk to very small buttons. You just need to click the buttons, and you can zoom in on the pictures to find objects. If you dont have any clue about finding objects, you can watch a reward ad and get 5 hints. The gameplay is very simple, but some objects are hard to find. This game tests your patience and observation ability.",
        "instructions": "On PC Mouse click find objects On Mobile Finger click to find objects ",
        "url": "https://html5.gamemonetize.com/gcr9v0wvz6s9zy4b4w1zcoz9wf3hoy7p/",
        "category": "Girls",
        "tags": "Fun, Hidden, HTML5, Kids, Mobile, Obstacle, Puzzle, Skill",
        "thumb": "https://img.gamemonetize.com/gcr9v0wvz6s9zy4b4w1zcoz9wf3hoy7p/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51092",
        "title": "Pets Grooming Bubble Party",
        "description": "Welcome to KiKi and FiFi&rsquo;s Virtual Pet Party! Jump into the pool for fun activities and meet their adorable friends: Lily the adorable tiger, Riri the adorable bunny, and Gigi the stylish pet giraffe! Collect candies with pet tiger Lily! Solve cute puzzles with KiKi the cat! Have fun collecting stars with FiFi the dog! Bake a rainbow cake with your adorable pet giraffe Gigi! Collect keys with the fun bunny Riri!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/noy64das3607igtjtd2auk3eptzoyjb2/",
        "category": "Girls",
        "tags": "Animal, Baby Games, Cute, Dress Up, Food, HTML, Kids",
        "thumb": "https://img.gamemonetize.com/noy64das3607igtjtd2auk3eptzoyjb2/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50760",
        "title": "Baby Panda Handmade Crafts",
        "description": "Baby Panda Handmade Craft is a very cute handcraft educational game. Baby Pandas handicrafts have fallen into dust. Come and help him recreate similar handicrafts. You need to make them out of recycled items.You can choose to make 4 kinds of beautiful crafts. There are exquisite necklaces,lovely kites, delicious ramen, and vibrant potted plants. The game also offers hundreds of stylish accessories. Choose one of your favorite crafts and start making them.",
        "instructions": "Play on pc Mouse click to create crafts Play on mobile Finger to click to create crafts",
        "url": "https://html5.gamemonetize.com/msdt6mfh6vk2nv7yp0n6ng6hlh4eart0/",
        "category": "Girls",
        "tags": "Animal, Baby, Baby Games, Cute, Educational, Fashion, Fun, HTML5, Jewel, Kids, Mobile, Panda",
        "thumb": "https://img.gamemonetize.com/msdt6mfh6vk2nv7yp0n6ng6hlh4eart0/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "51071",
        "title": "Sisters Decorate Bedroom",
        "description": "Sisters Decorate Bedroom is an online game that you can play on Babygames for free. This fantastic game lets you design and decorate several different rooms just the way you like them. You can create dreamy bedrooms. Its your chance to let your creativity shine as you make each room special! Perfect for girls who love decorating and design, Sisters Decorate Bedroom is your ticket to creating the ultimate dream spaces. Are you ready to transform rooms into magical havens?",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/tryczneey2fqd30krlsv5ac8a8iqvqv4/",
        "category": "Girls",
        "tags": "Baby Games, Decorate, Fashion, Girl, H5, Kids",
        "thumb": "https://img.gamemonetize.com/tryczneey2fqd30krlsv5ac8a8iqvqv4/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50619",
        "title": "Kikis Pink Christmas",
        "description": "Come and help gorgeous Kiki get her holiday outfits ready in time for Christmas Day. She needs four statement looks and you are invited to help her out. In this brand-new Christmas dress-up game for girls called Kikis Pink Christmas, you dress up our girl in comfy chic homeware, fashionable kitchen outfits, glam festive outfits, and colorful outdoor outfits. Go through all the options and create four unique Christmas looks for cute Kiki. Dont forget to also deal with her makeup look. Have a blast!",
        "instructions": "Use your mouse to play on desktops or tap to play on mobile devices ",
        "url": "https://html5.gamemonetize.com/xxkdcpukrrcue21soja473ucbnvfywjb/",
        "category": "Girls",
        "tags": "1 Player, Christmas, Dress Up, Fashion, Holiday, HTML5, Online, Winter",
        "thumb": "https://img.gamemonetize.com/xxkdcpukrrcue21soja473ucbnvfywjb/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "50762",
        "title": "Baby Daily Habits",
        "description": "Baby Daily Habits is a very popular educational game. In this game, you will learn and develop good living habits with the little girls and boys in the game. From washing your hands before meals to brushing your teeth before bed, Baby Daily Habits on yiv.com picks up every detail and grows with you. You just need to follow gentle guidance and help your character complete the tasks of daily life. Enjoy!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/1gdpin5necb0pgiqj45j66d9w2uxw2zv/",
        "category": "Girls",
        "tags": "Baby, Cleaning, Cute, Dress Up, Educational, Food, Fruit, Fun, Girls, HTML5, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/1gdpin5necb0pgiqj45j66d9w2uxw2zv/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "50761",
        "title": "Kids Dentist Games",
        "description": "Kids Dentist Games is a cute dentist game. In the game, you play as an experienced dentist. You need to rescue the characters who come to need help. Among them, there are cute cats, beautiful princesses, righteous policemen, and kind old grannies. Pick a person you think needs the most help and start working on his or her teeth.",
        "instructions": "On PC Mouse click to play On mobile Finger click to play ",
        "url": "https://html5.gamemonetize.com/z892ltdezy2ykev9141k0suz58fee4kq/",
        "category": "Girls",
        "tags": "Animal, Baby, Baby Games, Cat, Cute, Doctor, Educational, Fun, HTML5, Mobile",
        "thumb": "https://img.gamemonetize.com/z892ltdezy2ykev9141k0suz58fee4kq/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "51043",
        "title": "Surprise Makeup Doll Unbox",
        "description": "Wow, you received a mysterious package! Are you ready for a different and exciting unboxing experience in this game? There is nothing more popular and popular than the blind box surprise doll now, except for the most classic LOL surprise doll, Barbie Color Reveal Doll... Come and try our latest Bubbly Surprise Doll! Open the box and soak the contents in water. You will find a doll and several bags. Put the doll in the water and see what your doll looks like! In addition to ordinary dolls, there are also mermaid surp",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/e0m8pxfgguakdm25rx286jdyyuc4qpes/",
        "category": "Girls",
        "tags": "Baby Games, Cute, Fashion, Girl, Kids, Makeover",
        "thumb": "https://img.gamemonetize.com/e0m8pxfgguakdm25rx286jdyyuc4qpes/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50976",
        "title": "Mr And Mrs Santa Christmas Adventure",
        "description": "Welcome to Mr. and Mrs. Santa Christmas Adventure. Christmas is around the corner. Mr. and Mrs. Santa preparing for the celebration. Unfortunately, Mr. Santa met an accident. Santa and his pet got severe injuries and also his sleigh was damaged totally. Help Santa and his pet for a quick recovery so that he can tour around the world to share his Christmas gift with the children.",
        "instructions": "Mouse button Click or Tap to play",
        "url": "https://html5.gamemonetize.com/f6wi4i31gqgtscci6v7k8dcr4vnjv78q/",
        "category": "Girls",
        "tags": "Christmas, Doctor, Dress Up, Fashion, Girls, Skill",
        "thumb": "https://img.gamemonetize.com/f6wi4i31gqgtscci6v7k8dcr4vnjv78q/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50905",
        "title": "DIY Grimace Shake",
        "description": "DIY Grimace Shake is a very hot cooking game. Grimace has always made milkshakes. It has never tasted anyone elses. Try this game where you can make a milkshake for Grimace. But its not just Grimace, but also Banana Cat, alphabet lore and other popular characters. The game also offers hundreds of various elaborate mugs, milkshake flavors, straws, and more. You can also change the decor of the milkshake shop to your liking. Once the milkshake is ready, try it for your chosen character. It gives you feedback by making emojis based on the taste of your milkshake. Want to know more? Open the game.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/4b03bc52g119a2g6j4x6kcsrmtqmdmo3/",
        "category": "Girls",
        "tags": "Boys, Cooking, Cute, Decorate, Decoration, Food, Fruit, Fun, Girls, Grimace, Grimace Shake, HTML5, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/4b03bc52g119a2g6j4x6kcsrmtqmdmo3/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50951",
        "title": "Chibi Doll Makeup Salon",
        "description": "A cute and fun fashion, makeup game specially designed suitable for girls who love fashion, princesses, and makeover games. Use your creativity to customize gorgeous outfits. Cat, mermaid, kawaii, Christmas, cyberpunk, monster, unicorn, werewolf, rabbit &ndash; choose your favorite chibi anime girl and become a fashion designer! Create a fabulous fashion look with facial spa, beautiful clothes and accessories.",
        "instructions": "On PC Mouse click to change outfits for bride and groom On Mobile Use your finger to click the screen to help characters try on their costumes",
        "url": "https://html5.gamemonetize.com/0wxpqi3a5s1kps5f426iu1kj5iuv0ehj/",
        "category": "Girls",
        "tags": "Baby Games, Cute, Decorate, Design, Dress Up, Fashion, Girl, Girls, Kids, Makeover",
        "thumb": "https://img.gamemonetize.com/0wxpqi3a5s1kps5f426iu1kj5iuv0ehj/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "18034",
        "title": "Dream Wedding Planner",
        "description": "Plan your dream wedding with Dream Wedding Planner Game, a simulation game for kids and girls who love weddings. You can pick four characters and plan six different aspects of their wedding, such as the dress, the cake, the flowers, and more. You can use various tools to complete each step and create your own style. You can skip the current scene by following the pink arrow on top. You can also print the screen after each step and change your plan as you wish. You can make different design plans for each character and give them a sweet wedding.",
        "instructions": "On PC and Mobile Tap to select Drag to move items or tools",
        "url": "https://html5.gamemonetize.com/46yglyg7oau5ljfhr2x0erfr57fi03g5/",
        "category": "Girls",
        "tags": "2D, Boys, Cook, Cooking, Dress Up, Girls, Kids",
        "thumb": "https://img.gamemonetize.com/46yglyg7oau5ljfhr2x0erfr57fi03g5/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "50902",
        "title": "Girls School Fashion",
        "description": "Girls School Fashion is an online game that you can play on Babygames for free. Even at school, these girls represent the fashion, rejecting mediocrity. Help them choose some fashion and unique dress, they will be the most popular girls!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/ak42smh0bg4hj3uokqtopggnlacatsq2/",
        "category": "Girls",
        "tags": "Baby Games, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Princess",
        "thumb": "https://img.gamemonetize.com/ak42smh0bg4hj3uokqtopggnlacatsq2/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50858",
        "title": "Anime Doll Avatar World",
        "description": "Welcome to Avatar World. Here you become the stylist and help the doll prepare for her big show. Choose from a variety of clothes and accessories to create the perfect look for any occasion, giving girls a wonderful and unique dressing experience! Featuring different make-up styles, elegant shiny necklaces and bracelets, and unique hairstyles composed of a variety of popular colors, combined with your originality and unique wallpapers and stickers, you can create your own doll princess! This game tour will show you that the possibilities are endless, from elegant ball gowns to edgy streetwear.",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/uxis95l3lvbl3kuksiu9orcoma518lzd/",
        "category": "Girls",
        "tags": "Baby, Barbie, Cute, Design, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/uxis95l3lvbl3kuksiu9orcoma518lzd/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50621",
        "title": "Fashion Box: Christmas Diva",
        "description": "This holiday season, Bonnie is looking for new ways to express her love for the winter holidays. This year she decided to do something special with your help! Lets join her in the Fashion Box: Christmas Diva dress-up game and help her dress to impress Santa with her unique sense of fashion! Website Developer <a href='https://prinxy.app'>https://prinxy.app</a>",
        "instructions": "Mouse click for desktops or tap to play for mobile devices ",
        "url": "https://html5.gamemonetize.com/ka6qh6wd7l38pqy3deb8p7xo3r3w1fq0/",
        "category": "Girls",
        "tags": "1 Player, Barbie, Christmas, Dress Up, Fashion, Girl, Holiday, HTML5, Makeover, Winter",
        "thumb": "https://img.gamemonetize.com/ka6qh6wd7l38pqy3deb8p7xo3r3w1fq0/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "50904",
        "title": "Phone Case DIY 4",
        "description": "Phone Case DIY 4 is a very interesting and fashionable Art game. At the beginning of the game, choose your favorite phone case. Then put a layer of glue on it, even out. Then, spray it with the paint you like. The game provides you with dozens of colors. Whether you like pastoral, dark, or girly, you will find the right paint here. Then use the hair dryer to dry the color. Then come to our sticker section and choose your favorite fruit sticker, animal sticker, cartoon sticker and vegetable sticker. Finally, add a delicate phone chain to your phone and attach your favorite rhinestones.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/6d2pxpci45dbwelk6558pu3flpvqlts8/",
        "category": "Girls",
        "tags": "Color, Coloring, Cute, Design, Draw, Drawing, Fashion, Fun, Girls, HTML5, iPhone, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/6d2pxpci45dbwelk6558pu3flpvqlts8/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50803",
        "title": "Makeup Kit DIY Dress Up 2",
        "description": "You use cosmetics and skin care products every day, but have you ever made your own? Just use harmless and natural materials and choose the colors that suit you best. Are you excited when you hear this? Let me share with you four cosmetic recipes! They are all made from the most pollution-free and organic materials. Ill also let you try dozens of different colors so you can find the one that works best for you. Don&rsquo;t forget to try it out and take photos after you&rsquo;ve finished making it. Finally, don&rsquo;t forget to share your organic cosmetics secrets with your friends! Now let&rsquo;s start making it!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/qx0hwuejnhieoccibkq8qzl5laq843sx/",
        "category": "Girls",
        "tags": "Baby Games, Cooking, Decorate, Design, Dress Up, Fashion, Girl, Girls, Kids, Makeover",
        "thumb": "https://img.gamemonetize.com/qx0hwuejnhieoccibkq8qzl5laq843sx/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50608",
        "title": "Romantic Bridal Salon",
        "description": "Romantic Bridal Salon is an online game that you can play on Babygames for free. Iris runs a very famous bridal salon, every girl will find a perfect wedding dress in the studio! Girl, today as Iriss assistant your job is to help your favorite girl to prepare for the wedding of her dream. Have fun!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/fkjyj703d5a6nyhd8wos2jjylhmsmz4c/",
        "category": "Girls",
        "tags": "Cute, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/fkjyj703d5a6nyhd8wos2jjylhmsmz4c/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50503",
        "title": "Baby Panda Animal Farm",
        "description": "Baby Panda Animal Farm is a cute farming game where you can learn how to run a farm. In Little Pandatown: My farm, you can experience collecting wool. But you need to feed the sheep first. And then give her a bath to make her comfortable and make the wool clean. After that, you can collect the beautiful and soft wool to sell it to get coins. You can also experience collecting fish. You need to buy some fish fry and dig the bait out of the dirt. Feed the fish fry till they grow larger. Then you can sell the fish to get coins. Want to know how to get honey from bees? Click to play my farm game to find more!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/hehjdndaq1s5ggfztbv16rujim0vrnx5/",
        "category": "Girls",
        "tags": "Animal, Baby, Cartoon, Cleaning, Cute, Educational, Farm, Fun, Girls, Grooming, HTML5, Kids, Mobile, Panda",
        "thumb": "https://img.gamemonetize.com/hehjdndaq1s5ggfztbv16rujim0vrnx5/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "50767",
        "title": "Piano Music Box",
        "description": "Join us in the enchanting world of Piano Music Box, an exceptionally enjoyable game designed for both kids and adults, making the process of learning to play the piano an absolute delight. Fun and interactive way to explore the art of piano playing. With the Piano Music Box, the learning process transforms into a super fun adventure, allowing users to unleash their musical creativity at any skill level.",
        "instructions": "Use mouse or keyboard to play ",
        "url": "https://html5.gamemonetize.com/xbrxaqwdj1xqkwosfyrql4iej8s906ol/",
        "category": "Girls",
        "tags": "Arcade, Boys, Casual, Fun, Girls, Hypercasual, Kids, Music, School",
        "thumb": "https://img.gamemonetize.com/xbrxaqwdj1xqkwosfyrql4iej8s906ol/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "50830",
        "title": "Fashion Studio Snow Queen Dress 2",
        "description": "You run a fashion studio, and its very famous, many fashion girls come to your studio to customize their clothes. Today, your first customer is Sofia, she want you to design a new dress and create a new look for her. Now, start your work!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/gukxl62yok3l2tajyvj54062d0kcg6hq/",
        "category": "Girls",
        "tags": "Baby Games, Cute, Decorate, Design, Dress Up, Fashion, Girl, Girls, Kids, Makeover",
        "thumb": "https://img.gamemonetize.com/gukxl62yok3l2tajyvj54062d0kcg6hq/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50687",
        "title": "Frozen Sisters Dream Wedding",
        "description": "Welcome to the Frozen Sisters Dream Wedding. Princesses are more excited about their dream day with their beloved ones. Yes, It&rsquo;s their wedding. Help them to get ready for this occasion. And make this occasion a more memorable one in her life! Browse their wardrobe and pick suitable outfits and costumes. Help them to decorate the cake and invitation card. Join them and have fun!",
        "instructions": "Left Mouse Button Click or tap to play",
        "url": "https://html5.gamemonetize.com/1z6gw9oyz0dtq46rz5cfkuuqzau0tx85/",
        "category": "Girls",
        "tags": "Dress Up, Girls, Princess",
        "thumb": "https://img.gamemonetize.com/1z6gw9oyz0dtq46rz5cfkuuqzau0tx85/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50804",
        "title": "Hair Salon Dress Up Girl",
        "description": "Take care of this beautiful girl, prepare delicious meals, paint her nails and put makeup on her. Lets go directly to the hair salon. You need to wash the girls hair first. Rinse out any air bubbles and begin the styling process. Choose the hair color and length that best suits her. Now its time to go to the nail salon. Choose from some of the fun patterns we have prepared and apply glitter and cool stickers. After painting your nails, go to the dressing room and pick out some nice clothes. Try on as many outfits as possible and dont forget that a girls best friend is shoes.",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/nsm81iskbnl3cr51gwt9lzcqzv7k790o/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Cooking, Cute, Decorate, Dress Up, Educational, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/nsm81iskbnl3cr51gwt9lzcqzv7k790o/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50505",
        "title": "Pastel Girl Dress Up",
        "description": "Pastel Girl Dress Up is an Anime dress up game designed for girls. The game has a lovely and vibrant tone, will let you love. In the game, you can not only help the protagonist dress up in cute and fashionable clothes, but also decorate the background with cute and delicate decorations, such as cute animals, personalized animated picture frames, and exquisite natural decorations. There are all kinds of eye-catching objects. Come and try it out",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/vzevw937f83z6o53qq7ockycmffvjbql/",
        "category": "Girls",
        "tags": "Cute, Decoration, Dress Up, Fashion, Fun, Girls, Hair, HTML5, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/vzevw937f83z6o53qq7ockycmffvjbql/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50504",
        "title": "Frozen Wedding Dress Up",
        "description": "Frozen Wedding Dress Up is a very popular wedding dress up game. As the name says, you will do the bride and grooms makeup and accessorize with ornate costumes. There are hundreds of fashionable costumes, hundreds of exquisite accessories and makeup for you to choose from. Whats more, you can customize the features of the bride and groom to your liking. Use your imagination to play this game.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/lwfjrk4cscfmagzxyrpc417khbx9e13g/",
        "category": "Girls",
        "tags": "Decoration, Dress Up, Fashion, Fun, Girls, Hair, HTML5, Jewel, Kids, Love, Mobile, Princess",
        "thumb": "https://img.gamemonetize.com/lwfjrk4cscfmagzxyrpc417khbx9e13g/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50682",
        "title": "Animegao Kigurumi DIY",
        "description": "Welcome to the exciting world of animegao with our new dress-up game for girls! In this thrilling game, you will become a true master of anime style and fashion. Create your own character in anime style by selecting from a variety of hairstyles, outfits, and accessories. Are you ready to become a real fashion star? Lets embark on this exciting fashion journey together!",
        "instructions": "Depending on the gaming device a computer mouse click or a simple touch on touch screens is used for control ",
        "url": "https://html5.gamemonetize.com/z4ntcm6t7d2i5csy86a6o3p6ksopqtc4/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Craft, Cute, Design, Dress Up, Fantasy, Fashion, Girl, HTML5, RPG",
        "thumb": "https://img.gamemonetize.com/z4ntcm6t7d2i5csy86a6o3p6ksopqtc4/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50679",
        "title": "World of Alice   Fashion fun",
        "description": "World of Alice - Fashion fun is a game developed for children in which they can combine different pieces of clothing to create an outfit they like for Alice and save the combination. Game developed by: Nau.kids",
        "instructions": "Combine pieces of clothing to create a perfect outfit ",
        "url": "https://html5.gamemonetize.com/x0vwtb3dx2oeur6qb4bu1ofzfvufslyy/",
        "category": "Girls",
        "tags": "Baby Games, Cute, Dress Up, Educational, Fashion, Fun, Funny, HTML5, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/x0vwtb3dx2oeur6qb4bu1ofzfvufslyy/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "48767",
        "title": "BFFs Welcome Fall Look",
        "description": "Welcome to BFFs Welcome Fall Look. Autumn is a beautiful season. Bffs is going to throw a party in the forest. They invited other friends to the party. Open the closet and dress up for the Bffs and her friends. An accessory is a must for a great look.",
        "instructions": "left mouse button click",
        "url": "https://html5.gamemonetize.com/co006gznx5vxa4djwnf05pfwibvextvg/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girls",
        "thumb": "https://img.gamemonetize.com/co006gznx5vxa4djwnf05pfwibvextvg/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50685",
        "title": "Anime Coloring Book",
        "description": "Immerse yourself in the enchanting world of Anime Coloring Book, where creativity knows no bounds! This app invites you to explore a vast collection of coloring pages featuring your beloved anime characters and scenes. Whether youre a seasoned artist or just looking for a relaxing pastime, Anime Coloring Book offers a seamless and enjoyable experience. Unwind, get creative, and add a splash of color to your favorite anime moments. The app is designed for all ages, combining the joy of coloring with the charm of anime. Download now and embark on a colorful journey in the world of anime artistry!",
        "instructions": "Pick your favorite colors from a rich palette Use the pencil to color each section with delightful hues Share your masterpiece with friends and family ",
        "url": "https://html5.gamemonetize.com/732d08k9gcgdd2o9veoy40ptmaskzxa6/",
        "category": "Girls",
        "tags": "2D, Anime, Casual, Coloring, Dragon Ball Z, Kids",
        "thumb": "https://img.gamemonetize.com/732d08k9gcgdd2o9veoy40ptmaskzxa6/512x384.jpg",
        "width": "1440",
        "height": "960"
    },
    {
        "id": "50528",
        "title": "Ellie Thanksgiving Day",
        "description": "Welcome to Ellie Thanksgiving Day. It&rsquo;s Thanksgiving Day, and like every year, young Ellie is in charge of the Thanksgiving dinner. Her friends will start arriving soon, and there are still a few things that need her attention. Will you help her with the last preparations? Join and help beautiful Ellie to surprise her guests with a perfect dinner!",
        "instructions": "Left Mouse button click or tap to play",
        "url": "https://html5.gamemonetize.com/iceuq6wjfitdd9q1k4b0v10bd9b55ivz/",
        "category": "Girls",
        "tags": "Cooking, Cute, Decorate, Dress Up, Fashion, Girls",
        "thumb": "https://img.gamemonetize.com/iceuq6wjfitdd9q1k4b0v10bd9b55ivz/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50275",
        "title": "Jungle Animal Hair Salon",
        "description": "Welcome to the mind-boggling, whimsical realm of Jungle Animal Hair Salon! Brace yourself for an explosion of perplexity and burstiness as you delve into this mesmerizing, cartoon-style game meticulously crafted for the imaginative minds of children. Prepare to unleash the tempest of your creativity as you embark on an odyssey of designing one-of-a-kind hairstyles and outfits for not one, not two, but three distinct animals.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/nid8sdwgwid4gr9feurp9fv7vdumr43b/",
        "category": "Girls",
        "tags": "Animal, Cute, Dress Up, Educational, Fashion, Forest, Fun, Girls, Grooming, Hair, Horse, HTML5, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/nid8sdwgwid4gr9feurp9fv7vdumr43b/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "50632",
        "title": "Dentist Doctor Makeover",
        "description": "This is a simulated dentist game: the princesses come to your little clinic for various reasons. They need your help. Some princesses love sweets and have tooth decay, some princesses hate brushing their teeth, and some princesses fall down and break their teeth. Please use tools and treat with your heart. The princesses will be grateful to you! If you want to know the different reasons why princesses come to the clinic, or if you are willing to help every cute and kind princess, come and experience it in our simulation clinic! Don&rsquo;t forget to clean your teeth every day. After all, going to the dentist is not a pleasant thing!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/mpcbsweu4a897np7s7n1cwahtlv2u7jq/",
        "category": "Girls",
        "tags": "Doctor, Educational, Girl, Girls, Kids, Makeover, Princess, Simulation, Surgery",
        "thumb": "https://img.gamemonetize.com/mpcbsweu4a897np7s7n1cwahtlv2u7jq/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50437",
        "title": "Girl Animal Save",
        "description": "Girl Animal Save is an online game that you can play on Babygames for free. Steven was injured while playing in the snow, please help Zoe to give it the treatment and then dress it up. Lets bandage its wounds first and clean off the branches and ice from its feet. Then give it a bath. Let us become messengers to protect animals together!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/u9weqvjttyfj5tzf2rr3er2bix2q5x2t/",
        "category": "Girls",
        "tags": "Animal, Baby Games, Doctor, Dress Up, Educational, Girls, Grooming, Kids, Makeover, Surgery",
        "thumb": "https://img.gamemonetize.com/u9weqvjttyfj5tzf2rr3er2bix2q5x2t/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50525",
        "title": "BFFs Black Friday Collection",
        "description": "Welcome to BFFs Black Friday Collection. Bffs already filled the closet with a new Black Friday outfit. Help them to pick the perfect costume. Don&rsquo;t forget to pick a fabulous hairstyle. They are all excited like us for this day. Join and help the girls with your skill. Play and have fun! Website Developer <a href='https://cutedressup.com'>https://cutedressup.com</a>",
        "instructions": "Left Mouse Button Click or tap to play",
        "url": "https://html5.gamemonetize.com/4a5ks302mkz0qwi43kupr4ht84jgjf7j/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girls, Shopping",
        "thumb": "https://img.gamemonetize.com/4a5ks302mkz0qwi43kupr4ht84jgjf7j/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50518",
        "title": "OMG Fashion Doll Creator",
        "description": "Become the best stylist and use your skills to create cool and stylish looks! OMG Fashion Doll Creator is a fantastic fashion game. You know that the best fashion designer is yourself! Use your own fashion sense to express yourself! Come and create your own image and style! Everyone will want you for your outfit and makeup suggestions! Collect various clothes for LOL big sisters, dress them up, and make them the most fashionable stars, and you will become a powerful stylist full of inspiration! Dress up and put on makeup and have fun! Compete with your friends to see who is the best stylist!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/dc9np52v19ddquo6cc21dwflnhu0y93n/",
        "category": "Girls",
        "tags": "Baby Games, Barbie, Cartoon, Dress Up, Fashion, Girl, Girls, Kids",
        "thumb": "https://img.gamemonetize.com/dc9np52v19ddquo6cc21dwflnhu0y93n/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50276",
        "title": "Baby Panda House Design",
        "description": "In this game, players can experience the joy of building different houses for four adorable animals: Mr. Hippo, Prince Octopus, Baby Penguin, and Cute Bunny. To begin, players need to process the building materials provided by the animals, including delicious carrots, refreshing watermelons, cool ice pops, and cans from the underwater world. With the freedom to choose their preferred house designs, whether its gothic or pastoral, players can unleash their creativity and make their houses truly unique. Finally, select charming decorations to add the finishing touches to the designed houses in Baby Panda&rsquo;s Pet House Design.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/wqyqqfiowxzlrdgrqe4la8sevmscwtzr/",
        "category": "Girls",
        "tags": "Animal, Baby, Cute, Design, Educational, Food, Fun, Girls, House, HTML5, Kids, Mobile, Panda",
        "thumb": "https://img.gamemonetize.com/wqyqqfiowxzlrdgrqe4la8sevmscwtzr/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "50039",
        "title": "Princess Halloween Boutique",
        "description": "Princess Halloween Boutique is an online game that you can play on Babygames for free. Spooks, costumes, parties, trick-or-treating...its Halloween, the busiest time of the year. Look, the store is crowded with school guests. Sweet dates, birthday parties, auditions... the girls will have a wonderful holiday. Make them look as scary as possible! what is that? Is that a pineapple? Yes, there are people dressed as pineapples on the street! Use your imagination and dress the girls up in a spooky and unique way! Are you up for the hauntingly chic adventure?",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/rotj5cmq91byt2dg95l21ocoqytdofgz/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Cute, Dress Up, Fashion, Girl, Girls, Halloween, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/rotj5cmq91byt2dg95l21ocoqytdofgz/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "46525",
        "title": "Love match   Compatibility test",
        "description": "Check your love match by our zodiac, name and birth date compatibility test. Our love calculator will count a percent of the probability that your chosen one matches you. Do you like fortune tellings, predictions, chiromancy, card reading? Do you wonder if someone is in love with you or isn`t? Try our app and test compatibility in our calculator!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/o03wr4sqdk3pivy2icqi3g0x6rwt20v9/",
        "category": "Girls",
        "tags": "Girls, Kids, Love",
        "thumb": "https://img.gamemonetize.com/o03wr4sqdk3pivy2icqi3g0x6rwt20v9/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49967",
        "title": "Thanksgiving Party Prep",
        "description": "Emily is hosting the Thanksgiving dinner and she wants to surprise her guests with a perfect dinner. For that, shes going to need your help? In the Thanksgiving Party Prep game, Emily is going to keep you busy with lots of activities. Start with dressing her up in a festive outfit, and then complete the chosen outfit with a lovely makeup look in fall colors and a new hairstyle. Then step into her cute kitchen and cook together a delicious turkey and a yummy pumpkin pie. Next, prove your designer skills and help Emily to set the table for her guests. Website Developer <a href='https://prinxy.app'>https://prinxy.app</a>",
        "instructions": "Use your mouse to play the game on a desktop and tap to play on mobile devices ",
        "url": "https://html5.gamemonetize.com/r2hbeit221x9yppw6uc2rqg2hc4kuzin/",
        "category": "Girls",
        "tags": "1 Player, Dress Up, Fashion, Food, Girl, Holiday, HTML5, Makeover, Mobile",
        "thumb": "https://img.gamemonetize.com/r2hbeit221x9yppw6uc2rqg2hc4kuzin/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "50269",
        "title": "Kids Pet Hotel",
        "description": "Welcome to Kids Pet Hotel &ndash; the addictive and delightful mobile game that allows you to experience the joy of running your own virtual pet hotel! With engaging gameplay, adorable pets, and a wide range of activities, this game guarantees hours of fun and entertainment for players of all ages.",
        "instructions": "Mouse or finger to tap to play ",
        "url": "https://html5.gamemonetize.com/71115wvbv61u42l84aiuvfspkxij9cua/",
        "category": "Girls",
        "tags": "Animal, Baby, Cat, Cute, Educational, Family, Fun, Girls, Grooming, House, HTML5, Kids, Mobile, RPG",
        "thumb": "https://img.gamemonetize.com/71115wvbv61u42l84aiuvfspkxij9cua/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "50442",
        "title": "Thanksgiving Squad Style",
        "description": "Step into the world of Thanksgiving Squad Style! Explore a fusion of cozy elegance and festive fashion as the squad celebrates the season. From warm layers to stylish accents, discover the perfect ensemble to make this Thanksgiving unforgettable. Join the squad and embrace the spirit of gratitude and style! Play and have fun!",
        "instructions": "Left Mouse Button Click or Tap to play",
        "url": "https://html5.gamemonetize.com/zvlh8hr5crf7pmbdbet2v5wgdl1mao9i/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girls",
        "thumb": "https://img.gamemonetize.com/zvlh8hr5crf7pmbdbet2v5wgdl1mao9i/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50447",
        "title": "Lovie Chics Black Friday Shopping",
        "description": "Indulge in the ultimate Lovie Chics Black Friday Shopping spree! BFF girls are excited to go out for shopping on Black Friday. Explore exclusive deals, trendy fashion finds, and must-have accessories. Elevate your style and make the most of this exciting shopping extravaganza. Join us for a day of style and savings!",
        "instructions": "Left Mouse Button Click or Tap to Play",
        "url": "https://html5.gamemonetize.com/0atwhivenlaakmrt14ilzta8tok50e1d/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girls, Shopping",
        "thumb": "https://img.gamemonetize.com/0atwhivenlaakmrt14ilzta8tok50e1d/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50412",
        "title": "Modern Autumn Outfit",
        "description": "Modern Autumn Outfit is an online game that you can play on Babygames for free. Autumn is coming! Its time to change our wardrobe! So, whats the fashion trend of this season? In this game our fashion girls will show you that, Sofia, Rebecca, Adella will be the models to tell you which clothing you should to pick!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play",
        "url": "https://html5.gamemonetize.com/qns3pty0shdsltuqaeff9n6ij6wbc4uw/",
        "category": "Girls",
        "tags": "Baby Games, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/qns3pty0shdsltuqaeff9n6ij6wbc4uw/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50365",
        "title": "Makeup Stylist",
        "description": "Makeup Stylist is a makeup salon game for girls. In this game, you play the role of a stylist. You need to give a facial to two girls with skin problems. And you can use your unique aesthetic to design exquisite makeup for them. There are countless fashionable makeup looks for you to match and choose from. You can also apply makeup to them yourself with makeup tools. Try a variety of makeup for them, sometimes a suitable eyebrow can make makeup icing on the cake. The game also offers hundreds of exquisite accessories and clothes. You can pick and choose the best one for the character. Open the game now and enjoy being a stylist!",
        "instructions": "Mouse or tap to play ",
        "url": "https://html5.gamemonetize.com/bggbfi8h0354uqch0tx3fgw3mjzcss0e/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Fun, Girls, Hair, HTML5, Jewel, Kids, Makeover, Mobile",
        "thumb": "https://img.gamemonetize.com/bggbfi8h0354uqch0tx3fgw3mjzcss0e/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50009",
        "title": "Sticker Puzzles Album",
        "description": "In Sticker Puzzles Album, children can strengthen their problem-solving skills, develop hand-eye coordination, boost creativity, and enhance cognitive abilities. With its curriculum-aligned activities and interactive lessons, this game covers a wide range of educational topics, including counting, number recognition, reading comprehension, vocabulary building, science experiments, and much more. Give your child the head start they deserve with Sticker Puzzles Album - the ultimate combination of fun and learning!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/h10cedo3otde4yhvhjv61ug8rg386dsh/",
        "category": "Girls",
        "tags": "Animal, Brain, Cute, Educational, Family, Fun, Girls, HTML5, Kids, Mobile, Puzzle, Skill",
        "thumb": "https://img.gamemonetize.com/h10cedo3otde4yhvhjv61ug8rg386dsh/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "50113",
        "title": "BFFs Black Friday Shopping",
        "description": "In this online game for girls called BFFs Black Friday Shopping, you help five friends get their looks ready to hit the mall and shop till they drop. Brian and the girls are heading to the mall for a fun shopping spree on Black Friday, and you girls should join the shopaholics. Get started with this online dress-up game for girls and see what stunning looks you can find for each of them. Dont forget to accessorize their final looks with designer purses and sparkly jewelry! Have fun! Website Developer <a href='https://prinxy.app'>https://prinxy.app</a>",
        "instructions": "Use your mouse to play on desktops or tap to play on mobile devices ",
        "url": "https://html5.gamemonetize.com/i1cqhcs8lvojvymlqiiw6dfgjs7weg3d/",
        "category": "Girls",
        "tags": "1 Player, Dress Up, Fashion, Games, Girl, Holiday, HTML5, Shopping",
        "thumb": "https://img.gamemonetize.com/i1cqhcs8lvojvymlqiiw6dfgjs7weg3d/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "50321",
        "title": "Baby Taylor Pet Grooming Day",
        "description": "Its all about adorable pets and tons of fun! You get to be the ultimate pet stylist and caretaker. First, meet Taylors cute cat and dog! Groom them, feed them, and make them super happy. Use your creativity to style their fur and make them look fabulous! And guess what? You also get to decorate their rooms! Choose from a variety of cute decorations to make their spaces cozy and charming. Don&rsquo;t forget the goldfish in Taylor&rsquo;s bedroom! Its fish tank also needs a good cleaning and decoration. Its a day full of pet love and creativity. Lets have a blast with Taylor and make these furry friends feel extra special!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/gggkn7fxaq5cvlgwshirpqihyqnexqss/",
        "category": "Girls",
        "tags": "Animal, Baby, Baby Games, Cleaning, Cute, Design, Educational, Girl, Girls, Grooming, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/gggkn7fxaq5cvlgwshirpqihyqnexqss/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "50270",
        "title": "Baby Panda Dream Garden",
        "description": "Baby Panda Dream Garden is a captivating gardening game designed for young children. Dive into a world filled with imaginative play, interactive tasks, and fun learning experiences. Explore the exciting features of this game and learn how to cultivate a beautiful dream garden!",
        "instructions": "Use the mouse or finger to click to play ",
        "url": "https://html5.gamemonetize.com/jwygr04vhkhx0f0uk9yoa9ppj8xpb3r1/",
        "category": "Girls",
        "tags": "Animal, Baby, Cooking, Cute, Educational, Farm, Food, Fruit, Fun, Girls, HTML5, Kids, Mobile, Panda",
        "thumb": "https://img.gamemonetize.com/jwygr04vhkhx0f0uk9yoa9ppj8xpb3r1/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "50268",
        "title": "Princess Doll Dress Up",
        "description": "Princess Doll Dress Up is an online game that you can play on Babygames for free. Every girl dreams of having her own doll salon! Now, girls wishes will be fulfilled. Come to this doll salon to create and dress up your own doll! Do your dolls hair, makeup, and nail art! Finally don&rsquo;t forget the beautiful princess dress. Your doll is the most beautiful and shining princess! Now! Girls! Come to the doll salon to create characters, dress up dolls, and show your creativity to your friends!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/48oo7fgkz1v5fihcch67ri0tnewmwj64/",
        "category": "Girls",
        "tags": "Baby Games, Cute, Decorate, Design, Dress Up, Fashion, Girl, Girls, Hair, Kids, Makeover, Nail, Nails, Princess",
        "thumb": "https://img.gamemonetize.com/48oo7fgkz1v5fihcch67ri0tnewmwj64/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50191",
        "title": "Fairy Tale Makeover Party",
        "description": "I bet you must really like fairy tales. Those princesses, princes, mermaids, fairies and elves are all you yearn for. Now there are four fashion girls who also like fairy tales. They want to dress up as their favorite fairy tale characters at the Halloween party. Please help them choose the right clothes and styles! Dont forget to dress yourself up, because the girls invited you to the party!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/6xyj2zq2vvhp7d57tmzevko2sdtbjapi/",
        "category": "Girls",
        "tags": "Cartoon, Cute, Dress Up, Fashion, Girl, Girls, Halloween, Kids, Princess, Simulation",
        "thumb": "https://img.gamemonetize.com/6xyj2zq2vvhp7d57tmzevko2sdtbjapi/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47506",
        "title": "Crazy Hospital Doctor",
        "description": "Do you have what it takes to be a Crazy Hospital Doctor? Join this hilarious simulation game and experience the thrill of saving lives in a cartoon world! You will face all kinds of patients with different injuries and illnesses, from fevers to fractures. Use your medical skills and tools to diagnose and treat them before it&rsquo;s too late! Crazy Hospital Doctor is a fun and addictive game that will challenge your creativity and logic. Don&rsquo;t miss this chance to become the best doctor in town!",
        "instructions": "Mouse click or tap the screen to play and interact ",
        "url": "https://html5.gamemonetize.com/140mc1pjr1d64p71x3lv90qmoo73j1lg/",
        "category": "Girls",
        "tags": "Boys, Casual, Doctor, Educational, Girls, Kids, Matching, Simulation",
        "thumb": "https://img.gamemonetize.com/140mc1pjr1d64p71x3lv90qmoo73j1lg/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "50186",
        "title": "BlackPink Chibi Claw Machine",
        "description": "Try your luck in the new game BlackPink Chibi Claw Machine. Use the right, left and claw buttons to pull out the prize egg. Inside you may find candy or one of the collectible figurines with members of the BlackPink band. You can also get four special golden figurines with fairy singers. Collect a collection of 20 dolls. Youll be able to take a closer look at your collection on the achievements screen - just click on the figurine image to see all the details. Have some fun playing BlackPink Chibi Claw Machine at dressupwho.com",
        "instructions": "mouse",
        "url": "https://html5.gamemonetize.com/354lqzutgx40hjwauz9jxrpbouqs42di/",
        "category": "Girls",
        "tags": "1 Player, Anime, Arcade, Celebrity, Collecting, Cool, cut, endless, Fashion, Fun, HTML5",
        "thumb": "https://img.gamemonetize.com/354lqzutgx40hjwauz9jxrpbouqs42di/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50167",
        "title": "Dress Up Royal Princess",
        "description": "Dress Up Royal Princess Doll is an online game that you can play on Babygames for free. Unleash the fashion magic. This captivating game allows you to explore the wonders of fashion and storytelling. Experience the joy game and match elegant dresses, tiaras, and shoes, creating countless royal looks fit for a grand ball. Impeccably crafted to deliver a luxurious touch, this lightweight doll ensures hours of imaginative play, granting you the chance to become the ultimate princess stylist. Let the Dress Up Royal Princess Doll provide endless entertainment and help foster a passion for beauty and elegance.",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/92zyalsddpkg7a49qt801azvq63gbxh2/",
        "category": "Girls",
        "tags": "Barbie, Cute, Design, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Princess, Simulation",
        "thumb": "https://img.gamemonetize.com/92zyalsddpkg7a49qt801azvq63gbxh2/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "49398",
        "title": "TikTok Fall Fashion",
        "description": "In this online game for girls called TikTok Fall Fashion, you help three beautiful best friends get their daily looks updated to the latest fashion trends. Try bold colors for their makeup looks, and then mix and match sparkly sequins with cozy knits into jaw-dropping outfits. Dont forget to accessorize their final looks with designer purses and sparkly jewelry! Have fun! Website Developer",
        "instructions": "Use your mouse to play on desktops or tap to play on mobile devices ",
        "url": "https://html5.gamemonetize.com/kzvtldvjjdlzb0qo5fo2a5vne25m9ps4/",
        "category": "Girls",
        "tags": "1 Player, 2D, Elsa, Fashion, Frozen, Games, HTML5, Makeover, Princess",
        "thumb": "https://img.gamemonetize.com/kzvtldvjjdlzb0qo5fo2a5vne25m9ps4/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "50141",
        "title": "Halloween Sushi Maker",
        "description": "Dive into the world of sushi making with Halloween Sushi Maker. This engaging and interactive game allows you to become a sushi chef and create mouthwatering sushi rolls right on your device. From selecting the freshest ingredients to perfecting your rolling technique, this game offers a comprehensive and immersive experience.",
        "instructions": "Use the mouse or finger to click to play ",
        "url": "https://html5.gamemonetize.com/cnkywezzi9e1f7z9xc5jxe7dr9m9uo3j/",
        "category": "Girls",
        "tags": "Boys, Christmas, Cooking, Educational, Food, Fruit, Fun, Girls, Halloween, Holiday, Kids, Winter",
        "thumb": "https://img.gamemonetize.com/cnkywezzi9e1f7z9xc5jxe7dr9m9uo3j/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "50023",
        "title": "Halloween Masquerade Party",
        "description": "Halloween is coming, Sofia and her friends plan to have a Halloween masquerade. Can you help them to decorate the room and change a dress style? Have a good time!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/clsglogonwica2n81u4xcqids7mdinco/",
        "category": "Girls",
        "tags": "Baby Games, Dress Up, Fashion, Girl, Girls, Halloween, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/clsglogonwica2n81u4xcqids7mdinco/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50006",
        "title": "Kids Unicorn Slime ",
        "description": "Kids Unicorn Slime is an enchanting and immersive game that allows teenagers to explore the world of slime. With its vibrant graphics and captivating gameplay, this game is sure to keep players hooked for hours.",
        "instructions": "Use the mouse or finger to play ",
        "url": "https://html5.gamemonetize.com/39929cs0lk7f6tv0jwg7bib4fghhwjrm/",
        "category": "Girls",
        "tags": "Animal, Cute, Fun, Girls, HTML5, Kids, Mobile, Simulation, Skill",
        "thumb": "https://img.gamemonetize.com/39929cs0lk7f6tv0jwg7bib4fghhwjrm/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "49881",
        "title": "Baby Taylor Birthday Prep",
        "description": "Baby Taylor Birthday Prep is an online game that you can play on Babygames for free. This is a special birthday party! Our good friend Baby Taylor will be the real host of the birthday party. From the initial tablecloths to the selection of cakes, snacks and drinks, its up to you to help Taylor make decisions. Simulate a real party scene, create a warm and joyful atmosphere, and let you interact with Taylor happily! look! Delicious cream cakes and cute donuts are beckoning to you! There are also many unexpected gifts. Lets light the candles and sing the birthday song~ Happy birthday to you~",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/md814g0sczilsgqy81dum8an25tqi1fk/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Cooking, Cute, Design, Dress Up, Fashion, Girl, Girls, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/md814g0sczilsgqy81dum8an25tqi1fk/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "50005",
        "title": "BFF World Trip Halloween",
        "description": "Go on a BFF World Trip and travel around the world with three best friends. This time youre going to Hollywood for a super exciting movie star makeover! Turn lovely Naomi into a dancing Hawaiian princess and make her the most beautiful hula girl outfit. Help sweet Serena look like a dream ice princess and design the perfect princess dress. Create a scary cool vampire princess style for Bella, turn her into a zombie cheerleader or play monster girl makeover. Surprise your new best friends with yummy ice cream and make your own frozen desserts!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/7we509is0gzlm6haeex7td232mjrdejz/",
        "category": "Girls",
        "tags": "Cute, Decorate, Design, Dress Up, Fashion, Girl, Girls, Hair, Halloween, Kids, Makeover, Nail, Simulation",
        "thumb": "https://img.gamemonetize.com/7we509is0gzlm6haeex7td232mjrdejz/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "50011",
        "title": "Cat Girl Halloween Preparation",
        "description": "Welcome to Cat Girl Halloween Preparation. Join Cat Girl in her Halloween Preparation journey! From spooky decorations to creative costumes, get inspired for the spookiest night of the year. Discover Cat Girls tips and tricks for the ultimate Halloween celebration and make this year&rsquo;s festivities unforgettable! Play and have fun with this new halloween game!",
        "instructions": "Left Mouse Button Click",
        "url": "https://html5.gamemonetize.com/az36k43wz4iul317i84z1llmca1qjo0v/",
        "category": "Girls",
        "tags": "Decoration, Dress Up, Fashion, Halloween",
        "thumb": "https://img.gamemonetize.com/az36k43wz4iul317i84z1llmca1qjo0v/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50010",
        "title": "Halloween Coloring Book Game",
        "description": "Get ready for a spooktacular adventure with Halloween Coloring Book! Unleash your creativity, explore a myriad of Halloween-themed coloring pages, and enjoy an unblocked and user-friendly game that guarantees endless entertainment. Let your imagination run wild as you bring cute and spooky characters to life with vibrant colors. Get ready to dive into the Halloween spirit and create your very own artistic masterpieces!",
        "instructions": "Use the mouse or finger to tap to play ",
        "url": "https://html5.gamemonetize.com/wve75yfy70rvxvb3dcfc7bz9ped5182b/",
        "category": "Girls",
        "tags": "Animal, Boys, Coloring, Cute, Drawing, Fun, Girls, Halloween, Holiday, HTML5, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/wve75yfy70rvxvb3dcfc7bz9ped5182b/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "49882",
        "title": "Professions For Kids",
        "description": "Looking for an engaging and educational game for your kids? Look no further than Professions for Kids! This online game is designed to entertain and educate children while introducing them to various professions. With its interactive gameplay and captivating visuals, Professions for Kids is a great way for kids to learn about different careers and develop essential skills.",
        "instructions": "Use the mouse or finger to play ",
        "url": "https://html5.gamemonetize.com/t2ah9n8wa9hl99d7wrbpyc86q572nzjo/",
        "category": "Girls",
        "tags": "Animal, Cute, Educational, Fun, Girls, HTML5, Kids, Mobile, RPG",
        "thumb": "https://img.gamemonetize.com/t2ah9n8wa9hl99d7wrbpyc86q572nzjo/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "49993",
        "title": "Baby Taylor Music Journey",
        "description": "The annual Mexican Day of the Dead is here! This is one of the liveliest festivals in the world. Nothing, music, carnival... Baby Taylor cant miss such a grand event. Please come to this festival with Taylor, dress up, make up, and choose an instrument to perform!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/g1j9wylf8bh0b8jbv6mninfozsvc7xx2/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Cute, Dress Up, Educational, Fashion, Girl, Girls, Halloween, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/g1j9wylf8bh0b8jbv6mninfozsvc7xx2/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "49430",
        "title": "Ellie and Friends Pre Fall Outfit",
        "description": "Transition into fall with the Ellie and Friends Pre-Fall Outfit collection. Explore a fusion of style and comfort as they curate trendy ensembles featuring cozy layers, versatile accessories, and seasonal hues. Embrace the upcoming season with fashion-forward choices inspired by the experts themselves! Join and have fun!",
        "instructions": "Left Mouse Button Click",
        "url": "https://html5.gamemonetize.com/udy8x5e7t8zusupqbx399d1s22vu7yxg/",
        "category": "Girls",
        "tags": "Cute, Dress Up, Fall Guys, Fashion, Girls",
        "thumb": "https://img.gamemonetize.com/udy8x5e7t8zusupqbx399d1s22vu7yxg/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49210",
        "title": "Oh My Goth",
        "description": "The Oh My Goth dress-up game shows that there are many ways to express your gothic style. Get inspired by this new trend that emerged from the collision of gothic and whimsical styles. It fuses codes from the 80s gothic style with surrealist evasions inspired by fairy tales and cinematic darkness. Gothic, grunge and gothfied fashion trends dont have to be restricted to the streets, thats why we are here to teach you all about their aesthetics and how to integrate them into your wardrobe. Website Developer",
        "instructions": "Use your mouse to play on a desktop or tap to play for mobile devices ",
        "url": "https://html5.gamemonetize.com/c2jgqox91ea8jydniiiggb6dwx2ht8cn/",
        "category": "Girls",
        "tags": "1 Player, Dress Up, Fashion, Game, Games, Girl, HTML5, Makeover",
        "thumb": "https://img.gamemonetize.com/c2jgqox91ea8jydniiiggb6dwx2ht8cn/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "49265",
        "title": "My Little Pony Learning The Body",
        "description": "Certainly! Heres a in English for the game My Little Pony Learning The Body. Join your favorite pony friends, such as Twilight Sparkle, Rainbow Dash, and Pinkie Pie, as they take you on a fun-filled exploration of the bodys various systems and organs. This game offers a unique opportunity for children to learn about anatomy in a playful and imaginative way.",
        "instructions": "Use mouse to play My Little Pony Learning The Body game online ",
        "url": "https://html5.gamemonetize.com/v2c6tbtaitq4ny1ctodjcs74lc2iifja/",
        "category": "Girls",
        "tags": "Educational, Pony, Quiz",
        "thumb": "https://img.gamemonetize.com/v2c6tbtaitq4ny1ctodjcs74lc2iifja/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49956",
        "title": "Royal Halloween Party Dress Up",
        "description": "Royal Halloween Party Dress Up is an online game that you can play on Babygames for free. Get ready for the spookiest shindig in town! Royal Halloween Party Dress Up lets you join the fun with besties Zoe, Iris, Winnie, and Chloe as they prepare for a Halloween bash like no other. This game is all about celebrating the creativity and fun of Halloween. Its the perfect place for girls who love fashion, friends, and dressing up for the most thrilling night of the year!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/b70ip07v78shfm7yuk3v8ckric814gv4/",
        "category": "Girls",
        "tags": "Baby Games, Dress Up, Fashion, Girl, Girls, Halloween, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/b70ip07v78shfm7yuk3v8ckric814gv4/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "49428",
        "title": "BFFs High School First Date Look",
        "description": "Welcome to BFFs High School First Date Look. Get ready to style BFFs for their exciting high school first date! Mix and match trendy outfits, hairstyles, and accessories to create the perfect look that will make them feel confident and impress their date. Can you help them to find the ultimate outfit that captures their unique style and personality? Let the fashion fun begin!",
        "instructions": "Left Mouse Button Click",
        "url": "https://html5.gamemonetize.com/xtgj3f1m14pj8gavby8s0aacpery3avk/",
        "category": "Girls",
        "tags": "Dating, Dress Up, Fashion, School",
        "thumb": "https://img.gamemonetize.com/xtgj3f1m14pj8gavby8s0aacpery3avk/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49429",
        "title": "BTS Signature Fashion Style",
        "description": "Dive into the world of BTS Signature Fashion Style. Explore the iconic looks of the global superstars and discover how to incorporate their trendsetting fashion into your own wardrobe. From stage outfits to everyday streetwear, get inspired and elevate your style with a touch of BTS&rsquo;s unparalleled flair. Join us on a fashion journey that transcends borders and celebrates individuality with the influence of these K-pop icons. Website Developer <a href='https://cutedressup.com/'>https://cutedressup.com/</a>",
        "instructions": "Left Mouse Button Click",
        "url": "https://html5.gamemonetize.com/muihme95i9pqdqzvik8hviuob1jo2tsu/",
        "category": "Girls",
        "tags": "Boys, Cute, Dress Up, Fashion",
        "thumb": "https://img.gamemonetize.com/muihme95i9pqdqzvik8hviuob1jo2tsu/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49883",
        "title": "Princess Hair Spa Salon",
        "description": "Princess Hair Spa Salon is an online game that you can play on Babygames for free. Elevate the hair care ritual of you to unparalleled of refinement and magnificence with the unparalleled Princess Hair Spa Salon. This exquisitely designed salon exudes an ambiance of opulence and elegance, serving as a sanctuary where your cherished princess can luxuriate and bask in adoration. Our exceptionally skilled stylists and therapists expertly weave together indulgent treatments and extravagant rituals, meticulously tailored to amplify the vitality and luster of her precious locks.",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/zhqczaww7jjpy6dz1r21zvvkldn1ha51/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Cute, Decorate, Design, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Princess, Simulation",
        "thumb": "https://img.gamemonetize.com/zhqczaww7jjpy6dz1r21zvvkldn1ha51/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "49801",
        "title": "Baby Boy Caring Dress",
        "description": "Start his day by taking him to the bathroom where youll give him a nice bubble bath. Before he gets out of the tub, make sure to clean him too. Your baby needs feeding. Prepare him some delicious meals and serve them. Now that your boy has a full tummy, you can move on to the dressing part. The most exciting thing is that you can choose cute animal costumes for him. You can choose to dress him up as a panda, rabbit or any other animal. Choose fun accessories to match your babys look. Let him refuel you for another day of quality time that you can spend together.",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/udn20i9v42rf804yjn679v7kzz0ensee/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Boy, Boys, Cute, Decorate, Design, Dress Up, Fashion, Girl, Girls, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/udn20i9v42rf804yjn679v7kzz0ensee/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "49735",
        "title": "Baby Taylor House Cleaning 2",
        "description": "Baby Taylor House Cleaning 2 is an online game that you can play on Babygames for free. Want to turn your baby into a little helper with housework? Want to cultivate your babys good habit of loving neatness? Learn how to keep your home clean and tidy with Taylor! Help mom clean the kitchen, organize the living room and clean your bedroom. Most importantly, keep your toys and clothes tidy! An entertaining way of early education, the baby simulates cleaning the room, helping the mother with housework, improving the sense of responsibility, and developing good hygiene habits.",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/642k88ki2vyg8y2k5t1i1cec59z1g9vc/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Cleaning, Cute, Decorate, Educational, Girl, Girls, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/642k88ki2vyg8y2k5t1i1cec59z1g9vc/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "49601",
        "title": "Chibi Troll Fashion Maker",
        "description": "Welcome to the magical Troll forest. Here you can meet a variety of fairy-tale inhabitants. They have unusual hairstyles and outfits. You can experiment with color and design, creating your favorite characters and inventing completely new unique Trolls. Dont forget about luxury accessories - crowns, glasses, musical instruments and much more! The game also features many fabulous backgrounds. Have fun playing the game &laquo;Chibi Troll Fashion Maker&raquo; on the site dressupwho.com.",
        "instructions": "Use mouse left click to browse around the categories to create your own unique girl or boy chibi trolls ",
        "url": "https://html5.gamemonetize.com/ln4y0zgwbd4s3eeov6o6gji21cn5ysda/",
        "category": "Girls",
        "tags": "1 Player, Best Games, Boys, Creation, Design, Dress Up, Fantasy, Fashion, Games, Girls, Hair, HTML5, Kids",
        "thumb": "https://img.gamemonetize.com/ln4y0zgwbd4s3eeov6o6gji21cn5ysda/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49217",
        "title": "Makeup Studio Halloween",
        "description": "If youre still seeking inspiration for your Halloween look, then stop right here. Our social media influencers bring three jaw-dropping makeup looks that are going to help you steal the spotlights during the spookiest night of the year. In the Halloween Makeup Trends game for girls, you can learn from Kiki how to create a unicorn makeup look, from Riri how to obtain a colorful Dia de Los Muertes-inspired makeup look, and from Regina the secrets of sophisticated fantasy makeup. Play now!",
        "instructions": "Use your mouse to play on desktops or tap to play on mobile devices ",
        "url": "https://html5.gamemonetize.com/wul4k3yav7wgmbrr5ly7wg989bs4fw0g/",
        "category": "Girls",
        "tags": "1 Player, 2D, Fashion, Game, Games, Halloween, Holiday, HTML5, Makeover",
        "thumb": "https://img.gamemonetize.com/wul4k3yav7wgmbrr5ly7wg989bs4fw0g/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "49427",
        "title": "Monster Girls High School Squad",
        "description": "Unleash your inner fashionista with the Monster Girls High School Squad dress-up game! Mix and match captivating outfits, accessorize with magical charms, and create spellbinding looks for supernatural students. Dive into a world of style, friendship, and enchantment as you explore the fantastic wardrobe options and dress up the alluring characters. Join the squad and let your creativity run wild in this thrilling fashion adventure!",
        "instructions": "Left Mouse Button Click",
        "url": "https://html5.gamemonetize.com/2pyaysp1kfnotpbda3q9xdltzvuz0n4m/",
        "category": "Girls",
        "tags": "Cute, Dress Up, Fashion, Girls, School",
        "thumb": "https://img.gamemonetize.com/2pyaysp1kfnotpbda3q9xdltzvuz0n4m/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49514",
        "title": "Cooking Madness Game",
        "description": "Indulge in the addictive and fast-paced gameplay of Burger Cooking Game Online, a top-rated cooking game that offers a wide range of exciting features. From managing your own burger shop to exploring different food cultures, this game guarantees hours of simulation fun and strategy.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/9r1j2i8o8euql5330e4umgl0wupbialb/",
        "category": "Girls",
        "tags": "Boys, Burger, Cooking, Food, Fun, Girls, Highscore, HTML5, Kids, Management, Mobile, Restaurant, Skill, Timing",
        "thumb": "https://img.gamemonetize.com/9r1j2i8o8euql5330e4umgl0wupbialb/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "49624",
        "title": "Celebrity Halloween Costumes",
        "description": "Welcome to Celebrity Halloween Costume Adventure! Your favorite celebrities are planning the perfect Halloween outfits together. Get ready for a star-studded Halloween experience as they choose and showcase their ultimate costumes. Unleash your inner celebrity with the hottest Halloween trends!",
        "instructions": "Left Mouse Button Click",
        "url": "https://html5.gamemonetize.com/h91rjj9r8y7qhkwpcpf2ibixsebvnzh8/",
        "category": "Girls",
        "tags": "Celebrity, Dress Up, Halloween",
        "thumb": "https://img.gamemonetize.com/h91rjj9r8y7qhkwpcpf2ibixsebvnzh8/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49522",
        "title": "Hair Doll Dress Up",
        "description": "Doll Dress Up is an online game that you can play on Babygames for free. Welcome to the world of hair dolls! Here, you can experience all kinds of beautiful hairstyles, dazzling costumes, adorable dressing room, exclusive secert garden, manicuresand hairdressing, gashapon Different gameplays are waiting for you!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/pgzr1gtq7xfed6m3d0n1pzycjbsmu61p/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Cartoon, Cute, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/pgzr1gtq7xfed6m3d0n1pzycjbsmu61p/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "49625",
        "title": "BFFs Unique Halloween Costumes",
        "description": "Join the BFFs Unique Halloween Costumes adventure! These best friends are on a mission to find the most creative and distinctive Halloween outfits. Get ready for a one-of-a-kind Halloween experience as they plan, choose, and showcase their unique costumes. Unleash your creativity and celebrate Halloween like never before with the trendiest and most original looks! Website Developer <a href='https://cutedressup.com'>https://cutedressup.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/nkd7qrglyqh1w1nqap19mhn3zu1r61rq/",
        "category": "Girls",
        "tags": "Cute, Dress Up, Halloween",
        "thumb": "https://img.gamemonetize.com/nkd7qrglyqh1w1nqap19mhn3zu1r61rq/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49286",
        "title": "Romantic Victoria Secret Show",
        "description": "omantic Victoria Secret Show is an online game that you can play on Babygames for free. Its your time to shine as a fashionista. Your mission? Dress up the girls in stunning Victoria Secret Show outfits and wings. Let your fashion creativity run wild and make them look like runway superstars! Choose from a fabulous selection of outfits and wings, mix and match to create the perfect look. Are you ready to rock the fashion world? Join the Romantic Victoria Secret Show now and show off your styling skills!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/4tsiz5ijqw5qnq7e3q9z9k56jzbu9nfb/",
        "category": "Girls",
        "tags": "Baby Games, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/4tsiz5ijqw5qnq7e3q9z9k56jzbu9nfb/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "49271",
        "title": "Halloween Makeup Trends",
        "description": "If youre still seeking inspiration for your Halloween look, then stop right here. Our social media influencers bring three jaw-dropping makeup looks that are going to help you steal the spotlights during the spookiest night of the year. In the Halloween Makeup Trends game for girls, you can learn from Kiki how to create a unicorn makeup look, from Riri how to obtain a colorful Dia de Los Muertes-inspired makeup look, and from Regina the secrets of sophisticated fantasy makeup. Play now! Website Developer <a href='https://prinxy.app/'>https://prinxy.app/</a>",
        "instructions": "Use your mouse to play the game on a desktop and tap to play for mobile devices ",
        "url": "https://html5.gamemonetize.com/y5t7ngdllxo9155eihuv1iwz9nhtj40u/",
        "category": "Girls",
        "tags": "Fashion, Halloween, Holiday, HTML5, Makeover",
        "thumb": "https://img.gamemonetize.com/y5t7ngdllxo9155eihuv1iwz9nhtj40u/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "49507",
        "title": "Princes Horse Club",
        "description": "Experience Princess Horse Club for free, an addictive equestrian adventure game! Embark on a journey with six beautiful princesses and explore magical horse farms and mysterious realms. The horses are adorable and intelligent, and your mission is to establish a close bond with them by completing various fun tasks. Train your horses, participate in competitions, solve puzzles, and team up with other princesses. Princess Horse Club will bring you a joyful and surprising world!",
        "instructions": "Use the mouse or finger and follow the to play",
        "url": "https://html5.gamemonetize.com/7twz0vu9unrvw9sm1ys2439j647risg7/",
        "category": "Girls",
        "tags": "Dress Up, Educational, Fantasy, Farm, Fashion, Forest, Fun, Grooming, Hair, Horse, HTML5, Kids, Mobile, Princess",
        "thumb": "https://img.gamemonetize.com/7twz0vu9unrvw9sm1ys2439j647risg7/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "48362",
        "title": "Design With Me Fall Sweater",
        "description": "Welcome to Design With Me Fall Sweater. Princess Elsa, Anna, and Ariel are the best friends who love more to do creative. For this Autumn they planning to create and design their own fall sweater. Help the girls to pick and design a perfect sweater. Play and have fun!",
        "instructions": "left mouse button click",
        "url": "https://html5.gamemonetize.com/todsmntefxk0j9i3h5jzsyc3ps2kt49y/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girls, Makeover",
        "thumb": "https://img.gamemonetize.com/todsmntefxk0j9i3h5jzsyc3ps2kt49y/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49510",
        "title": "Kids Summer Ice Desserts",
        "description": "Indulge in the ultimate frozen delight with Kids Summer Ice Desserts! Immerse yourself in a world of deliciousness and have endless hours of fun with this addictive collection of ice cream-themed games. Enjoy a variety of gameplay modes, vibrant graphics, and fantastic challenges that will keep you entertained.",
        "instructions": "Use the mouse or finger to play ",
        "url": "https://html5.gamemonetize.com/ims9luyymdruymgjvgqh9d89cfubc4qo/",
        "category": "Girls",
        "tags": "Cooking, Food, Fruit, Fun, Girls, HTML5, Ice, Kids, Mobile, Summer",
        "thumb": "https://img.gamemonetize.com/ims9luyymdruymgjvgqh9d89cfubc4qo/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "49509",
        "title": "Hamburger Cooking Game",
        "description": "Welcome to the delightful and addictive Hamburger Cooking Game! Unleash your inner chef and embark on a culinary adventure like no other. Cook, decorate, and serve scrumptious hamburgers to satisfy the cravings of your customers. Engage in a fun-filled cooking experience while improving your culinary skills. Lets dive into the details of this exciting hamburger game!",
        "instructions": "Are you new to the world of hamburger-cooking games No worries Hamburger Cooking Game provides a user-friendly interface and easy-to-follow Learn how to select ingredients customize toppings grill the perfect patty and assemble a burger",
        "url": "https://html5.gamemonetize.com/1hy918k1utcb0lcd14skyyzc1896gh6b/",
        "category": "Girls",
        "tags": "Burger, Cleaning, Cooking, Cute, Dress Up, Fashion, Food, Fun, HTML5, Kids, Mobile, Restaurant, RPG",
        "thumb": "https://img.gamemonetize.com/1hy918k1utcb0lcd14skyyzc1896gh6b/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "49471",
        "title": "Cooking in the City of Winds",
        "description": "Welcome to the City of Winds. The culinary festival starts here today! Participants came from all over the magical land to prepare their favorite dishes and delight the citizens. Try your hand at making smooth pudding, tapioca bubble tea and the famous Hocus-Pocus marmalade dessert. This is simply heaven for those with a sweet tooth. Don&rsquo;t forget that the dish should not only be tasty, but also beautiful. Use your cooking skills to decorate the dish as elegantly as possible. And victory will be yours!",
        "instructions": "Depending on the gaming device a computer mouse click or a simple touch on touch screens is used for control ",
        "url": "https://html5.gamemonetize.com/5wvdtuii9dhs09i16xse6to6oga3zwvt/",
        "category": "Girls",
        "tags": "Anime, Arcade, Clicker, Creation, Decorate, Decoration, Design, Fantasy, HTML5, RPG",
        "thumb": "https://img.gamemonetize.com/5wvdtuii9dhs09i16xse6to6oga3zwvt/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49246",
        "title": "Merge Room",
        "description": "Merge Room is an addictive mobile game where players are tasked with filling a room with objects. The concept of the game is simple yet challenging, as players must merge objects together in order to make them grow and fill up the room. The game begins with a small, empty room and a few small objects scattered around. As players merge these objects together, they will grow in size and fill up more of the room. The larger the objects become, the more points the player will earn. Website Developer <a href='https://www.gamesmunch.com/'>https://www.gamesmunch.com/</a>",
        "instructions": "Overall Merge Room is a fun and addictive mobile game that is perfect for players of all ages With its simple yet challenging gameplay colorful graphics and catchy soundtrack it is sure to provide hours of entertainment and keep players coming back f",
        "url": "https://html5.gamemonetize.com/ctu798dfdum75hgsv7l34gpc9ainsji4/",
        "category": "Girls",
        "tags": ".io, Girls, House, Kids, Puzzle",
        "thumb": "https://img.gamemonetize.com/ctu798dfdum75hgsv7l34gpc9ainsji4/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "49041",
        "title": "Barbiemania",
        "description": "Experience the ultimate makeup adventure with Barbiemania! Join the iconic doll, Ellie, and create stunning looks for three occasions. Lets dive into the magical world of Barbiemania and unleash your inner stylist!",
        "instructions": "Use your mouse to play on a desktop and tap to play for mobile devices ",
        "url": "https://html5.gamemonetize.com/wdeki0lf306m9z07slrsasu6idpi20gm/",
        "category": "Girls",
        "tags": "1 Player, Barbie, Fashion, Girl, HTML5, Makeover, Mobile",
        "thumb": "https://img.gamemonetize.com/wdeki0lf306m9z07slrsasu6idpi20gm/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "49289",
        "title": "Cute Avatar Creator",
        "description": "Dress up the adorable doll with trendy outfits and accessories in Cute Avatar Creator. Create unique looks, customize facial features, and enjoy fun mini-games. Express your fashion sense and immerse yourself in this delightful dress-up experience.",
        "instructions": "Use the mouse or finger to click to dress up the doll ",
        "url": "https://html5.gamemonetize.com/lp29ivk1p7duplbgqgo9zfmaelzq01pi/",
        "category": "Girls",
        "tags": "Cute, Decorate, Dress Up, Fashion, Fun, Girls, Hair, HTML5, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/lp29ivk1p7duplbgqgo9zfmaelzq01pi/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "49287",
        "title": "Street Food Maker",
        "description": "In this game, players become street food chefs and embark on a delicious culinary journey. They can choose from a variety of mouthwatering dishes from different cuisines. With a wide range of ingredients and toppings to choose from, players can customize their creations to suit their tastes. As they progress through the game, players can unlock new recipes and upgrade their cooking skills. With its vibrant visuals and intuitive gameplay, Street Food Maker offers a delightful experience for food enthusiasts and aspiring chefs. So, put on your apron and get ready to satisfy your virtual customers cravings!",
        "instructions": "Following the use the mouse or finger to cook amazing dishes ",
        "url": "https://html5.gamemonetize.com/5tju4dsyyqqp4h5ahepsehhyy8p0cen4/",
        "category": "Girls",
        "tags": "Cooking, Cute, Food, Fruit, Fun, Girls, HTML5, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/5tju4dsyyqqp4h5ahepsehhyy8p0cen4/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "49040",
        "title": "Highschool Mean Girls 2",
        "description": "The mean girls are back to school, this time in a brand-new formula. You can join them in our online dress-up game for girls called Highschool Mean Girls 2 and help them style up their looks for the first day of school. Get it started, and have a great time creating jaw-dropping outfits for these 2 groups of BFFs competing in the high school fashion challenge. Only one group will be the next fashion queen, but who will be our winners? The supermodels or the singers? Website Developer <a href='https://prinxy.app/'>https://prinxy.app/</a>",
        "instructions": "Use your mouse to play on desktop tap to play on mobile devices ",
        "url": "https://html5.gamemonetize.com/1qluass32ki9daii7fdbu9f3q16or2ff/",
        "category": "Girls",
        "tags": "1 Player, Celebrity, Dress Up, Fashion, HTML5, Makeover",
        "thumb": "https://img.gamemonetize.com/1qluass32ki9daii7fdbu9f3q16or2ff/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "49122",
        "title": "Design With Me SuperHero Tutu Outfits",
        "description": "Welcome to Design With Me SuperHero Tutu Outfits. We all love superheroes very much! Likewise, our favorite princesses are inspired more by superhero tutu fashion. They planned to organize fashion events under this theme. Join and help each princess to pick a suitable superhero tutu outfit. Play them and have fun!",
        "instructions": "Left Mouse Button Click",
        "url": "https://html5.gamemonetize.com/chwbdczy97ay2aylcz35t9r5na4zpi4x/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Princess",
        "thumb": "https://img.gamemonetize.com/chwbdczy97ay2aylcz35t9r5na4zpi4x/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49345",
        "title": "Yoga Master",
        "description": "Introducing Yoga Master, the ultimate mindfulness and fitness game! Immerse yourself in a serene virtual world where youll embark on a transformative yoga journey. With intuitive controls, follow real yoga routines, perfect your poses, and find inner peace. Challenge friends in multiplayer mode or unlock new levels of relaxation in solo play. Explore lush environments, deepen your practice, and unlock achievements as you become a true Yoga Master. Whether youre a beginner or a seasoned yogi, this game is your path to balance, strength, and tranquility. Embrace the zen within you and experience Yoga like never before!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/tt7bruavsgu63at04z52himju2xkbtk0/",
        "category": "Girls",
        "tags": "1 Player, Arcade, Girls, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/tt7bruavsgu63at04z52himju2xkbtk0/512x384.jpg",
        "width": "950",
        "height": "600"
    },
    {
        "id": "49279",
        "title": "Couples Outfit Change Challenge",
        "description": "Step into the world of style and creativity as you embark on a makeover adventure like no other. Take on the challenge of swapping wardrobe and discover how well you can style each other in this exciting game. From head to toe, mix and match outfits to create unique and unforgettable looks.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/v6ecd8704ko7hucc7kydb69poe9klffg/",
        "category": "Girls",
        "tags": "Disney, Dress Up, Fashion, Frozen, Girls, Makeover, Princess",
        "thumb": "https://img.gamemonetize.com/v6ecd8704ko7hucc7kydb69poe9klffg/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49203",
        "title": "Babysitter Kids Hair Salon",
        "description": "Babysitter Kids Hair Salon is an online game that you can play on Babygames for free. Enjoy free baby games! Becoming a professional nanny is not easy. Parents really love their children and want a crazy and perfect daycare center where they can find perfect spa, hygienic food, hairdresser and hair salon, baby diaper changing without any allergies or infections, newborn Routine check-ups and lots of clothes and toys for their babies to keep them happy and healthy.",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/f780395lcx5bjgo9etd3t1qvsvthf8mc/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Cute, Doctor, Dress Up, Fashion, Girl, Girls, Hair, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/f780395lcx5bjgo9etd3t1qvsvthf8mc/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "48662",
        "title": "Baby Taylor Fashion Braid Salon",
        "description": "Oh no! Taylors hair has grown long and messy, but dont worry, because youre here to save the day! As the owner of the hair salon, its up to you to give Taylor a fantastic makeover. Grab your scissors, comb, and styling tools, and lets get started on this magical hair adventure! As you style Taylors hair, shell be giggling and smiling, excited to see the result. Dont forget to add colorful hair accessories like bows, ribbons, and glitter to make her hair sparkle and shine. Taylor will be overjoyed with her fabulous new look!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/uj27xtkactmtbgfv2q7m7nm5idbi3nia/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Dress Up, Fashion, Girl, Girls, Hair, Kid, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/uj27xtkactmtbgfv2q7m7nm5idbi3nia/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "49290",
        "title": "Phone Case DIY 3",
        "description": "Phone Case DIY is an incredibly creative game that allows you to fully unleash your imagination and design skills, creating one-of-a-kind phone cases. This game offers a wide range of options including vibrant shell colors, patterns, stickers, and more, allowing you to customize the perfect phone case according to your taste and personality.",
        "instructions": "Use the mouse or finger to tap ",
        "url": "https://html5.gamemonetize.com/g9oru9dqmu1ezyddvk6gy2x91ml9rtqp/",
        "category": "Girls",
        "tags": "Cleaning, Coloring, Design, Drawing, Fashion, Fun, Girls, HTML5, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/g9oru9dqmu1ezyddvk6gy2x91ml9rtqp/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "49060",
        "title": "BFFs Beach Pedicure",
        "description": "BFFs Beach Pedicure is an online game that you can play on Babygames for free. Youll have a blast giving your BFFs the ultimate beach pedicure, choosing from a wide range of nail colors, patterns, and cute accessories to create the perfect beachy look for their toes. But wait, theres more! You can also raid their wardrobe and pick out trendy outfits that match their fresh pedicures. From beach dresses to cool accessories, the choices are endless! Are you ready to make your BFFs shine with style and creativity?",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/l2fa7x9037q9gqvb2nr19sydkjbwg0gg/",
        "category": "Girls",
        "tags": "Baby Games, Decorate, Design, Dress Up, Fashion, Girl, Girls, Kids, Nail, Simulation",
        "thumb": "https://img.gamemonetize.com/l2fa7x9037q9gqvb2nr19sydkjbwg0gg/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "49222",
        "title": "BFFs Oktoberfest",
        "description": "Lets help the Bffs Emma and Kiara to attend the Oktoberfest today to enjoy the Bavarian cuisine. There are tons of beers and beverages for the guest in this feast and you can enjoy the Bavarian cuisine wih your favourite drinks, Come and enjoy this Oktoberfest maid dressup at 7sgames.com",
        "instructions": "Use mouse to control",
        "url": "https://html5.gamemonetize.com/4ys6792jsqqwwx8er6i3p8db62gct9t6/",
        "category": "Girls",
        "tags": "Cooking, Decoration, Dress Up, Family",
        "thumb": "https://img.gamemonetize.com/4ys6792jsqqwwx8er6i3p8db62gct9t6/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49236",
        "title": "New House Decoration",
        "description": "New House Decoration is an online game that you can play on Babygames for free. In this amazing game, you get to be the ultimate designer of your dream house. Decorate every room with awesome furniture, cute decorations, and beautiful colors, just the way you like it! But wait, theres more fun! You also get to style a fashionable girl. Dress her up in the latest trends, mix and match pretty outfits, shoes, and accessories. Show off your style and be the trendsetter!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/8nsi8nk8tp77acrymskcxbm64lm3oser/",
        "category": "Girls",
        "tags": "Baby Games, Decorate, Design, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/8nsi8nk8tp77acrymskcxbm64lm3oser/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48903",
        "title": "Baby Taylor Hair Day",
        "description": "Oh no! What did Taylor do. She squeezed glue on her hair while she was doing the crafts. Her hair became messy and rough. Gently wash Taylors hair with a mild shampoo and conditioner. Its time for Taylor to look fabulous in a trendy hairstyle. Show off your creative skills and braid Taylors fabulous hairstyle using colorful hair accessories. Finally, dress her up in stylish outfits and accessories.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/335wzh6moltwb9vrienwh7hdtjw5zy4x/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Decorate, Dress Up, Fashion, Girl, Girls, Hair, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/335wzh6moltwb9vrienwh7hdtjw5zy4x/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "49157",
        "title": "Walkers of fashion",
        "description": "Walkers of Fashion is a premier destination for fashion enthusiasts. With a keen eye for style and a passion for staying on-trend, we curate a diverse collection of clothing and accessories to elevate your wardrobe. Our team of fashion experts scours the globe to bring you the latest in vogue designs. Whether youre seeking chic streetwear or elegant evening wear, Walkers of Fashion has you covered. Explore our carefully selected pieces and discover your signature look. Step confidently into the world of fashion with us, where style knows no bounds.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/2rys1vl7jpjxdx3ygzmzsv78xbroqb8o/",
        "category": "Girls",
        "tags": "Arcade, Dress Up, Fashion, Girls, Makeover, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/2rys1vl7jpjxdx3ygzmzsv78xbroqb8o/512x384.jpg",
        "width": "400",
        "height": "600"
    },
    {
        "id": "48884",
        "title": "Ice Cream Maker With Dora",
        "description": "when dora need to sell ice cream. there is business",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/4wfe2pucet321fi3n8o6hsfo51kojv1l/",
        "category": "Girls",
        "tags": "Creation, Dora, Ice",
        "thumb": "https://img.gamemonetize.com/4wfe2pucet321fi3n8o6hsfo51kojv1l/512x384.jpg",
        "width": "450",
        "height": "680"
    },
    {
        "id": "49142",
        "title": "Makeup Doll Creator",
        "description": "Oh! Look at her dirty face! She needs your help to clean and make up, come and help makeup doll and become a fashion designer! Clean up the dirty little face and help the makeup doll regain her beauty! After cleaning the face, give the makeup doll a perfect makeup look! Eyebrows, eye shadows, color contacts, lipsticks... you can choose whatever you want ! After finishing the makeup, its time to choose todays outfit for the makeup doll! Are you going to wear a skirt or a dress today? Use your wonderful matching skills to match the most fashionable and cutest outfits for the makeup doll!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/x83o8fdaq5xqav69off36popk6107xkg/",
        "category": "Girls",
        "tags": "Anime, Baby Games, Barbie, Cartoon, Cute, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/x83o8fdaq5xqav69off36popk6107xkg/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "49124",
        "title": "Princess Girls Steampunk Rivalry",
        "description": "Welcome to the Princess Girls Steampunk Rivalry. Princess Anna, Elsa, Jasmine, Ariel, Moana, and Snow White are getting ready to attend a fun-themed party and they need your expert helping hand to properly get ready for it. The theme is steampunk and only you can help them slay some statement looks &ndash; are you ready to begin the fun? Come and join the Disney girls and have fun!",
        "instructions": "Left Mouse Button Click",
        "url": "https://html5.gamemonetize.com/3y2ithr5gbx58nnr5uyphkm2vplilyex/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Princess",
        "thumb": "https://img.gamemonetize.com/3y2ithr5gbx58nnr5uyphkm2vplilyex/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49125",
        "title": "Ellie Fashion Fever Game",
        "description": "Welcome to Ellie Fashion Fever. Ellie is a supermodel who is inspired more by the latest fashion trends. She tired of trying old fashion and plan try something unique. Help her to try different trends by browsing her wardrobe and picking cute outfits in each fashion style. And don&rsquo;t forget to try different hairstyles in each fashion.",
        "instructions": "Left Mouse Button Click",
        "url": "https://html5.gamemonetize.com/nqnc61umviui57gsforayhpkwgopsh7j/",
        "category": "Girls",
        "tags": "Barbie, Dress Up, Girls",
        "thumb": "https://img.gamemonetize.com/nqnc61umviui57gsforayhpkwgopsh7j/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49117",
        "title": "Love Couple Wedding Day",
        "description": "Love Couple Wedding Day is an online game that you can play on Babygames for free. The most magical dress-up game where youre the fashion wizard for the bride and groom. You can mix and match beautiful dresses, elegant veils, charming accessories, and handsome suits to create the perfect wedding look for the lovely couple. Let your creativity sparkle and make their special day even more fabulous. Lets make them the most dazzling duo on their wedding day!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/xvm1t0papuz92hp3n2b27zx8wtu6nfrc/",
        "category": "Girls",
        "tags": "Baby Games, Cute, Dress Up, Fashion, Girl, Girls, Kids, Love, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/xvm1t0papuz92hp3n2b27zx8wtu6nfrc/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "49035",
        "title": "Baby Panda Kindergarten",
        "description": "Welcome to Baby Panda: My Kindergarten, an enchanting game that offers a delightful and interactive experience for young children. Immerse your child in the captivating world of Baby Panda and explore the wonders of kindergarten through engaging activities and mini-games. With its vibrant visuals, intuitive gameplay, and educational content, this is the perfect game for preschoolers to learn and have fun simultaneously. Lets dive into the exciting features of this game!",
        "instructions": "Use the mouse or finger to tap to play ",
        "url": "https://html5.gamemonetize.com/sv78nw99cnsncbyaotz0yjlp5q1lcg05/",
        "category": "Girls",
        "tags": "Animal, Baby, Cars, Cartoon, Cat, Cute, Educational, Food, Fun, Girls, HTML5, Kids, Mobile, Panda",
        "thumb": "https://img.gamemonetize.com/sv78nw99cnsncbyaotz0yjlp5q1lcg05/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "48970",
        "title": "Princess Makeup Dressup Games",
        "description": "Princess Makeup Dressup Games is an online game that you can play on Babygames for free. In order to welcome the return of Princess, the king will hold a grand ball. She wants to dress up and meet the prince. Can you help her? Come join the princess dressing room and create the perfect princess!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/zxw0mbzvolzpsd8iai9ftu10e9f5kbxc/",
        "category": "Girls",
        "tags": "Baby Games, Cute, Dress Up, Fashion, Girl, Girls, Hair, Kids, Makeover, Nail, Princess, Simulation",
        "thumb": "https://img.gamemonetize.com/zxw0mbzvolzpsd8iai9ftu10e9f5kbxc/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48973",
        "title": "Twin Baby Care",
        "description": "Twin Baby Care is a delightful caring game. Play as a loving caregiver and take care of adorable twin babies. Feed, bathe, and dress up the babies to keep them happy and healthy. With its cute graphics and interactive gameplay, this game provides a realistic and nurturing experience. Enjoy the joys of parenthood in this fun and engaging game. Get ready to embrace the challenges of Twin Baby Care and create unforgettable memories!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ta7nr1d3v7yxvgsl5x0pacwbv81fczor/",
        "category": "Girls",
        "tags": "Baby, Cute, Doctor, Dress Up, Educational, Family, Food, Fun, Girls, HTML5, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/ta7nr1d3v7yxvgsl5x0pacwbv81fczor/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "49032",
        "title": "Girl Crazy Hair Challenge",
        "description": "Hairdressing time! You will become the boss of this hair salon and solve various hair problems for customers! Today, these four fashion girls come to your hair salon and want to solve their hair problrms. Please listen to their troubles and solve their hair problems! Have fun!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/n1wnuljdgk7wvedmng39aslm2zakkb2n/",
        "category": "Girls",
        "tags": "Baby Games, Cute, Decorate, Dress Up, Fashion, Girl, Girls, Hair, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/n1wnuljdgk7wvedmng39aslm2zakkb2n/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48849",
        "title": "Doll Cake Bakery Shop",
        "description": "Doll Cake Bakery Shop is an online game that you can play on Babygames for free. The owner of this lovely bakery has opened a new location downtown. Doll Cake Bakery brings different flavors of cakes for your wedding and birthday celebrations including strawberry cake, vanilla cake, pine apple cake, chocolate cake and caramel apple cake. Do you like chocolate cake? You can try a basic chocolate cake or try other variations from this doll cake bakery like strawberry cake, vanilla cake, pine apple cake or caramel apple cake.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/pa1jcmcknvkp37w87xk8l40winoyurmq/",
        "category": "Girls",
        "tags": "Baby Games, Cake, Cooking, Decorate, Design, Educational, Girl, Girls, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/pa1jcmcknvkp37w87xk8l40winoyurmq/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "48787",
        "title": "Fashion Walk intactgift",
        "description": "Choose the best outfits for each challenge concepts , to beat your fashion show opponent . Play now , and win the fashion shows !",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/fmwg9zochwkqn9x4mb4hdux2xuho1c8f/",
        "category": "Girls",
        "tags": "Fashion, Girls",
        "thumb": "https://img.gamemonetize.com/fmwg9zochwkqn9x4mb4hdux2xuho1c8f/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "48881",
        "title": "Organization Princess",
        "description": "Organization Princess is a captivating game. In this game, players can test and improve their organizational skills by arranging objects in various scenarios. With its challenging levels and intuitive gameplay, players must strategically place items to achieve a well-organized space. The game features a wide range of scenarios and vibrant visuals, enhancing the immersive experience. Organization Princess offers a fun and engaging challenge for those who enjoy order and tidiness. Have a good time!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/kl93wsa0a3ryddd8nwck98ya9by9u67m/",
        "category": "Girls",
        "tags": "Boys, Brain, Decorate, Food, Fun, Girl, Highscore, House, HTML5, Kids, Mobile, Princess, Puzzle, Skill",
        "thumb": "https://img.gamemonetize.com/kl93wsa0a3ryddd8nwck98ya9by9u67m/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "48860",
        "title": "Fashion Box: Glam Diva",
        "description": "Bonnie is one of the first influencers to try the life in plastic fashion challenge, and she could use your help to nail the look. Shes going to go for a glam diva look, and she needs your help to look stunning. Are you ladies ready for a one-kind dress-up game? Then lets get started with the Fashion Box: Glam Diva dress-up game for girls and see what chic look you can put together for our beautiful fashionista.",
        "instructions": "Use your mouse on your desktops Tap to play on mobile devices ",
        "url": "https://html5.gamemonetize.com/lvk1v1hf4j43dlvet022mgyis6p1sjsq/",
        "category": "Girls",
        "tags": "1 Player, 2D, Barbie, Dress Up, Fashion, Makeover",
        "thumb": "https://img.gamemonetize.com/lvk1v1hf4j43dlvet022mgyis6p1sjsq/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "48946",
        "title": "Beautiful Leg Model",
        "description": "Beautiful Leg Model is an online game that you can play on Babygames for free. Rebecca works as a leg model, but worst of all, she injures her leg on the eve of work! Can you treat her legs? Lets bandage and disinfect her wounds so they dont leave scars. Then pick out an outfit that will suit her photoshoot and work with her. Have fun!",
        "instructions": "Desktop Mouse click and drag to play Mobile Tap and slide to play ",
        "url": "https://html5.gamemonetize.com/2we3n020l013jsrwyr6lre603z7uuiab/",
        "category": "Girls",
        "tags": "Baby Games, Doctor, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation, Surgery",
        "thumb": "https://img.gamemonetize.com/2we3n020l013jsrwyr6lre603z7uuiab/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48660",
        "title": "Lovely Couple Wedding Photo",
        "description": "Great!!! Zoe and Kris are getting married! Zoe wants to take funny photos at their wedding, this is really a good idea! Lets help the couple dress up for their wedding first. Then, choose a photo booth backdrop and pick some funny ornaments and props to create silly and funny photos. Have fun playing this game!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/fi79uz3np2cz1bq17b0fm1v1q0v2bio6/",
        "category": "Girls",
        "tags": "Baby Games, Dress Up, Fashion, Girl, Girls, Kid, Kids, Love, Simulation",
        "thumb": "https://img.gamemonetize.com/fi79uz3np2cz1bq17b0fm1v1q0v2bio6/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "46970",
        "title": "Dress up Toca Boca Fan",
        "description": "A fan-made game inspired by Toca Bocas colorful and creative style where you find a variety of colorful and imaginative dresses to engage in fun and creative gameplay. Dress-up Toca Boca girl who can be styled with an array of dresses and accessories. With Toca Bocas intuitive interface, kids can mix and match different outfits to create their own unique looks for the character, fostering their creativity and imagination while having fun. With the ability to mix and match outfits and hairstyles, kids can let their imaginations run wild and create countless unique combinations, making Toca Bocas dress-up games even more engaging and fun.",
        "instructions": "Use mouse for choose prefered dress picking out the right accessories or simply exploring different style options ",
        "url": "https://html5.gamemonetize.com/vevkzldst8j1ke9q4eo7wvkhk3123ivw/",
        "category": "Girls",
        "tags": "2D, Dress Up, Girl, Girls",
        "thumb": "https://img.gamemonetize.com/vevkzldst8j1ke9q4eo7wvkhk3123ivw/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "48878",
        "title": "Fashion Dress In Super Style",
        "description": "The movie Incredible Family is so wonderful! The super family is very popular in the world, the Bffs Adella, Rebecca and Jade are all like them very much! So, they have an idea to dress in Incredible 2 style to express their love for the characters. Maybe they will become the members of the family!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/dy2t86mlmguwjdvwfuk98q2loq0ev68c/",
        "category": "Girls",
        "tags": "Baby Games, Cartoon, Cute, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/dy2t86mlmguwjdvwfuk98q2loq0ev68c/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48766",
        "title": "Super Girls Fall Fashion trends",
        "description": "Welcome to Super Girls Fall Fashion trends. If you want to stay trendy this autumn play this new game called Super Girls Fall Fashion to dress up the super girls. These cute girls are real fashion addicts and they have just renewed their wardrobe. The girls are ready for autumn so hurry up and explore their wardrobe to see what kind of fashionable clothing pieces they hide there.",
        "instructions": "left mouse button click",
        "url": "https://html5.gamemonetize.com/1ovmm51j54ii5etc4qrd5hmyj2qbk8hb/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girls",
        "thumb": "https://img.gamemonetize.com/1ovmm51j54ii5etc4qrd5hmyj2qbk8hb/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48669",
        "title": "Girls Nail Salon",
        "description": "Girls Nail Salon is an interesting simulation game, we can be free for nail art style. All kinds of beautiful manicures can be freely matched. Come and play it!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/in6pkz9ymvcnspp1dz5vm4g715nlm1xj/",
        "category": "Girls",
        "tags": "Christmas, Fashion, Fun, Girl, Halloween, Holiday, HTML5, Kids, Makeover, Mobile, Nail, Simulation",
        "thumb": "https://img.gamemonetize.com/in6pkz9ymvcnspp1dz5vm4g715nlm1xj/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "48859",
        "title": "Frozen Learning The Body Online",
        "description": "Frozen Learning The Body Online is an innovative, interactive, and engaging educational game that takes learning about the human body to a whole new level. In a world dominated by screens and technology, this game stands out as a fantastic way for both children and adults to explore the intricacies of the human body while having a blast.",
        "instructions": "Use mouse to play Frozen Learning The Body Online ",
        "url": "https://html5.gamemonetize.com/dh7z8bc26wzqxi1n3ntfi9lbcbssuala/",
        "category": "Girls",
        "tags": "Educational, Elsa, Frozen",
        "thumb": "https://img.gamemonetize.com/dh7z8bc26wzqxi1n3ntfi9lbcbssuala/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48845",
        "title": "Blonde Chibi Fashion Show",
        "description": "Blondie and Kenneth live in the fun country of Blondieland. Fashion shows are regularly held in this country. Blondie and Kenneth love fashion and style. Help them to choose a stylish look for participation in the show. Choose from a variety of outfits and accessories. You can also change the color of clothes, shoes and hair! Get an unforgettable experience in the game Blonde Chibi Fashion Show on the site dressupwho.com.",
        "instructions": "Use Mouse left click to browse around the game ",
        "url": "https://html5.gamemonetize.com/lkmc0ijjo9mj17enjkctuv0lwxqnc3eh/",
        "category": "Girls",
        "tags": "1 Player, 2D, Anime, Barbie, Cartoon, Cute, Dress Up, Fantasy, Fashion, Fun, Game, Girls",
        "thumb": "https://img.gamemonetize.com/lkmc0ijjo9mj17enjkctuv0lwxqnc3eh/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48366",
        "title": "Violet Fall Fashion Shoot",
        "description": "Welcome to Violet Fall Fashion Shoot. Superhero violet is so boring on fight with villains. So she comes up with a new idea for this Autumn. She planned to take some photoshoot under the fall theme and post it on her social media. Join and help our favourite hero to be a super model on social media. Have fun!",
        "instructions": "left mouse button click ",
        "url": "https://html5.gamemonetize.com/fahahawefja83ushr2i8sdmayymvx2zc/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girls, Makeover",
        "thumb": "https://img.gamemonetize.com/fahahawefja83ushr2i8sdmayymvx2zc/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48525",
        "title": "Body Doctor Little Hero",
        "description": "The best hospital simulation game is coming Want to be an excellent body doctor? Your patient has broken an arm or a leg in pain. They need your help to do the x-ray. A special machine is used to scan the patients head, chest or legs. Be a little hero and heal them all!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/rwe6rbx9asx7xqvyaq9jvesr4554plnc/",
        "category": "Girls",
        "tags": "Baby Games, Cute, Doctor, Educational, Girl, Girls, Kids, Simulation, Surgery",
        "thumb": "https://img.gamemonetize.com/rwe6rbx9asx7xqvyaq9jvesr4554plnc/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48693",
        "title": "Fashion Icon Streamer Makeover",
        "description": "You are the hottest Streamer. Everyone knows your name. Its time to lead the way! The world is waiting. Youre going to have a great time in the fashion world and your friends will love your new look. To get ready for your collection debut, you should hit the salon for a big makeover and a new look for your big night. After the makeover, you can wear your own unique fashion design. Are you ready to become the next big thing in fashion?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/7stvlwkt9fl9etozh51ev46s0bhzvpez/",
        "category": "Girls",
        "tags": "Baby Games, Cute, Design, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Puzzle, Simulation",
        "thumb": "https://img.gamemonetize.com/7stvlwkt9fl9etozh51ev46s0bhzvpez/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "48670",
        "title": "Dye Fashion",
        "description": "Dress Dye is an exciting fashion game that allows players to express their creativity and design skills. In this game, players are presented with a variety of dresses and are given the opportunity to unleash their inner fashion designer by dyeing them in vibrant and unique colors. From elegant evening gowns to casual dresses, Dress Dye offers a wide range of styles to choose from. With a simple and intuitive interface, players can easily select the dress they want to dye and then experiment with different color combinations to create their own personalized masterpiece. Have fun",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/kchjxmnlh98qftttbzrqmlz129c2h004/",
        "category": "Girls",
        "tags": "Design, Dress Up, Fashion, Fun, Girls, Highscore, HTML5, Kids, Mobile, Relaxation, Simulation",
        "thumb": "https://img.gamemonetize.com/kchjxmnlh98qftttbzrqmlz129c2h004/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "47565",
        "title": "Airport Manager Online",
        "description": "Do you have what it takes to be an Airport Manager and run your own airline? Give Airport Manager Online a try! In Airport Manager Online, youll assume various roles like overseeing security checks, validating boarding passes, piloting planes, and assisting passengers in locating their lost belongings. Utilize your exceptional management skills to transform your airport into the ultimate destination. Dive into the world of airport mysteries and embark on an exciting gameplay experience! Enjoy endless entertainment with Airport Manager Online!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/sg0qh3o90hxhdvsggxqfuwuihhhsr3vo/",
        "category": "Girls",
        "tags": "2D, airplane, Casual, Cute, Educational, Management, Plane, Simulation",
        "thumb": "https://img.gamemonetize.com/sg0qh3o90hxhdvsggxqfuwuihhhsr3vo/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "48633",
        "title": "Summer Aesthetics",
        "description": "Hop on a plane and spend your summer vacation traveling around the world together with your favorite Disney princesses. Discover beautiful sceneries and practice your fashion advisor skills while helping them choose their outfits of the day in the Summer Aesthetics Dress Up Game for girls! Have a blast!",
        "instructions": "Use your mouse on your desktop and tap to play on your mobile device ",
        "url": "https://html5.gamemonetize.com/o1r25m69jjjvgxgb8p4xp9i6zkgmod50/",
        "category": "Girls",
        "tags": "1 Player, Dress Up, Fashion, HTML5, Mobile, Princess",
        "thumb": "https://img.gamemonetize.com/o1r25m69jjjvgxgb8p4xp9i6zkgmod50/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "48547",
        "title": "Romantic Wedding Ring Design",
        "description": "Zoe is going to get married with Kris, their wedding will be held next month! Today, the couple come to your jewelry studio to choose the wedding ring, they want to have a perfect ring for this special moment. Now its time to design the perfect wedding ring for them!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/nwbimq2q37oz65ne0drx9g2lb2taql78/",
        "category": "Girls",
        "tags": "Baby Games, Decorate, Design, Fashion, Girl, Girls, Kids, Love, Simulation",
        "thumb": "https://img.gamemonetize.com/nwbimq2q37oz65ne0drx9g2lb2taql78/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48527",
        "title": "Doll Dreamhouse Adventure",
        "description": "What kind of house do you have in mind? Do you want to own and design your own dolls house? In Doll Dreamhouse Adventure, you can have it all! You can design the dolls room! First pick your favorite doll! And the adventure begins! Hundreds of items for you to choose and manipulate! Can you discover your favorite design? Try this game! Have fun!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/3uqe2wcl7khhfxjtul7iefqvf38xkudj/",
        "category": "Girls",
        "tags": "2D, Animal, Casual, Cute, Educational, Girl, Kid, Matching",
        "thumb": "https://img.gamemonetize.com/3uqe2wcl7khhfxjtul7iefqvf38xkudj/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "48661",
        "title": "Dog Cat Surprise Pet Spa",
        "description": "Experience the fun girl pet salon game! You can do manicures, cut nails, and make-up for each dog and girl. Meet some good friends and cute pet dogs! Join us and experience various tool operations in the game. Also, dress up and get ready to take pictures! Everything is possible in the game!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/wb3mcob33moyoyqh5h1t0qoiusolo494/",
        "category": "Girls",
        "tags": "Animal, Baby Games, Barbie, Decorate, Design, Dress Up, Girl, Girls, Grooming, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/wb3mcob33moyoyqh5h1t0qoiusolo494/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48647",
        "title": "Grimace Coloring Book",
        "description": "Introducing the enchanting world of the Grimace Coloring Book, where imagination knows no bounds! This captivating online coloring game is a delightful haven for kids of all ages to embark on a creative journey like no other, and the best part? Its absolutely free! Grimace, the lovable, enigmatic character, takes center stage in this digital canvas of endless possibilities. With a simple click of a mouse or a tap of a finger, young artists can breathe life into Grimaces world, adding their personal touch to each page. The Grimace Coloring Book offers an array of mesmerizing scenes and intricate designs, all thoughtfully curated to inspire.",
        "instructions": "Use left mouse click to play ",
        "url": "https://html5.gamemonetize.com/m37k84287punawt9agq6wmh50njkcu2k/",
        "category": "Girls",
        "tags": "Coloring, Grimace, Grimace Shake, HTML5, Hypercasual, Kids, School",
        "thumb": "https://img.gamemonetize.com/m37k84287punawt9agq6wmh50njkcu2k/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "48468",
        "title": "TikTok Floral Trends",
        "description": "In our next game, you will discover another summer trend that is inspired by the beautiful colors of the summer. The game stars Kiki, an amazing artist, who shares her unicorn-themed makeup look that was inspired by the magical world of the unicorns. It continues with Olivias passion for red and glitzy accessories, and it ends with you dealing with Reginas makeup look. Play today and have a lot of fun being a makeup artist!",
        "instructions": "Use your mouse to play on desktop tap to play on mobile devices ",
        "url": "https://html5.gamemonetize.com/ocez3f0nmtgq0pok9ftrpxhy0fp4z3k6/",
        "category": "Girls",
        "tags": "1 Player, Fashion, HTML5, Makeover, Mobile, Summer",
        "thumb": "https://img.gamemonetize.com/ocez3f0nmtgq0pok9ftrpxhy0fp4z3k6/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "48180",
        "title": "Perfect Tokyo Street Style",
        "description": "Welcome to the Perfect Tokyo Street Style. Princess Elsa, Anna, Moana, Ariel, Snow White, and Jasmine are the best friends. They planned to throw a surprise weekend fashion party. Everyone agreed to try Tokyo street style Fashion. join and browse the princesses wardrobe for the best collection of outfits and costumes. Play and have fun!",
        "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
        "url": "https://html5.gamemonetize.com/2limyohhz69m0ryk27628lok7imue8uu/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girls, Makeover",
        "thumb": "https://img.gamemonetize.com/2limyohhz69m0ryk27628lok7imue8uu/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48515",
        "title": "Princesses Castle",
        "description": "Princesses Castle is an enchanting game that will transport you to a world of fairy tales and fantasy. Step into the shoes of a princess and explore a magnificent castle filled with secret chambers and hidden treasures. Use your wits and solve puzzles to unlock doors and unveil the castles secrets. Along the way, encounter magical creatures and make new friends as you navigate through the captivating storyline. Embark on an unforgettable adventure and let Princesses Castle whisk you away to a realm where dreams come true.",
        "instructions": "Use the mouse or finger to take care of princesses ",
        "url": "https://html5.gamemonetize.com/1ajbxo8nmof5pj0jhe126vagb3262i8a/",
        "category": "Girls",
        "tags": "Castle, Cleaning, Cute, Decorate, Decoration, Dress Up, Fashion, Fun, Girl, HTML5, Kids, Mobile, Princess",
        "thumb": "https://img.gamemonetize.com/1ajbxo8nmof5pj0jhe126vagb3262i8a/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "48501",
        "title": "Fashion Closet Makeover",
        "description": "Spring is coming! Its time to tidy the closet. Please help Zoe clean her closet and place all items of winter in the basket. Then redesign the closet with some new fashion decorations. Finally, lets create a spring outfit for Zoe.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/bci4ftfqclm4kfh4qyw20g9yhjlnxq3u/",
        "category": "Girls",
        "tags": "Baby Games, Decorate, Design, Dress Up, Fashion, Girl, Girls, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/bci4ftfqclm4kfh4qyw20g9yhjlnxq3u/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48175",
        "title": "BFFs City Chic Fashion",
        "description": "Welcome to the BFFs City Chic Fashion. Rainbow Girls Sunny, Skyler, Ruby, and Violet have an idea to try Plus-sized clothing. Yes! Its city chic fashion. Browse the wardrobe and find a cute set of outfits for the girls. Join and play these new dress-up games for girls. Have fun!",
        "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
        "url": "https://html5.gamemonetize.com/rrc6fgfru5f85gsu1xz4yj94zn5p7zxk/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girls",
        "thumb": "https://img.gamemonetize.com/rrc6fgfru5f85gsu1xz4yj94zn5p7zxk/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48451",
        "title": "Boca Moca Freelancer",
        "description": "Have you ever earned money by working from home? Now is the perfect time. Earn money by working from home, protect your computer from viruses, and add to your income by doing the right coding. But remember, youre a sweet girl and you might get hungry and change your hairstyle. You can also bring in items for your home. Everything is in your hands.",
        "instructions": "You can use the WASD keys to play the game or you can easily play both on desktop and mobile using the touchscreen controls available on the screen ",
        "url": "https://html5.gamemonetize.com/x41vskbcmd10hqr7rrnh1iq9t47hfusd/",
        "category": "Girls",
        "tags": "1 Player, 2D, Baby, Baby Games, Barbie, Cartoon, Girl, Girls, Simulation, Simulator",
        "thumb": "https://img.gamemonetize.com/x41vskbcmd10hqr7rrnh1iq9t47hfusd/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48345",
        "title": "DIY Locker",
        "description": "DIY Locker is a unique and exciting game that allows players to explore their creativity and design skills. With a wide range of customization options, players can create their own lockers by selecting various backgrounds, stickers, and accessories. Whether its a girly locker filled with cute decorations or a sporty locker showcasing a favorite team, the possibilities are endless. Get ready to unleash your inner designer and create the locker of your dreams in DIY Locker, available exclusively on Yiv.com.",
        "instructions": "Use the mouse or finger to decorate the lockers ",
        "url": "https://html5.gamemonetize.com/6hm1wvpqcg0mcb5a01205ua810qhevg1/",
        "category": "Girls",
        "tags": "Cute, Decorate, Decoration, Fashion, Football, Fun, Girl, HTML5, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/6hm1wvpqcg0mcb5a01205ua810qhevg1/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48452",
        "title": "Kitty Unicorn Daily Care",
        "description": "We thought of this animal game where you can play with a cute kitten who is also a fabulous unicorn. Your task will be to groom her and also take care of her. Not only can you play the built-in mini games, but you can also spend quality time with Kate the unicorn kitten. Play this game with Kate and enjoy the whole day.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/hcutgk16d7z6y21tt6kakj3ms56vo6gg/",
        "category": "Girls",
        "tags": "Animal, Baby, Baby Games, Cute, Decorate, Design, Dress Up, Fashion, Girl, Girls, Grooming, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/hcutgk16d7z6y21tt6kakj3ms56vo6gg/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48405",
        "title": "Princess Tailor Shop",
        "description": "Tailor made game for girls with many levels and decorations. Princess Tailor Shop fashion game is a free fun game for kids. This is a tailor fashion designer game. Make perfect dresses using real tailor sewing machine. This is fashion tailor shop! Now you will play as a fashion tailor in this mini game. Enjoy!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/zt0ut9yc3k21w85lu2clbej9irtejmuc/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Cute, Decorate, Design, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/zt0ut9yc3k21w85lu2clbej9irtejmuc/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48352",
        "title": "Summer Festivals Fashion",
        "description": "This summer, festivals are back in trend, and you will have a blast attending 3 famous parties in our dress-up game for girls called Summer Festivals Fashion. Get it started, and have a great time creating jaw-dropping #ootd for these 6 BFFs getting ready to dance, dance, dance while looking in style. Have a blast!",
        "instructions": "Use your mouse to play on desktops and tap to play on mobile devices ",
        "url": "https://html5.gamemonetize.com/osmt2mnv7jm50pkuywdo5r9yrnoloprz/",
        "category": "Girls",
        "tags": "1 Player, Dress Up, Fashion, Girl, Girls, HTML5, Mobile, Summer",
        "thumb": "https://img.gamemonetize.com/osmt2mnv7jm50pkuywdo5r9yrnoloprz/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "48380",
        "title": "Fashion Maid Coffee",
        "description": "Sofia opened a maid cafe this weekend and she invites her friends Adella, Rebecca and her sister Zoe to help. Now help them dress up in maid style.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/yuw2efawxtlqcynvd9ndwimra63119a0/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/yuw2efawxtlqcynvd9ndwimra63119a0/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48342",
        "title": "Baby Taylor Pizza Chef",
        "description": "The pizzeria is open! Free pizza games for kids are here! Enjoy Baby Taylor Pizza Chef and serve delicious pizza to friends! Fun kids games are waiting for all little chefs! Has anyone ordered such a great pizza, great pizza? Were delivering fresh, juicy pizza all over the world in 30 minutes because these are free pizza games for kids and theyre opening their own pizza shop! Incredible free pizza making fun!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/rra99tivcnjq553tcvdormnjib45a2id/",
        "category": "Girls",
        "tags": "Baby, Baby Games, Cooking, Cute, Decorate, Educational, Food, Girl, Girls, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/rra99tivcnjq553tcvdormnjib45a2id/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "48343",
        "title": "Life Spa Salon Asmr",
        "description": "Life Spa Salon is a remarkable ASMR game on Yiv.com. With soothing visuals and immersive audio, this game offers a virtual salon experience that tingles the senses and induces relaxation. From the gentle sounds of running water and the soft humming of hairdryers to the delicate brushes and taps on various objects, every step is carefully crafted to create a deeply calming and pleasurable ASMR experience. Life Spa Salon is a must-visit for anyone seeking tranquility and stress relief through ASMR.",
        "instructions": "Use the mouse or finger to play ",
        "url": "https://html5.gamemonetize.com/ousx2vr8236e3ybf5ymgtcicyu5z2v5h/",
        "category": "Girls",
        "tags": "Animal, Cute, Dress Up, Fashion, Fun, Grooming, Hair, HTML5, Kids, Makeover, Mobile, Nail, Relaxation, Witch",
        "thumb": "https://img.gamemonetize.com/ousx2vr8236e3ybf5ymgtcicyu5z2v5h/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48182",
        "title": "BFFs Travelling Vibes",
        "description": "Welcome to the BFFs Travelling Vibes. Princesses Anna, Elsa, Moana, Ariel, Jasmine, and Snow White are in a travelling mood. But they have a dilemma to choose the destination. Help the girls to find out the perfect location for each one of them. It&rsquo;s simple! Just spin the wheel to find the destination. Sounds fun right! Play and have fun!",
        "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
        "url": "https://html5.gamemonetize.com/xnccf41o7pueo99o0igimzjeqj2rhdas/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girls, Makeover, Princess",
        "thumb": "https://img.gamemonetize.com/xnccf41o7pueo99o0igimzjeqj2rhdas/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48311",
        "title": "Fashion Shoes Designer",
        "description": "Zoe will attend a royal ball, now she lacks a pair of beautiful shoes, can you design one for her? First, decide the shoe shape, draw it with a pencil. Then paint the shoe and decorate it with fashion patterns.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/7t7znoc53vldi8ucyfrpudvl1auirw05/",
        "category": "Girls",
        "tags": "Decorate, Design, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/7t7znoc53vldi8ucyfrpudvl1auirw05/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48288",
        "title": "Cute Dentist Bling",
        "description": "Liliths teeth have gotten seriously sick! Let the little dentist help her! In Cute Dentist Bling you will play as a dentist! You need to serve all kinds of interesting patients! Can you cure them perfectly? Its time to show your medical knowledge! Have fun!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ju7zqs6p8z0kqi4dz5kfxan680zf1dyx/",
        "category": "Girls",
        "tags": "2D, Casual, Cute, Doctor, Educational, Kid, Simulation",
        "thumb": "https://img.gamemonetize.com/ju7zqs6p8z0kqi4dz5kfxan680zf1dyx/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "48284",
        "title": "Lucy Dog Care",
        "description": "Meet Lucy and become an instant friend because she will need you in no time. Whether shes hungry or tired, or even in the mood for a relaxing bubble bath, you should get to know her and please her. Make sure to complete each task and give it the necessary attention. We all know how important the appearance of this fancy lady dog is, so dont forget to add her style. Put on a nice dress and maybe complete her transformation. Try some pants with a nice top, or a skirt is also a fun option. Play with Lucy and have fun taking care of her.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/cv6khj3s0smdhqtvcy0oahpr39om6ftc/",
        "category": "Girls",
        "tags": "Animal, Baby, Decorate, Design, Dress Up, Educational, Fashion, Girl, Girls, Grooming, Kids, Makeover",
        "thumb": "https://img.gamemonetize.com/cv6khj3s0smdhqtvcy0oahpr39om6ftc/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48035",
        "title": "BFFs Kimono Fashion",
        "description": "Welcome to BFFs Kimono Fashion. Princesses Anna, Elsa, Moana, Ariel, Snow White, and Jasmine are planning to try Japanese traditional fashion. Yes, it&rsquo;s Kimino fashion. Girls are so excited to try it out to show their stunning looks. Help the girls by browsing their wardrobes and picking suitable costumes for each one. Play and have fun!",
        "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
        "url": "https://html5.gamemonetize.com/qkdjaecv2iv7ne1yqcfyobadwqwz93zy/",
        "category": "Girls",
        "tags": "Cute, Dress Up, Fashion, Girls, Princess",
        "thumb": "https://img.gamemonetize.com/qkdjaecv2iv7ne1yqcfyobadwqwz93zy/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48216",
        "title": "Doll Unbox Dress Up",
        "description": "Do you want to create your own toy doll? Do you like to dress up them and combine fashion pieces? If you also happen to like collecting and blind boxes, thats great! This game is tailored for you! Hurry up, enjoy personalized DIY!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/yvqfytw3qwzpgffqwj7giiagyv4bz2nv/",
        "category": "Girls",
        "tags": "3D, 3D Games, Baby, Cute, Dress Up, Fashion, Girl, Girls, Kid, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/yvqfytw3qwzpgffqwj7giiagyv4bz2nv/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48195",
        "title": "Random Matching Wedding",
        "description": "This evening will have a interesting random matching wedding party, Sofia, Zoe and Rebecca decide to go to the party, who are their respective grooms tonight? First lets dress them up and help them prepare for the party, then find the Mr.Right!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/m0zcaizv4671if9zreqiz3ajtoof1wjg/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girl, Girls, Kids, Love, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/m0zcaizv4671if9zreqiz3ajtoof1wjg/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48142",
        "title": "Pony Cute Baby Birth",
        "description": "Pony will give birth to a baby today, now help her find all things necessary for the baby, dummy, nappies, bibs and so on. After that, you have an opportunity to be a real designer of her little baby carriage! Decorate the baby carriage and make it bright as Pony likes! At the hospital, you need to take a surgery for her to make sure her baby is safe and then take care of this baby. Have fun!",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/ofy296g0z9ijej6d45exqffkwqrozje6/",
        "category": "Girls",
        "tags": "Animal, Baby, Cute, Doctor, Dress Up, Girl, Girls, Grooming, Kids, Pony, Simulation",
        "thumb": "https://img.gamemonetize.com/ofy296g0z9ijej6d45exqffkwqrozje6/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48034",
        "title": "Princess Runway Fashion Look",
        "description": "Welcome to the Princess Runway Fashion Look. Princesses Anna, Elsa, Moana, Ariel, Snow White, and Jasmine are eagerly waiting for an upcoming fashion event. They planned to show their fashion skill with their stunning look to attract everyone. Help the princess by browse the wardrobe and pick a perfect outfit for each one of them.",
        "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
        "url": "https://html5.gamemonetize.com/1jvshxkl0e32wxwupnciz69bdt65zs2s/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girls, Princess",
        "thumb": "https://img.gamemonetize.com/1jvshxkl0e32wxwupnciz69bdt65zs2s/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47937",
        "title": "wednesday Dance Moves",
        "description": "wednesday Dance Moves",
        "instructions": "Click ",
        "url": "https://html5.gamemonetize.com/cn46bv8r4u7hhwrm0dffeeaj2u5y87hq/",
        "category": "Girls",
        "tags": "3D Games, Dancing, Horse, Music",
        "thumb": "https://img.gamemonetize.com/cn46bv8r4u7hhwrm0dffeeaj2u5y87hq/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47986",
        "title": "Strawberella",
        "description": "This strawberry princess-inspired dress-up game is sure to turn heads as it showcases an amazing fashion design challenge featuring a beautiful pink dress, a makeup artist challenge that will get you glamming up like never before, and an accessory extraordinaire challenge where you get to accessorize your looks beyond imagination. Play today!",
        "instructions": "Use your mouse when playing on a desktop Tap to play on mobile devices ",
        "url": "https://html5.gamemonetize.com/w08jlpq6rssqzyyoef2jmwck3uo4ki6y/",
        "category": "Girls",
        "tags": "1 Player, Decorate, Decoration, Design, Dress Up, Fashion, Girl, HTML5, Makeover, Princess, Summer",
        "thumb": "https://img.gamemonetize.com/w08jlpq6rssqzyyoef2jmwck3uo4ki6y/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "48165",
        "title": "Doll Avatar Maker Creator",
        "description": "Welcome to Doll Avatar Maker Creator! Choose your favorite match and design your perfect doll ! In the world of avatar maker creator game, you will have your own wardrobe! beautiful dress,fancy makeup and pretty hairstyles for you to choose! Also,there are more interesting pinching items are waiting for you to discover! Come and join the world of Doll Avatar Maker Creator!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ambhsgg0fow6x9lzo6wnvqpuurecb19r/",
        "category": "Girls",
        "tags": "Baby, Cute, Decorate, Design, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/ambhsgg0fow6x9lzo6wnvqpuurecb19r/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48160",
        "title": "Fancy Girls Dress Up",
        "description": "Get ready for a fabulous fashion adventure with Fancy Girls Dress Up! Unleash your creativity and design stunning, glamorous looks for the ultimate fashion makeover. Dive into a world of luxurious outfits, trendy accessories, and elegant hairstyles that will make heads turn. Explore a vast collection of chic dresses, stylish tops, elegant skirts, and trendy pants. Mix and match to create the perfect ensemble for every occasion &ndash; from high-class parties to red carpet events!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/imj67pu3cir6o0uzoh6596o9nxbzctgc/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girl, Girls, Kid, Kids, Makeover",
        "thumb": "https://img.gamemonetize.com/imj67pu3cir6o0uzoh6596o9nxbzctgc/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48126",
        "title": "BFFs Act Circus Artist",
        "description": "Lets help our girls Ava, Emma and Clara to get ready for their circus show and make them happy with awesome outfits and suitable accessories and property which are required for the show. Encourage these artist to perform well in the show and enjoy this dressup game at 7sgames.com",
        "instructions": "Use mouse only",
        "url": "https://html5.gamemonetize.com/bt78tsp2g3v401jtfqnlbcug166e5z5m/",
        "category": "Girls",
        "tags": "Baby Games, Dress Up, HTML5",
        "thumb": "https://img.gamemonetize.com/bt78tsp2g3v401jtfqnlbcug166e5z5m/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48121",
        "title": "Perfect Dress Designer",
        "description": "Do you want that dress? All you have to do is say yes! Customers are lining up at your store looking for help. They are looking for that next style fad that will make them stand out with the stars. Pull out a basic dress and style it however you like. Change the color, add some sparkles, have a new cut or design; the final look is limitless in this fashion designer dresses simulator. People want to look trendy with the latest fad, and it&rsquo;s up to your keen eye to make this a reality.",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/gwx02xjlill5cq6bonkzctwsu16dn6lz/",
        "category": "Girls",
        "tags": "3D, 3D Games, Arcade, Decorate, Design, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/gwx02xjlill5cq6bonkzctwsu16dn6lz/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "48143",
        "title": "Mermaid Makeup Salon Game",
        "description": "Mermaid Makeup Salon is a magical virtual beauty haven, where you can unleash your creativity and transform the mermaid into a stunning beauty. From glamorous makeup to stunning hairstyles, this salon offers a wide range of options to adorn your regal appearance. With its user-friendly interface and high-quality graphics, this salon provides an immersive and enjoyable experience for all makeup enthusiasts. Get ready to embrace your inner princess and embark on a magical makeover journey at Mermaid Makeup Salon!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/9tcz57kzjimjukhnl9s92obdj59yh4n9/",
        "category": "Girls",
        "tags": "Cute, Dress Up, Fantasy, Fashion, Fun, Girl, Hair, HTML5, Jewel, Kids, Makeover, Mermaid, Mobile, Princess",
        "thumb": "https://img.gamemonetize.com/9tcz57kzjimjukhnl9s92obdj59yh4n9/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48076",
        "title": "Beauty Makeover Games",
        "description": "Choose one customer to start the game. Remove her contact lenses and false eyelashes. Melt the wax and remove the hair on his face. Use the machine to scan the problems and remove bugs. Use a scraper to clean the dirt on the tongue.",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/9h8xin5r66lrcmel67z6t9t7uuti9yul/",
        "category": "Girls",
        "tags": "Boy, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/9h8xin5r66lrcmel67z6t9t7uuti9yul/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48077",
        "title": "Summer Pool Party Fashion",
        "description": "Summer is coming! BFFs Zoe, Rebecca and Jadee are all invited to join a pool party, but they cant go there just like this. Please help them dress up, pick fashion and sexy swimsuit costumes for them. They will be very glad for your help, thank you! Have fun in this game with our friends.",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/i48wqgb6sqnrhvay4twkp9chsxbon90v/",
        "category": "Girls",
        "tags": "Decorate, Design, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/i48wqgb6sqnrhvay4twkp9chsxbon90v/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "48003",
        "title": "Bubble Pop Shooter",
        "description": "Bubble Pop! Puzzle Game Legend is a highly addictive bubble shooter game loved by millions! This bubble shooter will eliminate your boredom in no time! You&rsquo;ll spend hours of fun popping same-colored bubbles! Just shoot all the colorful bubbles to clear the board and win coins! Use epic boosters to burst all the bubbles and solve the tricky puzzles! Blast your way to victory in this explosive bubble pop game! Are you ready to pop some bubbles?",
        "instructions": " bull Aim carefully and tap to shoot bull Match 3 or more bubbles to make them pop bull Use less shots to score higher and earn 3 stars bull Create powerful boosters to pop more bubbles ",
        "url": "https://html5.gamemonetize.com/ghf2vfe407pnrw9tfw6qim0i6aegu0m9/",
        "category": "Girls",
        "tags": "1 Player, 2D, Ball, Bubble, Bubble Shooter, Cartoon, Classic, Click, Puzzle",
        "thumb": "https://img.gamemonetize.com/ghf2vfe407pnrw9tfw6qim0i6aegu0m9/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "47848",
        "title": "Summer Floral Prints",
        "description": "Get ready to embrace the summer with our dress-up game, Summer Floral Prints! Explore the playful and feminine fashion trend of floral prints. Create stunning #ootd looks for 5 BFFs as they conquer the bustling boulevard in style. Get ready for endless fun and fashion-forward moments!",
        "instructions": "For desktop devices use your mouse to play On mobile devices tap to play ",
        "url": "https://html5.gamemonetize.com/9ewtiai50trngnncgacrbsbqrv1fb71r/",
        "category": "Girls",
        "tags": "1 Player, Dress Up, Fashion, Girl, Girls, HTML5, Mobile, Princess",
        "thumb": "https://img.gamemonetize.com/9ewtiai50trngnncgacrbsbqrv1fb71r/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "48052",
        "title": "Fidget Spinner Design",
        "description": "Recently, fidget spinner is so popular, Sofia, Zoe and Rebecca want to have a try. First, they need to design their own spinners by themselves, then starting a fidget spinner contest! Have fun!",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/p2wjp15xikhf73j9s2wn1cyvei2b1bvf/",
        "category": "Girls",
        "tags": "Arcade, Decorate, Design, Fashion, Girl, Girls, Kids, Simulation, Skill",
        "thumb": "https://img.gamemonetize.com/p2wjp15xikhf73j9s2wn1cyvei2b1bvf/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47879",
        "title": "Cute Anime Girls Clicker",
        "description": "Welcome to Cute Anime Girls Clicker the ultimate clicker game that invites you to delve into the enchanting world of hidden anime girls! Embark on a captivating journey where each click unravels the veil of secrecy surrounding these elusive characters. Improve your click power to uncover even more hidden anime girls. As you progress, youll unlock new characters, each more enchanting than the last.",
        "instructions": "Simple control just a mouse or touchscreen Left mouse button or touch the screen to earn money and upgrade ",
        "url": "https://html5.gamemonetize.com/mijuu8mr474jdfhgl4grtyqd71mbx873/",
        "category": "Girls",
        "tags": "2D, Adult, Anime, Boy, Boys, Clicker, Girl, Girls, Hot, Mobile, unity, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/mijuu8mr474jdfhgl4grtyqd71mbx873/512x384.jpg",
        "width": "600",
        "height": "800"
    },
    {
        "id": "47998",
        "title": "Wedding Dress Designer",
        "description": "Two new customers has come to Rebeccas wedding dress design studio, Flora and Jade. Flora and Phillip will be married, Jade and Aladdin also plan to hold a wedding ceremony next month, the two couples are busy preparing for their weddings. So,today Flora and Jade come to the studio to buy their wedding dresses together. Hey, youre Rebeccas assistant! Start your work now! Help Rebecca design the most beautiful wedding dresses for the two brides.",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/nv4rbgizc1ivyc8d1pycsdwolvs5qvss/",
        "category": "Girls",
        "tags": "Decorate, Design, Dress Up, Fashion, Girl, Girls, Kids, Love, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/nv4rbgizc1ivyc8d1pycsdwolvs5qvss/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47744",
        "title": "Princess Soft Grunge Looks",
        "description": "Welcome to the Princess Soft Grunge Looks. Bffs Ariel, Moana, Snow White, and Jasmine are more fashioned princesses planning to try some unique fashion ideas. Princess Moana comes up with an idea to try Soft Grunge fashion. They all get excited and look forward to trying it out. Join and help the girls to pick a suitable costume. Have fun!",
        "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
        "url": "https://html5.gamemonetize.com/l19w0jqsir783rni0nfnir4qfli0xapw/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Princess",
        "thumb": "https://img.gamemonetize.com/l19w0jqsir783rni0nfnir4qfli0xapw/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47963",
        "title": "Bride Wedding Hair Design",
        "description": "Sofia and Jacks wedding will be held today, but Sofia havent have a perfect wedding hairstyle yet. Now you are an excellent hairdresser, can you design a beautiful one for her?",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/rdujltkkz2bx24e3x8n2tuxzstof4w2k/",
        "category": "Girls",
        "tags": "Decorate, Dress Up, Fashion, Girl, Girls, Hair, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/rdujltkkz2bx24e3x8n2tuxzstof4w2k/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47748",
        "title": "Celebrity Future Fashion",
        "description": "Welcome to the Celebrity Future Fashion. Taylor Swift, Kendell Jenner, Rihanna, Ariana Grande, and Selena Gomez are the celebrity plans to try something new fashion. They got an idea to try future fashion. Yes! it&rsquo;s an upcoming fashion will trend over the fashion industry. But they need some expert advice to pick the right one for them. Play and help the girl!",
        "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
        "url": "https://html5.gamemonetize.com/63a5cmy3597qauct9ifwpfbdrxixoykv/",
        "category": "Girls",
        "tags": "Celebrity, Dress Up, Fashion",
        "thumb": "https://img.gamemonetize.com/63a5cmy3597qauct9ifwpfbdrxixoykv/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47983",
        "title": "Little Skin Doctor",
        "description": "Little Skin Doctor is going to tell you how to keep your skin beautiful and deal with all kinds of skin problems! Clean face plays a very important role in beauty. But sometimes we got pimples, wound, freckles and other skin problems. Treat the patients who have skin problems, and do examination for them.",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/aaha649tpym0z28ubm3j83jrr43hzhtl/",
        "category": "Girls",
        "tags": "Boy, Boys, Doctor, Educational, Fashion, Girl, Girls, Kids, Makeover, Simulation, Surgery",
        "thumb": "https://img.gamemonetize.com/aaha649tpym0z28ubm3j83jrr43hzhtl/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47799",
        "title": "Cute Chibiusa Maker",
        "description": "Everyone loves anime. This is an incredible art style. Feel like a real anime artist, create a unique Chibi model. You can choose facial features, eye color, hair and clothes. Create incredible combinations of hairstyles and accessories. You will find many interesting costumes, dresses, blouses, hats, wings, horns, ears, tails, stockings and shoes! You can create an ordinary girl, an angel, a fairy or a demon. You are only limited by your imagination! Rather play this incredible game on the site dressupwho.com.",
        "instructions": "Use mouse left click to browse around the game Use mouse left click to change characters skin color hairstyle and color outfit and color accessories and color and more ",
        "url": "https://html5.gamemonetize.com/av0klynll7ttihnqp9p51sd8aro6ynpb/",
        "category": "Girls",
        "tags": "1 Player, Anime, Cartoon, Creation, Decorate, Dress Up, Fantasy, Fashion, Girls, HTML5, Kids, Makeover, RPG",
        "thumb": "https://img.gamemonetize.com/av0klynll7ttihnqp9p51sd8aro6ynpb/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47782",
        "title": "Hollywood Fashion Pets",
        "description": "Look! Look! There are five poor stray pets here. Theyre so hungry and thirsty, and their fur is all dirty. Come on, lets help them together! Well give them a bath and then let them enjoy delicious food. Finally, well groom them nicely and turn them into shining stars like Hollywood celebrities!",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/nmzwz2x6e3574tv146uuidnq5xbhcyxh/",
        "category": "Girls",
        "tags": "Animal, Cute, Dress Up, Educational, Fashion, Girl, Girls, Grooming, Kid, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/nmzwz2x6e3574tv146uuidnq5xbhcyxh/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "47514",
        "title": "Ibiza Pool Party",
        "description": "In this online makeover game, Elsa and Ariel have prepared some girly-girl summer activities that you will love. Are you ladies ready to embark on a fun trip to Ibiza? Then simply get started with the Ibiza Pool Party, and have a blast with your favorite Disney princesses while you help them prep their looks for the most-awaited pool party of the year.",
        "instructions": "For desktops use your mouse For mobile devices tap to play ",
        "url": "https://html5.gamemonetize.com/g1cu82kaz5vx4pd0ydr475vuf23ie0ru/",
        "category": "Girls",
        "tags": "1 Player, Dress Up, Fashion, Girl, Girls, HTML5, Makeover, Mobile, Online, Pool, Princess, Summer",
        "thumb": "https://img.gamemonetize.com/g1cu82kaz5vx4pd0ydr475vuf23ie0ru/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "47871",
        "title": "Anime Avatar Maker",
        "description": "Would you like to have your own anime avatar? Do you want to have a anime image that can be switched at will? Come to Anime Avatar Maker to experience the joy of self-made avatars! Detailed face pinching parts and lots of decorations allow you to experience the joy of pinching face freely! Come and join Anime Avatar Maker and create the best-looking anime image in your heart!",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/uih8rboqeej07fp77fkzbynjn68h4cn2/",
        "category": "Girls",
        "tags": "Cartoon, Creation, Cute, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/uih8rboqeej07fp77fkzbynjn68h4cn2/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47415",
        "title": "Princess Look Like A Supermodel",
        "description": "Welcome to the Princess Look Like A Supermodel. Princess Anna, Elsa, Moana, and Snow White are the BFFs who admired more on modeling. They planned to be a supermodel in upcoming fashion events. Browse their wardrobe and help the princesses to be a supermodel.",
        "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
        "url": "https://html5.gamemonetize.com/1n0eia7ato0c8cwvsd7471b5ab66or52/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girls, Princess",
        "thumb": "https://img.gamemonetize.com/1n0eia7ato0c8cwvsd7471b5ab66or52/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47798",
        "title": "Monster Girls Summer Vacation",
        "description": "The girls from Monster High school are having fun during their summer vacation. They walk through boutiques in search of clothes and accessories for the upcoming vacation. Help the girls to put on makeup and pick the right hairstyles that match with their summer theme makeup! In the boutiques, you will be the fashion stylist to help each one of the girls to choose stylish summer dresses, skirts, shorts and tops for the beach parties. Do not forget to complement the summer look with accessories - handbags, hats, glasses. Enjoy the summer with the Monster School girls by playing the Monster Girls on Summer Vacation at",
        "instructions": "How to play this game Use mouse left click to browse around the game ",
        "url": "https://html5.gamemonetize.com/ql88cg8gg2soh1y562tpj20igc08tfeh/",
        "category": "Girls",
        "tags": "1 Player, Animal, Anime, Casual, Fantasy, Fashion, Games, Girls, Hair, HTML5, Kids, Makeover",
        "thumb": "https://img.gamemonetize.com/ql88cg8gg2soh1y562tpj20igc08tfeh/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47733",
        "title": "Surprise Doll Dress Up",
        "description": "Attention to all blind box enthusiasts! Have you ever considered indulging in a thrilling Doll Collecting Game? Immerse yourself in the excitement as you unveil surprise blind boxes, acquire your very own virtual dolls, and engage in delightful playtime with them! Get ready to immerse yourself in sheer amusement! lol",
        "instructions": "Use the mouse or finger to tap to open the blind box and dress up beautiful characters ",
        "url": "https://html5.gamemonetize.com/knav2n3g7i6rz021fm343twzw7yd8n8m/",
        "category": "Girls",
        "tags": "Cute, Dress Up, Fashion, Fun, Girls, Hair, HTML5, Jewel, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/knav2n3g7i6rz021fm343twzw7yd8n8m/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47650",
        "title": "Candy House Cleaning",
        "description": "Have you ever wondered what it would be like to clean a house made entirely out of candy? Well, we present you with the opportunity to do so. First, start by picking out the trash that is lying on the floor. Pick up the toys spread all over the place and put them back in their designated spot. Next, use the cleaning solution to scrub the walls, and don&rsquo;t forget to vacuum.",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/mah59bzx6opw3of7xd2sklc0npxtkj1a/",
        "category": "Girls",
        "tags": "Girl, Girls",
        "thumb": "https://img.gamemonetize.com/mah59bzx6opw3of7xd2sklc0npxtkj1a/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47760",
        "title": "Animals Clicker",
        "description": "Animals Clicker is a clicker with lots of cards with cute animals and pets. Click on the cards to unlock new animals and unlock new levels. Get more coins and upgrade clicks, cashback timer and cashback limit and get bonus rewards. There are 30 different animals waiting for you in the game. The game has nice music with amazing graphics will not let you get bored.",
        "instructions": "Use Mouse for desktop and Touch Controls for mobile device",
        "url": "https://html5.gamemonetize.com/0pndbc5uyqpcwoqw8lg60voqylucd4bu/",
        "category": "Girls",
        "tags": "Animal, Card, Cartoon Network, Casual, Clicker, Cute, Game, HTML5, Kids",
        "thumb": "https://img.gamemonetize.com/0pndbc5uyqpcwoqw8lg60voqylucd4bu/512x384.jpg",
        "width": "1200",
        "height": "1600"
    },
    {
        "id": "47731",
        "title": "Funny Virtual Pet",
        "description": "Have you ever thought about taking care of a marmot in your daily life? Meet the grumpiest and funniest marmot you could ever meet! Have fun pranking Mister Grumpy, play funny games to annoy and disturb him, but dont forget to take care of your marmot every day! Take care of Mister Grumpy daily, feed him, bathe and put him to sleep! But of course, wake him up in the funniest and most annoying way possible, hell hate it and tell you to go away! Also have fun remodeling your house and customizing his appearance, putting on hats, ties and many other accessories.",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/icih1bytjtfoq1m7z87y2criw8ovqhby/",
        "category": "Girls",
        "tags": "Animal, Boy, Boys, cut, Decorate, Design, Dress Up, Educational, Fashion, Girl, Girls, Grooming, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/icih1bytjtfoq1m7z87y2criw8ovqhby/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47553",
        "title": "My Best FF Outfits",
        "description": "Welcome to the My Best FF Outfits. Princesses Anna, Elsa, Snowwhite, and Ariel are more font FF game. They always love to wear the FF costumes and accessories. So they planned to try FF outfits. Join and help the girls to pick a suitable outfit for each one of them. Try to choose unique costumes and hairstyles. Play and have fun!",
        "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
        "url": "https://html5.gamemonetize.com/1wentwjmbjdw7tou5ydsxvip1ug3avhw/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girls, Princess",
        "thumb": "https://img.gamemonetize.com/1wentwjmbjdw7tou5ydsxvip1ug3avhw/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46934",
        "title": "Coloring Animales",
        "description": "Coloring Animales is fun and free coloring game suitable for all ages. Take some time and make an art by yourself .there is many deffrent characters you can color in our game which make it more fun.Have fun coloring.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/by7swr88z0dg955oemfl1i1737j13o45/",
        "category": "Girls",
        "tags": "Coloring, Fun, Kids, Mobile, Puzzle",
        "thumb": "https://img.gamemonetize.com/by7swr88z0dg955oemfl1i1737j13o45/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47662",
        "title": "Barbiecore",
        "description": "How about a new fashion trend? Hot pink and bubblegum are on the rise, but in this cute doll dress-up game, its all about sweet girl Ellie! Pink is her favorite color and Barbiecore is her favorite aesthetics, you know what you have to do next. Create cute casual and sporty chic looks while playing this free-to-play dress-up game for girls called Barbiecore!",
        "instructions": "Use your mouse to click the tabs and select the clothing pieces and accessories you fancy the most",
        "url": "https://html5.gamemonetize.com/2gx8iupbt9ed1lnf3bhziy957j6jqi63/",
        "category": "Girls",
        "tags": "1 Player, Barbie, Dress Up, Fashion, Game, Games, Girls, Makeover, Summer",
        "thumb": "https://img.gamemonetize.com/2gx8iupbt9ed1lnf3bhziy957j6jqi63/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "47732",
        "title": "Fashion New Car",
        "description": "Barbara wants to replace her old car, can you help her? First, help Barbara drive her car and collect coins in the street. Look out! You need to avoid obstacles on the way! When we get enough coins, we can go to the automobile 4S store to buy a new car, dont forget to decorate the car to make it look more beautiful!",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/14neegmb2ikohovlo56wqwa80ie9bb3p/",
        "category": "Girls",
        "tags": "Barbie, Decorate, Dress Up, Driving, Fashion, Girl, Girls, Kid, Kids, Race, Simulation",
        "thumb": "https://img.gamemonetize.com/14neegmb2ikohovlo56wqwa80ie9bb3p/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47561",
        "title": "Royal Couple Wedding Preparation",
        "description": "There are three couples, Zoe and Kris, Rebecca and Flynn, Adella and Eric, they are all getting married and doing the preparations for the wedding. Which couple are your favourite? Join the couple and help them start the preparations now! Help your favourite couple to create the most wonderful wedding!",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/kddn71t3nw5kmk4fp6laa3ovubupqf3w/",
        "category": "Girls",
        "tags": "Decorate, Design, Dress Up, Fashion, Girl, Girls, Kid, Kids, Love, Shopping, Simulation",
        "thumb": "https://img.gamemonetize.com/kddn71t3nw5kmk4fp6laa3ovubupqf3w/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47651",
        "title": "Fashion Dye Hair Design",
        "description": "Fashionista Rebecca wants to try a new style. Now you are a fashion designer, can you help her dye hair to get a new hairstyle first? Use your fashion skills to design beautiful color combinations, maybe a nice combination of pink and purple is a good idea. Then pick fashion outfits for her and match the right accessories to make the look stand out. Rebecca will have a striking new look!",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/w9hi36liwrwxpxrn757es7jjrxe5c0py/",
        "category": "Girls",
        "tags": "Cute, Decorate, Design, Dress Up, Fashion, Girl, Girls, Hair, Kid, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/w9hi36liwrwxpxrn757es7jjrxe5c0py/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47552",
        "title": "Rainbow Girls Space Core Aesthetic",
        "description": "Welcome to the Rainbow Girls Space Core Aesthetic. Who loves space adventure? Everyone right! Rainbow Girls Skyler, Sunny, Ruby, and Violet are adventurer high school girls planning to try space aesthetic outfits. Browse their wardrobe and pick a cute and suitable outfit for them. Join with the girls and have fun!",
        "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
        "url": "https://html5.gamemonetize.com/bfcxvby3c19jj6lodk7m9vi2r2yaovcu/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girls",
        "thumb": "https://img.gamemonetize.com/bfcxvby3c19jj6lodk7m9vi2r2yaovcu/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47587",
        "title": "Pregnant Mommy Caring",
        "description": "Pregnant Mommy Caring is a very fun and popular caring game. This time, we will face the challenge of taking care of Moms pregnancy days and her adorable newborn baby. We will be by this amazing moms side throughout the entire pregnancy. Experience basic check-ups, treat unexpected injuries, and witness the miracle of a babys birth. In this incredible motherhood simulator game, you will experience the greatness of motherhood and the true meaning of the continuation of life.",
        "instructions": "Follow the and voice-over and use the mouse or finger to tap",
        "url": "https://html5.gamemonetize.com/c6w7h4odio0j0lv6r9rhwz7k2pokqfi2/",
        "category": "Girls",
        "tags": "Baby, Doctor, Educational, Fun, Girl, HTML5, Kids, Mobile, Surgery",
        "thumb": "https://img.gamemonetize.com/c6w7h4odio0j0lv6r9rhwz7k2pokqfi2/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47559",
        "title": "Girls Nail Art Salon",
        "description": "Girls, are you ready to play the best nail salon game in the world? Its time to become a super nail designer in the universe and design your own nails through Girls Nail Art Salon! If you have ever tried to design your own nails, you know how difficult it is to get them right. But thanks to this amazing nail salon game, you will be able to do it in an easy way and create beautiful nail designs.",
        "instructions": "On the desktop use the mouse to tap to attach accessories to the nails On mobile use the finger to tap to attach accessories to the nails ",
        "url": "https://html5.gamemonetize.com/pf67zhthzd2lbla4mfj7vb0tjzsglaxb/",
        "category": "Girls",
        "tags": "Fashion, Fun, Girls, HTML5, Jewel, Kids, Makeover, Mobile, Nails",
        "thumb": "https://img.gamemonetize.com/pf67zhthzd2lbla4mfj7vb0tjzsglaxb/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47524",
        "title": "Talent Girl Art Classes",
        "description": "Today is the 1st day of Zoe to Art College. There are two different classes for her to choose, Fashion Design Class and Art Class, can you help Zoe choose her lesson and prepare for her lesson? &bull; appropriate for girls and boys &bull; easy gameplay and user friendly interface &bull; beautiful HD graphics &bull; free your creativity and imagination &bull; improve your skills",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/ts52tao2xhw02q3a8050mf8h4xkxj6p3/",
        "category": "Girls",
        "tags": "Coloring, Decorate, Design, Dress Up, Educational, Fashion, Girl, Girls, Kid, Kids, Makeover",
        "thumb": "https://img.gamemonetize.com/ts52tao2xhw02q3a8050mf8h4xkxj6p3/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "46836",
        "title": "Little Girls School vs PrincessStyle",
        "description": "Come and join this wonderful dressup game at 7sgames.com. These little girls, Sophia and Clara to get dressed in princess style and school style. Of course the both good at these outfits. Lets check who is best in these outfits.",
        "instructions": "Use mouse to control by clicking each button or icon in the game",
        "url": "https://html5.gamemonetize.com/3nn4slcv5ceftlgap6ty11857g2uzjnl/",
        "category": "Girls",
        "tags": "Collection, Dress Up, Makeover",
        "thumb": "https://img.gamemonetize.com/3nn4slcv5ceftlgap6ty11857g2uzjnl/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47419",
        "title": "Princesses As Ancient Warriors",
        "description": "Welcome to the Princesses As Ancient Warriors. Princesses Anna, Elsa, Ariel, and Moana are best friends, they love to be ancient warriors in feature. But these girls don&rsquo;t want to wait as long. They planned to try cool warrior costumes and be like them now. Help the girls to browse their wardrobes. Join and have fun!",
        "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
        "url": "https://html5.gamemonetize.com/qlz9dzhinx6l4rdrc57alojy3yaqhw7y/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girls, Princess",
        "thumb": "https://img.gamemonetize.com/qlz9dzhinx6l4rdrc57alojy3yaqhw7y/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "43257",
        "title": "Mia Beach Spa",
        "description": "Lets help this gorgeous girl Mia to have the wonderful spa day at beach, that must be release her stress from her routine princess job and relax her mind and body to get refresh. She needs complete back spa and facial treatments, Come and join this makeover game at 7sgames.com",
        "instructions": "Use mouse to control",
        "url": "https://html5.gamemonetize.com/pm23px3m0xuk16zjsn880xr0tyd0dhfz/",
        "category": "Girls",
        "tags": "Dress Up, Funny, H5, Makeover",
        "thumb": "https://img.gamemonetize.com/pm23px3m0xuk16zjsn880xr0tyd0dhfz/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46728",
        "title": "Ava Throat Infection",
        "description": "Lets enjoy the doctor game at 7sgames.com. Ava is the beautiful young and charm girl. But she has some infection on her throat and she is suffering a lot. She need your help to heal this. Would be the doctor for Ava?",
        "instructions": "Use mouse to control by clicking each button or icon in the game",
        "url": "https://html5.gamemonetize.com/r56u16pwv77yrkelvps4joe6vb1rb7go/",
        "category": "Girls",
        "tags": "Doctor, Fantasy, Surgery",
        "thumb": "https://img.gamemonetize.com/r56u16pwv77yrkelvps4joe6vb1rb7go/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47024",
        "title": "Babie Panoz Fighter",
        "description": "Fight with Babie Panoz in the city underground against her terrible enemy Lizy for her survival ! Combatti con Babie Panoz nei sobborghi della citt&agrave; contro la sua temibile avversaria Lizy per la sua sopravvivenza !",
        "instructions": "Tap or Button Kick or key A Panoz Kick Button Pause or key D Pause Button Back or key S Back Button Forward or key W Forward",
        "url": "https://html5.gamemonetize.com/kxx30cbb2qghgve0mnxnt04huxcud927/",
        "category": "Girls",
        "tags": "Fighting, Game, HTML5",
        "thumb": "https://img.gamemonetize.com/kxx30cbb2qghgve0mnxnt04huxcud927/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47499",
        "title": "Makeup Kit DIY Dress Up",
        "description": "Super fun homemade cosmetics DIY game with TONS of FANCY COSMETICS! Keep updated with new cosmetic-making games! Make various cosmetics: lipsticks, cream eyeshadow, mascara, and so much more! Tons of realistic cosmetic DIY tools to play with: bowls, spatulas, spoons, microwave oven, plates, digital scale, measuring cups, induction cooker, and so much more! Tons of cosmetic materials and decorations to try: cosmetic mica powder, cosmetic glitters, liquid pigment, coconut oil, castor oil, sweet almond oil, avocado oil, wax, and so much more! Apply your cosmetics on supermodel &amp; take a photo!",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/rlogdiyfy1gnm3xny38smdvid34x2eb8/",
        "category": "Girls",
        "tags": "Cooking, Decorate, Design, Dress Up, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/rlogdiyfy1gnm3xny38smdvid34x2eb8/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "46405",
        "title": "Hospital Hustle",
        "description": "Hospital Hustle game is a super fun management game . Take care of all your patients by accepting them , cure them in different machines . By the way you have to carry resources for machines in order to machines work. Also you can hire doctors , workers , receptionist and also upgrade your staff skills and capacities . You have happiness bar at the top and you have to keep it at maximum .",
        "instructions": "Player 1 WASD or Arrow Keys For movement Player 2 Arrow Keys For Movement",
        "url": "https://html5.gamemonetize.com/9wwq3zj6f6e4s6r4vnki5ffk6akkz3gb/",
        "category": "Girls",
        "tags": "2 Player, 2 Player Games, Business, Cartoon, Doctor, Management",
        "thumb": "https://img.gamemonetize.com/9wwq3zj6f6e4s6r4vnki5ffk6akkz3gb/512x384.jpg",
        "width": "922",
        "height": "487"
    },
    {
        "id": "47543",
        "title": "Pregnant Mommy Care Games",
        "description": "This time we should face the challenge to take care of the mommys pregnancy days and her cutest newborn baby. We will spend the entire pregnancy cycle with this great mom. To experience the basic examinations, heal her accidentally injured, and witness her babys production process. In this amazing mommy care simulator game, you will experience the greatness of a mother and the true meaning of life continuation.",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/dm1izt054xx9y0r3s8d1y6gyovbae82u/",
        "category": "Girls",
        "tags": "Baby, Cute, Doctor, Dress Up, Educational, Fashion, Girl, Girls, Kid, Kids, Makeover, Simulation, Surgery",
        "thumb": "https://img.gamemonetize.com/dm1izt054xx9y0r3s8d1y6gyovbae82u/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "46878",
        "title": "Coloring books",
        "description": "Coloring books is a free online coloring and kids game! In this game you will find different books pictures which have to be colored as you want. You have the enough amount of colors to choose for your perfect art. You can also save the colored image. Have fun!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/rvyjptyd1lhrfwbw2x3hveyb8kxont2s/",
        "category": "Girls",
        "tags": "Android, Color, Coloring, Fun, Girls, HTML5, iPhone, Kids, Mobile",
        "thumb": "https://img.gamemonetize.com/rvyjptyd1lhrfwbw2x3hveyb8kxont2s/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "47224",
        "title": "My Sweet Candy Outfits",
        "description": "Welcome to the My Sweet Candy Outfits. Rainbow high girls Skyler, Sunny, Ruby, and Violet are planning a weekend party. But a party without a theme is not fun! So they planned to be in Sweet candy themes. Help the girls to browse the wardrobe and pick the cute candy outfit for them. Play and have fun!",
        "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
        "url": "https://html5.gamemonetize.com/57h9fa0af8sl60ju6pnh3utyyst4oebr/",
        "category": "Girls",
        "tags": "Cute, Dress Up, Fashion, Girls",
        "thumb": "https://img.gamemonetize.com/57h9fa0af8sl60ju6pnh3utyyst4oebr/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47443",
        "title": "Baby Taylor Pizza Delivery",
        "description": "Pizzas are so tasty and yummy to eat but what is better than eating a pizza? Taylor likes pizza best! She is about to open a pizza shop at home and offer delivery services. Today is the first day of business for the pizzeria, lets see who ordered the delicious pizza!",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/4wwjfl7fqx3yuw9tjlnvj9hwvlw4159l/",
        "category": "Girls",
        "tags": "Baby, Cooking, Decorate, Girl, Girls, Kid, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/4wwjfl7fqx3yuw9tjlnvj9hwvlw4159l/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "47402",
        "title": "Pool Float Party",
        "description": "Blondie and Marie decide to have a pool party. Whats a party without cocktails? Lets make a refreshing soda, lemon, lime and mint leaf mojito together. In the meantime, Blondie is engaged in cocktails, Marie cleans up the area next to the pool. Help the girls create a unique party design. Now that everything is ready, girls can take care of themselves. Make up for each of the girls and choose the right outfit. Dont forget to complete the look with stylish accessories and choose an inflatable float of an original shape for girls.",
        "instructions": "Depending on the gaming device a computer mouse or touch on touch screens is used for control ",
        "url": "https://html5.gamemonetize.com/wbw7p5as97hbinfau6n0e2g9ojti8ooi/",
        "category": "Girls",
        "tags": "Celebrity, Cute, Decorate, Decoration, Design, Dress Up, Fashion, Girl, Hair, HTML5, Makeover, Red, Summer",
        "thumb": "https://img.gamemonetize.com/wbw7p5as97hbinfau6n0e2g9ojti8ooi/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47358",
        "title": "Glamour BeachLife",
        "description": "Get ready to embrace the hottest summer trends as chic swimwear becomes the ultimate fashion statement. Whether you prefer a girly-girl casual style or want to shine at glamorous beach parties, weve got you covered. Join us in transforming cute swimsuits into breathtaking summer ensembles. Olivia, our expert fashionista, is here to share her valuable tips and tricks. Start playing the glamorous #BeachLife dress-up game for girls now, and discover how you can rock adorable swimsuits from sunrise to sunset!",
        "instructions": "Use your mouse to play this game For mobile devices tap the screen ",
        "url": "https://html5.gamemonetize.com/nwkkvcs8kx0xopplv301r5b51p95371i/",
        "category": "Girls",
        "tags": "1 Player, Casual, Dress Up, Fashion, Games, Girls, Holiday, HTML5, Makeover, Online, Summer",
        "thumb": "https://img.gamemonetize.com/nwkkvcs8kx0xopplv301r5b51p95371i/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "47404",
        "title": "Yummy Dessert Shop",
        "description": "Sofia runs a dessert shop that sells juices, ice cream, and other desserts. Today, she is so busy that she cant treat all customers, could you give her a hand? Your job this day is to satisfy your customers orders and earn money. Make the right juice and ice cream for the customer as fast as you can. Have a try!",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/ddxg90brzkbrv6m2z844fiioymjpcq9a/",
        "category": "Girls",
        "tags": "Cook, Cooking, Decorate, Design, Fashion, Girl, Girls, Kid, Kids, Simulation, Summer",
        "thumb": "https://img.gamemonetize.com/ddxg90brzkbrv6m2z844fiioymjpcq9a/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47399",
        "title": "Top Burger",
        "description": "Top Burger is a really fun game where you gonna play as a burger seller simulator and you try to get much as possible of money to unluck new cool stuff and also get more clients by upgrading your skills.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/t60f3ktp2l5lj0lnbc9t5ejar9k7gcda/",
        "category": "Girls",
        "tags": "Cooking, Educational, Fun, Girls, Kids",
        "thumb": "https://img.gamemonetize.com/t60f3ktp2l5lj0lnbc9t5ejar9k7gcda/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "46115",
        "title": "Sakora Anime Dress Up",
        "description": "Sakora Anime Dress Up is a 3D girls. Enjoy a virtual experience that allows you to unleash your creativity by designing and customizing virtual 3d girl outfits and hair styles. The game also offers amazing dances and moves for your 3D girl. Have fun!",
        "instructions": "Tap or Click to play",
        "url": "https://html5.gamemonetize.com/l2cazn7f4np4ldwy791iimhuvl085caj/",
        "category": "Girls",
        "tags": "3D, 3D Games, Anime, Dress Up, Fashion, Girl, Girls, Makeover",
        "thumb": "https://img.gamemonetize.com/l2cazn7f4np4ldwy791iimhuvl085caj/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "44721",
        "title": "Fairy of Lake Dressup",
        "description": "Lake fairy Vanessa is an amazing fairy. Her heart is full of goodness and beauty. She preserved the naturalness of the lake throughout her life. Let's dress Vanessa, who is in charge of protecting people and nature, very stylishly. Fun game.",
        "instructions": "Tap the screen to play",
        "url": "https://html5.gamemonetize.com/zqobdkyjrifgzjsg6kz8n851x0oukaqr/",
        "category": "Girls",
        "tags": "Decorate, Dress Up, Fairy, Fashion, Fun, Game, Girl, Girls, HTML5, Magic",
        "thumb": "https://img.gamemonetize.com/zqobdkyjrifgzjsg6kz8n851x0oukaqr/512x384.jpg",
        "width": "840",
        "height": "500"
    },
    {
        "id": "47345",
        "title": "My Nail Makeover",
        "description": "Pampering yourself is in the agenda! Getting your nails done is a hobby of yours? Well, take it to the next level with our new game My Nail Makeover and become a great nail artist! Nail Art isn&rsquo;t called an &ldquo;art&rdquo; for nothing! With My Nail Makeover you will be able to become a great nail designer, carrying out every step of a perfect manicure in your own beauty salon!",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/y2mzlfendljeesdf4jddke8o8q1t6sa2/",
        "category": "Girls",
        "tags": "Cleaning, Decorate, Design, Fashion, Girl, Girls, Kid, Kids, Makeover, Nail, Nails, Simulation",
        "thumb": "https://img.gamemonetize.com/y2mzlfendljeesdf4jddke8o8q1t6sa2/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47225",
        "title": "Rainbow Girls Neon Fashion",
        "description": "Welcome to the Rainbow Girls Neon Fashion. Girls! Neon is always special and fun to wear! These Rainbow high girls are more fashionable in the latest trends. They planned to try this neon fashion. Join and help the girls with your creative ideas. Browse each wardrobe and try unique costumes for each girl! Have fun!",
        "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
        "url": "https://html5.gamemonetize.com/5jm7xnweevwsuwsebgcj62zt10otzv2h/",
        "category": "Girls",
        "tags": "Cute, Dress Up, Fashion, Girls",
        "thumb": "https://img.gamemonetize.com/5jm7xnweevwsuwsebgcj62zt10otzv2h/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46293",
        "title": "BFF Skating Practice",
        "description": "Lets make these beautiful girls Ava and Clara to get ready for roller skating game with the playground cleaning and select the cute dresses with suitable accesseries. Come and join this dressup games at 7sgames.com",
        "instructions": "Use mouse to control by clicking each button or icon in the game",
        "url": "https://html5.gamemonetize.com/vkbx72cd2mlem7n17ldoxf2xe0lswq1h/",
        "category": "Girls",
        "tags": "Cleaning, Dress Up, Football",
        "thumb": "https://img.gamemonetize.com/vkbx72cd2mlem7n17ldoxf2xe0lswq1h/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47369",
        "title": "School Graduation Beach Party",
        "description": "Our friends Adellal, Rebeccal, Sofia and Zoe, the four of them are going to graduate from college. They miss their college life very much. So they want to hold a beach party to record this moment. You can help them put on their beautiful clothes and finally take a perfect photo at the seaside.",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/h9b1x8b043do7b6pj5m8jw9s10t9parj/",
        "category": "Girls",
        "tags": "Decorate, Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation",
        "thumb": "https://img.gamemonetize.com/h9b1x8b043do7b6pj5m8jw9s10t9parj/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "44691",
        "title": "My Cute Dog Daisy",
        "description": "Daisy is my favorite friend. Bought new clothes for my cute dog Daisy. Daisy loves pink and red. Let's dress her so fancy",
        "instructions": "Tap the screen to play",
        "url": "https://html5.gamemonetize.com/bv4efioz2e4maaqz5ap1t8srv0dysigp/",
        "category": "Girls",
        "tags": "Animal, Cartoon, Decorate, Dress Up, Fashion, Fun, Game, Games, Girl, Girls, HTML5",
        "thumb": "https://img.gamemonetize.com/bv4efioz2e4maaqz5ap1t8srv0dysigp/512x384.jpg",
        "width": "480",
        "height": "840"
    },
    {
        "id": "47245",
        "title": "Fashion Girls Beach Swimsuit",
        "description": "Zoe, Bella and Adella decide to take a holiday on the beach this weekend, but at first they need to choose some fashion swimsuits to attract others. You should come here and enjoy this vacation with them, come on!",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/rch2ah0cz79ln6qtg1cfen9fa0mcj3xc/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girl, Girls, Kids, Makeover, Simulation, Summer",
        "thumb": "https://img.gamemonetize.com/rch2ah0cz79ln6qtg1cfen9fa0mcj3xc/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47349",
        "title": "Baby Panda Food Party",
        "description": "Baby Panda is a food-loving bear who has a wide variety of delicious treats in his kitchen. However, today, our playful Panda is out exploring and his delightful munchies have come up with a brilliant idea. They have decided to throw a fabulous dress-up party for themselves while Baby Panda is away. But before they can commence their merrymaking, the foodie gang needs your assistance to get all dolled up in fancy attires. Will you lend a helping hand in dressing up the delightful edible ensemble? And to express their gratitude, the foodies will extend a warm invitation for you to join their exciting dress-up bash!",
        "instructions": "Use the mouse or finger to drag or click the screen to cook and decorate food ",
        "url": "https://html5.gamemonetize.com/bwninp2a3pbcmj17art368nm0182tn2s/",
        "category": "Girls",
        "tags": "Animal, Baby, Cook, Cooking, Cute, Educational, Food, Fruits, Fun, Girls, HTML5, Kids, Mobile, Panda",
        "thumb": "https://img.gamemonetize.com/bwninp2a3pbcmj17art368nm0182tn2s/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "47279",
        "title": "Little Princesss Fashion",
        "description": "Welcome to the princesss castle! Congrats! You are the princesss personal stylist now! Your job is to design dazzling looks for the princess, including dresses, makeup, accessories, etc. Well, lets start the work today! How are you going to dress up the princess? How about starting with a facial, then designing red-colored makeup and a wavy hairstyle, and finishing with shiny nails? There are various makeup items like hair dye and lipsticks that you can use in the castle. Lets create a New Years look for the princess!",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/u3v588gcl79z9zp6ayhpqbwgsfjtm742/",
        "category": "Girls",
        "tags": "Decorate, Design, Dress Up, Fashion, Girl, Girls, Hair, Kids, Makeover, Mermaid, Nail, Nails, Princess, Simulation",
        "thumb": "https://img.gamemonetize.com/u3v588gcl79z9zp6ayhpqbwgsfjtm742/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "46551",
        "title": "Sugar Chocolate Candy Maker",
        "description": "Sweet Rainbow Candy Cooking and Chocolate Bars Cooking Games is a fun game for Kids and Families who love cooking up Rainbow Candy and Chocolate Bars! Choose from Gummy Candy or Chocolate Candy Bars filled with an assortment of Candy or Toppings! Fill your Bag up with all your favorite gummy treats, select a colorful bag, decorate with stickers, then open up the bag and enjoy a feast of candy!",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/ilunp194pzbtmhwdfv3twpw7u75buke6/",
        "category": "Girls",
        "tags": "Cook, Cooking, Decorate, Fashion, Girl, Girls, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/ilunp194pzbtmhwdfv3twpw7u75buke6/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47217",
        "title": "Makeover Asmr",
        "description": "Indulge in a doubly soothing experience with a mesmerizing combination of gaming and ASMR in Makeover ASMR. Unwind as you immerse yourself in the realm of skincare, aiding both girls and boys in tackling acne, uneven skin tone, and dullness. Listen to the satisfying sound of acne being gently squeezed while helping them achieve a flawless complexion. Dive into the world of fashion makeup, using an array of diverse cosmetics to create stunning looks.",
        "instructions": "As a makeup game it offers a variety of cosmetic tools to choose from allowing you to complete all the makeup steps with just one finger or mouse ",
        "url": "https://html5.gamemonetize.com/se45f3kvmucn2cjzr8h77u9rm6tlgimt/",
        "category": "Girls",
        "tags": "Fashion, Fun, Girls, Hair, HTML, Kids, Makeover, Mobile, Relaxation, Surgery",
        "thumb": "https://img.gamemonetize.com/se45f3kvmucn2cjzr8h77u9rm6tlgimt/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47223",
        "title": "Bffs Rainbow Fashion Addict",
        "description": "Welcome to the Bffs Rainbow Fashion Addict. Bffs Skyler, Sunny, Ruby, and Violet are more interested to try rainbow fashion outfits. They are more attractive, elegant, and beautiful to wear. These girls already fulfilled their wardrobes with the latest collection, but they have been confused to choose the better one. Join as a design expert and help the girls to give their stunning look. Have fun!",
        "instructions": "You can click or tap on different clothing items accessories hairstyles and other elements to select them ",
        "url": "https://html5.gamemonetize.com/vrwmde919te8r6aq3s6su1osvgu1n2tg/",
        "category": "Girls",
        "tags": "Dress Up, Fashion, Girls",
        "thumb": "https://img.gamemonetize.com/vrwmde919te8r6aq3s6su1osvgu1n2tg/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "44345",
        "title": "Kids Happy Kitchen Game",
        "description": "Kids Happy Kitchen is a very addictive cooking game. In this game, you are an owner of a tiny but popular restaurant. 3 customers are here to taste your cooking. They want to try your specialty, curry rice, fired potato shreds and fried dumplings. As a sophisticated chef, come and show your skills. Have a good time!",
        "instructions": "Tap or click",
        "url": "https://html5.gamemonetize.com/w4fz652t1x5kge5l4xztnw4hq7sbnu1x/",
        "category": "Girls",
        "tags": "Cook, Cooking, Fun, Girl, Girls, Kids",
        "thumb": "https://img.gamemonetize.com/w4fz652t1x5kge5l4xztnw4hq7sbnu1x/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "47176",
        "title": "Baby Taylor Fantasy Carnival",
        "description": "What kind of style would work out for a carnival? Spark your inspiration for giving Taylor and her friends a different look that turns heads. For foodies, this is a paradise serving with mouth-watering food like panini, hot chocolate, skewer, and ice cream. And tons of amazingly fun activities, such as toy claw machine, whack-a-mole and jelly connect, are prepared to perk up your day!",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/po7fqkgpedgq5mn2frkjzg1zxesmbdsn/",
        "category": "Girls",
        "tags": "Baby, Cooking, Cute, Decorate, Design, Dress Up, Fashion, Girl, Girls, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/po7fqkgpedgq5mn2frkjzg1zxesmbdsn/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "47120",
        "title": "Kids Glow Paint Game",
        "description": "Experience the joy of a captivating coloring and painting adventure now available online. Excitingly designed for young minds, the Kids Glow Paint Game enables kids to unlock their imaginative prowess using an array of vibrant tools. Engagingly, this game not only empowers children to create stunning visuals but also introduces them to important lessons on numbers, letters, colors, and much more.",
        "instructions": "On the desktop use the mouse to click to choose tools and items to color and draw the pages On mobile use your finger to click to choose tools and items to color and draw the pages ",
        "url": "https://html5.gamemonetize.com/b6zj7udqxft24ya61b4tk5liym70cvkh/",
        "category": "Girls",
        "tags": "Animal, Boy, Cake, Coloring, Cute, Drawing, Educational, Fun, Girls, HTML5, Kids, Mobile, Panda, Princess",
        "thumb": "https://img.gamemonetize.com/b6zj7udqxft24ya61b4tk5liym70cvkh/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "46467",
        "title": "Sisters Nails Design 2",
        "description": "Sofia and Zoe come to your nail salon, they want to get manicures. They are tired of the same old manicure and nail art, they want to try out something new. Now, you have two new nail art ideas, flower style and animal style, choose one of them for Sofia, so another is for Zoe. After doing their nails, please pick cute rings and necklaces to complete the nail design. Have fun!",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/u5prxs9zv5t8b24bnifzxz3khexaguqa/",
        "category": "Girls",
        "tags": "Decorate, Design, Fashion, Girl, Girls, Kids, Nail, Nails, Simulation",
        "thumb": "https://img.gamemonetize.com/u5prxs9zv5t8b24bnifzxz3khexaguqa/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47116",
        "title": "Beads Art Design",
        "description": "Enjoy Your Creative And Relaxing Time! Bead Art is an addictive bead coloring game. During your commute,during lunch break, enjoy every piece of time. Placing colorful beads into the board and form a pattern, use iron to heat the beads to melt together, then youve completed a wonderful craft without difficulty. Also, feel the joy of the ASMR and amazing hand feeling. In Bead Art, you will appreciate the lovely and colorful bead arts youve made, create them and collect them. No matter when and where, it will be No Sweat to enjoy hours of fun.",
        "instructions": "Mouse click or tap to play Use your mouse to play this game Use the mouse to complete all the cooking steps and to decorate banana split ",
        "url": "https://html5.gamemonetize.com/ziwxy1y7eqw3cc488imj1d9ey3pjkfd7/",
        "category": "Girls",
        "tags": "Baby, Color, Coloring, Cute, Decorate, Design, Educational, Fashion, Girl, Girls, Kids, Puzzle, Simulation",
        "thumb": "https://img.gamemonetize.com/ziwxy1y7eqw3cc488imj1d9ey3pjkfd7/512x384.jpg",
        "width": "504",
        "height": "800"
    }
]