[
    {
        "id": "52206",
        "title": "Best Friends Puzzle",
        "description": "Hop on an epic adventure with the Bug Heroes and help them defeat the menacing birds of the forest! Strategically link at least three symbols of the same colour to empower the Heroes with their special perks. Explore the lush green forests with your bug friends.",
        "instructions": "Connect as many symbols of the same colour as possible to complete levels and defeat enemy birds Gather xp bottles and upgrade your bug heroes so they have even stronger perks ",
        "url": "https://html5.gamemonetize.com/1vs2hwmvsrsj3wes31qujc33budw5crx/",
        "category": "Hypercasual",
        "tags": "Casual, Forest, Match 3, Match-3, Match3, Math, Puzzle",
        "thumb": "https://img.gamemonetize.com/1vs2hwmvsrsj3wes31qujc33budw5crx/512x384.jpg",
        "width": "600",
        "height": "800"
    },
    {
        "id": "52235",
        "title": "Wood Whacker",
        "description": "Welcome to Wood Whacker, where your lumberjack skills are put to the test as you chop wood and dodge branches! Think its an easy task? Think again! While the gameplay is simple to grasp, mastering it is a whole different challenge. With two variable environments and 10 characters to unlock, the excitement never ends! So grab your axe, rush through the forest, and chop those trees as fast as you can! Wood Whacker offers a one-touch control system, addictive gameplay, and a nostalgic arcade style experience thats completely free! Website Developer <a href='https://www.giugames.com/'>https://www.giugames.com/</a>",
        "instructions": "Mouse click or tap to play ",
        "url": "https://html5.gamemonetize.com/lgypzawcvw0qium6zihbr5965cq2xq4u/",
        "category": "Hypercasual",
        "tags": "Arcade, HTML, HTML5, mapi games",
        "thumb": "https://img.gamemonetize.com/lgypzawcvw0qium6zihbr5965cq2xq4u/512x384.jpg",
        "width": "768",
        "height": "1024"
    },
    {
        "id": "51930",
        "title": "Box Jenga",
        "description": "Box Jenga takes the classic stacking concept to new  Your mission is to strategically drop boxes onto a platform and build the tallest tower possible. But beware, as the challenge intensifies with each added box, precision and balance become your best allies.",
        "instructions": "Use screen tap to drop a box ",
        "url": "https://html5.gamemonetize.com/6xn2izpfnkd8dil8jesft45yt1n9avlc/",
        "category": "Hypercasual",
        "tags": "Arcade, Casual, Click, Clicker, HTML5, Hypercasual, Logic, Logical, Timing",
        "thumb": "https://img.gamemonetize.com/6xn2izpfnkd8dil8jesft45yt1n9avlc/512x384.jpg",
        "width": "640",
        "height": "960"
    },
    {
        "id": "52039",
        "title": "Tower Hero Wars",
        "description": "1 - Use your brain to move your hero 2 - Defeat all enemies 3 - Increase your strength 4 - Defend your tower Collect all the treasures and become the ultimate hero in Hero Tower Wars. Enjoy your time.",
        "instructions": "Touch click the hero and drag it to the enemy tower ",
        "url": "https://html5.gamemonetize.com/6ihms6ihxt9boxr5ogfsv28ffly7pla2/",
        "category": "Hypercasual",
        "tags": "Android, Best Games, games for your website, HTML5, html5 games, Superhero",
        "thumb": "https://img.gamemonetize.com/6ihms6ihxt9boxr5ogfsv28ffly7pla2/512x384.jpg",
        "width": "640",
        "height": "1280"
    },
    {
        "id": "52210",
        "title": "Sausage Survival Master",
        "description": "Stay alive for 30 seconds by engaging in battles and races across various randomly generated 3D mini-games. Accumulate experience and conquer diverse challenges to ensure the survival of your 3D character. Embark on thrilling adventures, stay nimble, and maneuver like a seasoned expert to keep your character alive! Website Developer <a href='https://www.bestcrazygames.com/home/keyword/dinosaurs'>https://www.bestcrazygames.com/home/keyword/dinosaurs</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/yuxzpycmk9su4jcystlzeay74750jn6v/",
        "category": "Hypercasual",
        "tags": "Android, HTML5, iPad, iPhone, Mentolatux, Mobile, run, smash",
        "thumb": "https://img.gamemonetize.com/yuxzpycmk9su4jcystlzeay74750jn6v/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "52041",
        "title": "Create your beach",
        "description": "In the game you have to take on the role of the beach manager. Monitor the needs of visitors, hire staff, arrange banana swims. Also arrange entertainment for children and adults. Can you arrange the whole beach? Money is needed for the arrangement of the beach. To earn them, serve vacationing people.",
        "instructions": "Computer control The W A S D keys control the character Control on the phone tablet Moving your finger across the screen controls the character ",
        "url": "https://html5.gamemonetize.com/fw9nysw95vq77zyjzsyu5hkeah5qpwd7/",
        "category": "Hypercasual",
        "tags": "1 Player, 3D, Best, Funny, Summer",
        "thumb": "https://img.gamemonetize.com/fw9nysw95vq77zyjzsyu5hkeah5qpwd7/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "51948",
        "title": "Unblocked Golf Challenge",
        "description": "Unblocked Golf Challenge is an exciting 3D golf game with multiple levels of varying difficulty. Test your skills and unlock new challenges as you progress. Collect in-game rewards to purchase unique balls, each with their own advantages. Embark on a golfing adventure like never before! Website Developer <a href='https://www.bestcrazygames.com/home/keyword/zombie'>https://www.bestcrazygames.com/home/keyword/zombie</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ph1c8lai59go2e3kjbi0ta88f1piuehi/",
        "category": "Hypercasual",
        "tags": "3D, 3D Games, Android, Click, Golf, HTML5, iPad, iPhone, Mentolatux, Mobile, Unity3D",
        "thumb": "https://img.gamemonetize.com/ph1c8lai59go2e3kjbi0ta88f1piuehi/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51932",
        "title": "Square Fit",
        "description": "Square Fit is easy to pick up and play, yet offers a rewarding challenge. Your objective is to tap and hold to grow a square, then release it at just the right moment to fit into the designated target area. Sounds simple, right? Well, the puzzles become progressively trickier, requiring a strategic approach to conquer each level.",
        "instructions": "Tap and hold to grow the square and then release to drop it Your task is to get into the target area ",
        "url": "https://html5.gamemonetize.com/pn8mqz0w7vzjf5uphq3q8irts9asbon5/",
        "category": "Hypercasual",
        "tags": "Action, Arcade, Casual, Geometry, HTML5, Hypercasual, Logic, Logical, Math, Puzzle",
        "thumb": "https://img.gamemonetize.com/pn8mqz0w7vzjf5uphq3q8irts9asbon5/512x384.jpg",
        "width": "640",
        "height": "960"
    },
    {
        "id": "52137",
        "title": "Match Emoji",
        "description": "Match Emoji is a casual puzzle game. In the game, players need to join three identical blocks together to eliminate them. The pictures contained on each block are different. Players are in the process of elimination. You must think carefully. In the process of connecting, there must be more than three blocks before they can be eliminated. Levels: 100 levels. We will continue to launch new levels in the future. Youll never be bored!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/2wmq5crts83quutjwhu2b3x1lorurzwr/",
        "category": "Hypercasual",
        "tags": "1 Player, Bejeweled, Best Games, Brain, Click, Funny, H5, Hypercasual, touchscreen",
        "thumb": "https://img.gamemonetize.com/2wmq5crts83quutjwhu2b3x1lorurzwr/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "52065",
        "title": "Egg Hunt Mania",
        "description": "Get your basket ready and save all the eggs you can from a terrible fate. Make sure to empty a full basket into the store. Watch out for the rising quota for eggs each day!",
        "instructions": "Catch as many eggs as you can with your basket Sell the eggs in the shop and use the money for upgrades and multipliers to sell eggs faster Survive the day by catching at least the minimum amount of eggs required ",
        "url": "https://html5.gamemonetize.com/eeu7skhfouxj7cgwpq83rm3fhm0jwo0x/",
        "category": "Hypercasual",
        "tags": "Action, Click, Clicker, endless",
        "thumb": "https://img.gamemonetize.com/eeu7skhfouxj7cgwpq83rm3fhm0jwo0x/512x384.jpg",
        "width": "600",
        "height": "800"
    },
    {
        "id": "52088",
        "title": "Longboard Crasher",
        "description": "It is an informal puzzle game where your objective is to descend safely. It may seem straightforward at first glance, but it offers a surprising level of complexity. Progress through numerous challenging levels, honing your problem-solving skills while enjoying yourself. Website Developer <a href='https://www.bestcrazygames.com/home/keyword/racing'>https://www.bestcrazygames.com/home/keyword/racing</a>",
        "instructions": "A-D to move characters for mobile use button from the game ",
        "url": "https://html5.gamemonetize.com/hi0kdc9xc9ml1oxbt8xay8k0t8xr8lzs/",
        "category": "Hypercasual",
        "tags": "Android, Arcade, HTML5, Hypercasual, iPad, iPhone, Mentolatux, Mobile, Skill",
        "thumb": "https://img.gamemonetize.com/hi0kdc9xc9ml1oxbt8xay8k0t8xr8lzs/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "52055",
        "title": "My Pets",
        "description": "My Pets is a game in which you need to feed a dog and a cat with bone and fish, paving the way through the regulation of platforms and their activation.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/700w1f2flm2r7v1kgbi95kjtcuy2u5cd/",
        "category": "Hypercasual",
        "tags": "Adventure, Animal, Best, Best Games, Cat, Fun, Funny, Mobile",
        "thumb": "https://img.gamemonetize.com/700w1f2flm2r7v1kgbi95kjtcuy2u5cd/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "52047",
        "title": "Skibidi Toilet Jumper",
        "description": "Skibidi Toilet Jump is a fast-paced, challenging arcade game that will test your reflexes and coordination. In this game, you control a toilet that moves up and down. Your goal is to reach the top of the tower without getting caught in the rising electric current. You will also need to shoot and destroy the enemy robots patrolling the tower. The game is easy to learn but difficult to master. The further you go, the more challenging it will become. Developer: odgameinfo@gmail.com",
        "instructions": "PC W or Up Button Jump Mobile Jump and Fire button",
        "url": "https://html5.gamemonetize.com/yt2jlgpengkp8v3iz3g6geb8qpdyxoqk/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Action, Adventure, jump, Jumping, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/yt2jlgpengkp8v3iz3g6geb8qpdyxoqk/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "51998",
        "title": "Fill the Cup",
        "description": "Fill the Cup is a game in which you need to launch a ball on platforms to hit the cup three times, you also need to collect stars on the way.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/v1sk2rst2jjpcf6z0ztyn4pigj72onwn/",
        "category": "Hypercasual",
        "tags": "Ball, Best Games, Collecting, Funny, HTML5, Mobile, Skill",
        "thumb": "https://img.gamemonetize.com/v1sk2rst2jjpcf6z0ztyn4pigj72onwn/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "51869",
        "title": "House Demolition Car ",
        "description": "Get ready for an adrenaline-fueled adventure in Wreck &amp; Riches: Demolition Car Tycoon, where youll step into the shoes of a fearless demolition car builder and entrepreneur. Dive into a world of chaos, creativity, and cash as you build, crash, and cash in! Build Your Dream Demolition Car: Start with a rusty wreck and transform it into a powerful demolition machine. Customize every aspect of your car, from body design to engine upgrades and weapon installations. Website Developer <a href='https://www.brightygames.com/cars-games/'>https://www.brightygames.com/cars-games/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/forme1zqfbxoogxfzruwq9n69bto9tyf/",
        "category": "Hypercasual",
        "tags": "Android, Car, demolition, Driving, HTML5, Mentolatux, Mobile",
        "thumb": "https://img.gamemonetize.com/forme1zqfbxoogxfzruwq9n69bto9tyf/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51843",
        "title": "Crushing Rocket",
        "description": "In the game, achieve victory by enhancing your cannon and shattering every pixel in your path to advance to the next level. Additionally, after each level, experience the excitement of a bonus level featuring a captivating hole mechanic! Website Developer <a href='https://www.crazygamesonline.com/featured'>https://www.crazygamesonline.com/featured</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/pcv0cv3az1yjf2dk27okj5dn84k91wqh/",
        "category": "Hypercasual",
        "tags": "Android, Bubble Shooter, cannon, HTML5, Mentolatux, Mobile, Rocket, Shoot, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/pcv0cv3az1yjf2dk27okj5dn84k91wqh/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51880",
        "title": "Coin Thief 3D Race",
        "description": "Coin Thief 3D is an adrenaline-pumping endless adventure! Dodge oncoming obstacles, collect coins, and test your reflexes on an infinite track. Immerse yourself in this thrilling 3D world where quick thinking and lightning-fast reactions are the key to success. Get ready to navigate through challenges, gather coins, and become the ultimate coin thief!",
        "instructions": "WASD or Arrow Button",
        "url": "https://html5.gamemonetize.com/o1nzi5olfj3n13tnis7sqkk8hqaej4iq/",
        "category": "Hypercasual",
        "tags": "1 Player, 3D, 3D Games, Hypercasual, Race, Racing",
        "thumb": "https://img.gamemonetize.com/o1nzi5olfj3n13tnis7sqkk8hqaej4iq/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "51837",
        "title": "Flappy Skibidi",
        "description": "Flappy Skibidi is super fun flappy game that you can play online for free. Help our skibidi fly as long distance as possible. Kill or destroy your enemy, collect coins and unlock other skibidi characters. Have fun!",
        "instructions": "Mouse to play ",
        "url": "https://html5.gamemonetize.com/uacvsdx8l70vnoeumy0pfijgy15utv5s/",
        "category": "Hypercasual",
        "tags": "Avoid, Collecting, fly, jump, Skibidi, Skibidi Toilet, Skill",
        "thumb": "https://img.gamemonetize.com/uacvsdx8l70vnoeumy0pfijgy15utv5s/512x384.jpg",
        "width": "480",
        "height": "854"
    },
    {
        "id": "51970",
        "title": "Color Fun For Kids",
        "description": "Embark on a vibrant journey with Color Fun For Kids! This delightful game offers a kaleidoscope of hues for young minds to explore. Engage in a playful world of creativity as children immerse themselves in coloring activities with user-friendly numeric guides. Unlock the joy of blending colors, fostering imagination, and enhancing fine motor skills. Download now for an interactive and educational experience that makes learning colors a delightful adventure for your little ones! Website Developer <a href='https://www.giugames.com/'>https://www.giugames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/509c77nqa9m5y7sx6zbeh19hrh8utf78/",
        "category": "Hypercasual",
        "tags": "Color, Coloring, Draw, Drawing, Family, HTML, HTML5, Kid, Kids, mapi games, Simulation",
        "thumb": "https://img.gamemonetize.com/509c77nqa9m5y7sx6zbeh19hrh8utf78/512x384.jpg",
        "width": "600",
        "height": "1024"
    },
    {
        "id": "51718",
        "title": "BlocksEliminate",
        "description": "Eliminating blocks is a simple game where players need to get points by eliminating blocks of the same color. The goal of the game is to gain points by eliminating blocks of the same color.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/hg3yt9z75maehkt74trzislqzlgg6sqg/",
        "category": "Hypercasual",
        "tags": "blocky, Classic, Color, html5 games, Hypercasual, Logic, unity games",
        "thumb": "https://img.gamemonetize.com/hg3yt9z75maehkt74trzislqzlgg6sqg/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51259",
        "title": "Great MOM Kitchen Cutter",
        "description": "Tap and hold or release to control the knives to slice and dice all the cuttable objects in your way. Try to slice it all but dont forget about the perilous obstacles that can make it a real survival challenge.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/6io7ljz0m6w9vmzotq3i2ab9h09rxsaj/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Avoid, cut, Fruits, Fun, Kids",
        "thumb": "https://img.gamemonetize.com/6io7ljz0m6w9vmzotq3i2ab9h09rxsaj/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51919",
        "title": "Digital Circus Click and Paint",
        "description": "Digital Circus Click and Paint is a super fun coloring game designed for kids and adults alike! Let your inner artist come to live as you dive into a vibrant circus of creativity, where each click is a brushstroke and every image is a canvas waiting for your colorful touch.",
        "instructions": "Mouse to play ",
        "url": "https://html5.gamemonetize.com/w515tb9fvk9ny24tj3qmkkmnjyjtf2tt/",
        "category": "Hypercasual",
        "tags": "Arcade, Casual, Coloring, digital circus, Girls, Hypercasual, Kids, Puzzle",
        "thumb": "https://img.gamemonetize.com/w515tb9fvk9ny24tj3qmkkmnjyjtf2tt/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "51490",
        "title": "Spider Hidden Difference",
        "description": "Spider Hidden Difference is a well-designed brain challenge about find any difference between spider object. Find Differences Spider Hidden Difference will take you through a relaxing and enjoyable journey. Explore hundred of free-to-play levels and have fun while trying to spot differences between spider picture. Improve your concentration and detective skills. Search and spot hidden objects. Relax your mind. But beware of spider!!!!",
        "instructions": "tap to play",
        "url": "https://html5.gamemonetize.com/4y5tdjgwsson69zmjquqb45kgoflb538/",
        "category": "Hypercasual",
        "tags": "Animal, Difference, Hidden, Spiderman",
        "thumb": "https://img.gamemonetize.com/4y5tdjgwsson69zmjquqb45kgoflb538/512x384.jpg",
        "width": "980",
        "height": "600"
    },
    {
        "id": "49827",
        "title": "Bomb Factor",
        "description": "Enhance the quantity of your missiles by employing multiplication blocks, and systematically dismantle all impediments along your route! Obliterate menacing creatures, towering buildings, valiant heroes... Absolutely anything that dares to obstruct your progress! Unleash the full might of your explosive arsenal! Website Developer <a href='https://www.bestcrazygames.com/home/keyword/dressup'>https://www.bestcrazygames.com/home/keyword/dressup</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/p2l0ssdekjzaognsqsno1ro2jyew44ea/",
        "category": "Hypercasual",
        "tags": "Android, Arcade, HTML5, Hypercasual, iPad, iPhone, Mentolatux, Mobile, Shoot, Shooting",
        "thumb": "https://img.gamemonetize.com/p2l0ssdekjzaognsqsno1ro2jyew44ea/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51826",
        "title": "Yes or No Challenge Run",
        "description": "This time you will not only run over the platforms and pass through the gates for the next version of yours, but you will also answer questions and earn rewards. Yes or No Challenge Run game comes with lots of features, surprises, and cool questions! Some helper machines or pets will be with you during this adventure. You can embark on this Yes or No adventure either single-player or 2 player. Website Developer <a href='https://www.twoplayergames.org/'>https://www.twoplayergames.org/</a>",
        "instructions": "In single player game mode Move A D or LEFT-RIGHT ARROWS 1P MODE ONLY Pick Answer Use MOUSE and LEFT-CLICK to interact In 2 player game mode Player 1 Move Pick answer A D You can also use MOUSE and LEFT-CLICK to interact Player 2 Move Pick ans",
        "url": "https://html5.gamemonetize.com/e1rjsmb2zbyj5lehssmxn82p7acfu44w/",
        "category": "Hypercasual",
        "tags": "2 Player, 2 Player Games, 3D, 3D Games, Animal, Brain, Casual, Collecting, Fun, Hypercasual, Kids, Quiz, Simulation",
        "thumb": "https://img.gamemonetize.com/e1rjsmb2zbyj5lehssmxn82p7acfu44w/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51855",
        "title": "Perfect Snapshot",
        "description": "Perfect Snapshot is a casual stress relief game. Buddy is a puppet whose limbs can be retracted at will. Your goal is to secure Buddys limbs so that he can successfully take the photo. When Buddys limbs are stretched too long, he will show an uncomfortable expression, but when taking pictures, he will turn into a smiling face!",
        "instructions": "Slide the screen to move the Buddy ",
        "url": "https://html5.gamemonetize.com/qo67jhhrf1i0a672n6b8ou76u8e35f93/",
        "category": "Hypercasual",
        "tags": "Boys, HTML, Interactive, Kids, Relaxation",
        "thumb": "https://img.gamemonetize.com/qo67jhhrf1i0a672n6b8ou76u8e35f93/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "51842",
        "title": "Angry Plants Fighting",
        "description": "Angry Plants is a thrilling survival contest where charming and remarkable Plants face off against fearsome monsters. You are the champion these Plants need and deserve, ready to stand with them in every battle against the invading foes. Prepare for combat! This game promises endless hours of excitement and amusement. Website Developer",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/yg96ly1me1aqac5xbu8h87fy0pdrwq3f/",
        "category": "Hypercasual",
        "tags": "Android, angry, angryplants, HTML5, iPad, iPhone, Mentolatux, Mobile, Plant, Zombie",
        "thumb": "https://img.gamemonetize.com/yg96ly1me1aqac5xbu8h87fy0pdrwq3f/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51393",
        "title": "Beach Rescue",
        "description": "Beach Rescue offers a straightforward puzzle gaming experience, challenging you to create a path that leads to the rescue of each drowning character. Your goal is to construct the most efficient route, ensuring the safety of everyone while also collecting as many coins as you can along the way! Website Developer <a href='https://www.crazygamesonline.com/news'>https://www.crazygamesonline.com/news</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/uvz0zfh5w7vzhu837au9g578av6wqwuk/",
        "category": "Hypercasual",
        "tags": "Android, Boat, Click, HTML5, Hypercasual, iPad, iPhone, Mentolatux, Puzzle",
        "thumb": "https://img.gamemonetize.com/uvz0zfh5w7vzhu837au9g578av6wqwuk/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51807",
        "title": "Skibidi Toilet Parkour run 2024",
        "description": "In the Skibidi Toilet Parkour run game you Dash Toilet Toilets to Toilets. Flip, jump, fall, and vault over obstacles and toilets to set all new records.",
        "instructions": "Mouse click and swipe to play",
        "url": "https://html5.gamemonetize.com/wlg8fzsavfopmlr2edv6corkpabm8u20/",
        "category": "Hypercasual",
        "tags": "3D, 3D Games, Arcade, Best, Best Games, Hypercasual, jump, Jumping, run, running, Unity3D",
        "thumb": "https://img.gamemonetize.com/wlg8fzsavfopmlr2edv6corkpabm8u20/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51269",
        "title": "Pets Master Simulator",
        "description": "An amazing open world of animals and you can take each of them into your team! Cute and dangerous, small and crushing, on the ground and in the air - they are always with you! Come in and take the best pets to your team! This is the best pet simulator: open world, more than 100 unique animals, enemies of different races, raid bosses, various locations, lots of gold and crystals!! Enter the game, gather your team of pets, clear this world of enemies and teleport to a new world, your help is needed there too! Dont forget to upgrade yourself and your pets, otherwise you wont make it... Good luck!!",
        "instructions": "Joystick control on the screen or WASD keyboard To attack a target stand nearby and wait In the inventory select pets for the team To get a new pet go to the desired egg and break it ",
        "url": "https://html5.gamemonetize.com/ggr668wn2myn95wfwysmb27f2fzlpo5z/",
        "category": "Hypercasual",
        "tags": "1 Player, 3D, 3D Games, Animal, Battle, Best Games, Casual, Collecting, Dragon, Mobile, Monster, unity",
        "thumb": "https://img.gamemonetize.com/ggr668wn2myn95wfwysmb27f2fzlpo5z/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "51687",
        "title": "Guessmaster Bingo",
        "description": "Embark on an exhilarating journey of prediction and luck with Guessmaster Bingo! Immerse yourself in the excitement of traditional bingo with a thrilling twist. As the numbers roll, challenge your intuition by guessing whether the next one will be higher or lower. Are you ready to master the art of prediction and embrace the unpredictability of Guessmaster Bingo? Take a chance, make your guesses, and let the bingo thrills unfold!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/lsdpdlsjj5q04xi5g20njkhgoagpbxqd/",
        "category": "Hypercasual",
        "tags": "1 Player, Casino",
        "thumb": "https://img.gamemonetize.com/lsdpdlsjj5q04xi5g20njkhgoagpbxqd/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "51353",
        "title": "Insane Galaxy Ball 2024",
        "description": "The primary objective of the game is to navigate through various levels while keeping the ball balanced on tracks suspended in outer space. Along the way, youll collect space coins. Each level presents a variety of obstacles that demand puzzle-solving skills, and the games difficulty ramps up as you advance. Website Developer <a href='https://www.bestcrazygames.com/news'>https://www.bestcrazygames.com/news</a>",
        "instructions": "WASD to move the ball",
        "url": "https://html5.gamemonetize.com/cjnawmhokb1fzx2b27mg6eus4htckq7o/",
        "category": "Hypercasual",
        "tags": "Action, Android, Ball, HTML5, iPad, iPhone, Mentolatux, Mobile, Puzzle, Space",
        "thumb": "https://img.gamemonetize.com/cjnawmhokb1fzx2b27mg6eus4htckq7o/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51669",
        "title": "Extreme Ping Pong Dash Challenge",
        "description": "How long can you keep a ball between platforms trying to get to the top through a path of challenging challenges? If you want to try yourself and join this challenge, show us your skills. Good luck!",
        "instructions": "Left Click And Right Click",
        "url": "https://html5.gamemonetize.com/zrp6lf3e19xfbyp7glszwvkopf0gm4pd/",
        "category": "Hypercasual",
        "tags": "Ball, Bounce, dash, Point And Click, Skill",
        "thumb": "https://img.gamemonetize.com/zrp6lf3e19xfbyp7glszwvkopf0gm4pd/512x384.jpg",
        "width": "600",
        "height": "800"
    },
    {
        "id": "51629",
        "title": "MergeFrisbees",
        "description": "Merge Frisbees is a very interesting ejection number casual mobile game, suitable for players of all ages. The rules and gameplay of the game are very simple. Players need to merge Frisbees with the same number to stack higher numbers, and When you meet the score requirements, you can successfully pass the level. In the game, players can break through their highest record step by step and create a new historical high!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/w3pjxmha5s2abnpt6890u19ypvp3cby0/",
        "category": "Hypercasual",
        "tags": "crash",
        "thumb": "https://img.gamemonetize.com/w3pjxmha5s2abnpt6890u19ypvp3cby0/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51303",
        "title": "Hoop Stack Brain Puzzel Game",
        "description": "Looking for a new sorting or puzzle game to challenge your brain or just kill your spare time? Hoop Stack Brain Puzzle Game might be just the right choice. This games similar to color water sort, ball sort, birds sort, or other sorting games, all you need to do is sort hoops! Use your logic and sort colors correctly.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/wqkpxgp7hp7uzvr2szqihdhk83a9hhul/",
        "category": "Hypercasual",
        "tags": "Brain, Casual, Fun, Hypercasual, Physics, Puzzle",
        "thumb": "https://img.gamemonetize.com/wqkpxgp7hp7uzvr2szqihdhk83a9hhul/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46385",
        "title": "Trash Dash Runner",
        "description": "Run through the streets as Trash Cat! Collect fishbones and ultra special sardine tins to continually upgrade your character and buy accessories! Try to get away from the angry dog in this endless runner!",
        "instructions": "Arrow keys",
        "url": "https://html5.gamemonetize.com/894v3g8khzmp8lj2t3rakxs334o6bxvx/",
        "category": "Hypercasual",
        "tags": "1 Player, Arcade, Cat, dash, Game, Games, HTML, HTML5, Hypercasual, Mobile, Online, run, running",
        "thumb": "https://img.gamemonetize.com/894v3g8khzmp8lj2t3rakxs334o6bxvx/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "50610",
        "title": "Skibidi Geometry Dash",
        "description": "Have fun and take control of the Skibidi toilet guy and go as far as you can, show that you can against this hard infinity game full of deadly obstacles and challenges !!!! Complete all levels and unlock new characters to continue the journey. Play Skibidi Dash now totally free and enjoy many hours of entertainment.Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "Touch the Screen or use the mouse",
        "url": "https://html5.gamemonetize.com/jrztyk0wdnq6wuoczlby4t8iv7h9de8r/",
        "category": "Hypercasual",
        "tags": "Arcade, Casual, dash, endless, Geometry, Hypercasual, Jumping, kiz10, running",
        "thumb": "https://img.gamemonetize.com/jrztyk0wdnq6wuoczlby4t8iv7h9de8r/512x384.jpg",
        "width": "800",
        "height": "480"
    },
    {
        "id": "29765",
        "title": "Streamer Rush 3D",
        "description": "You can&rsquo;t miss this interesting game! Streamer Rush is a fun and amazing 3D arcade game for all ages. You start the game as a poor woman at each level. But, as you grab more and more items with plus signs, your identity will transform. Remember, don&rsquo;t touch the items with minus signs, they will ruin your identity. Come and try this game and see how many identities you can switch! Have fun!",
        "instructions": "swipe to move left and right",
        "url": "https://html5.gamemonetize.com/5rm9an277dw0o7pw92n55uj1dmufo0e1/",
        "category": "Hypercasual",
        "tags": "3D, Casual, Cute, Dress Up, Girl, Kids, running",
        "thumb": "https://img.gamemonetize.com/5rm9an277dw0o7pw92n55uj1dmufo0e1/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "51485",
        "title": "Orbit Escape",
        "description": "In the game Orbit Escape you have to tap the screen at the right time to make the spaceship move in a straight line towards the next planet. If you don&rsquo;t do this at the right time, and consequently don&rsquo;t reach the planet, it results in game over. You can also collect coins to buy spaceship skins.",
        "instructions": "Use mouse or touch on the screen ",
        "url": "https://html5.gamemonetize.com/5skd9bhjajfzqm0820mydmawhvelf2ze/",
        "category": "Hypercasual",
        "tags": "Action, Best, Fun, Mobile, Rocket, Skill, Space, Spaceship",
        "thumb": "https://img.gamemonetize.com/5skd9bhjajfzqm0820mydmawhvelf2ze/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51637",
        "title": "Pomni Coloring Book",
        "description": "Pomni Coloring Book is fun coloring book for everyone! If you like Digital Circus characters then you will love this fun cartoon themed coloring book! Choose one of the cute images, pick your favorite color and start coloring! Enjoy it!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/qbhow7y6iwek6mk8ypvgnguo9s88d6ri/",
        "category": "Hypercasual",
        "tags": "Color, Coloring, digital circus, Drawing, free html5 games for your website, HTML, HTML5, Kids",
        "thumb": "https://img.gamemonetize.com/qbhow7y6iwek6mk8ypvgnguo9s88d6ri/512x384.jpg",
        "width": "1280",
        "height": "768"
    },
    {
        "id": "51546",
        "title": "Pocong Creepy Video Call Horror",
        "description": "Now creepy pocong call you in misterious way!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/tm162dqscdlg4ozbk3i9nigsgsprrxe5/",
        "category": "Hypercasual",
        "tags": "Horror, HTML5",
        "thumb": "https://img.gamemonetize.com/tm162dqscdlg4ozbk3i9nigsgsprrxe5/512x384.jpg",
        "width": "460",
        "height": "700"
    },
    {
        "id": "49451",
        "title": "BlackJack Pro",
        "description": "This fun game is built for Blackjack lovers, test your luck and skills in this classic card game.There are some misconceptions about the objective of the game of blackjack but at the simplest level all you are trying to do is beat the dealer.",
        "instructions": "How do you beat the dealer - By drawing a hand value that is higher than the dealer rsquo s hand value - By the dealer drawing a hand value that goes over 21 - By drawing a hand value of 21 on your first two cards when the dealer does not How do you l",
        "url": "https://html5.gamemonetize.com/7uoaq8kxlmfcxt1zhfqxip2bj6f201we/",
        "category": "Hypercasual",
        "tags": "Card, Casino, Casual, Hypercasual",
        "thumb": "https://img.gamemonetize.com/7uoaq8kxlmfcxt1zhfqxip2bj6f201we/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "48684",
        "title": "Space Driving",
        "description": "Embark on an exciting cosmic journey with Space Driving. Get ready to pilot your own space rocket through vast outer space while collecting shining stars and avoiding dangerous collisions with towering planets. Main Features: - Intuitive controls: Tap the screen to boost the rocket and avoid obstacles. - Collect Stars: Earn points by collecting stars. - Difficulty: The higher your score, the faster the planets. Get ready for an exciting journey through the cosmos, you will need quick reflexes and strategy to avoid collisions and conquer outer space. Climb aboard and find out now!",
        "instructions": "Tap the screen to control the rockets acceleration skillfully dodging the planets and collecting as many stars as possible ",
        "url": "https://html5.gamemonetize.com/3kud44v5n26tscahrmy2no3xembsabxs/",
        "category": "Hypercasual",
        "tags": "1 Player, Alien, Arcade, Best Games, Click, Driving, Funny, Games, HTML5, Hypercasual, Kids, Race, sky, Space",
        "thumb": "https://img.gamemonetize.com/3kud44v5n26tscahrmy2no3xembsabxs/512x384.jpg",
        "width": "450",
        "height": "800"
    },
    {
        "id": "51323",
        "title": "Cat Clicker",
        "description": "Make cats by clicking. The cat bubbles growth accelerates when you start buying upgrades that increase the number of cat bubbles in production. Eventually, you&rsquo;ll spawn billions of cat bubbles with each click, sending the cat world spiralling into a cuteness endless tunnel. You can use the reset button to start over and receive a permanent buff on your next game if you feel like a fresh start.",
        "instructions": "Use mouse or touch screen to click the cat Go to the store and buy upgrades to make even more bubbles ",
        "url": "https://html5.gamemonetize.com/9snllpt9q4sxcrwj8zbcfww1ngzv91ll/",
        "category": "Hypercasual",
        "tags": "Cat, Clicker, Cute, Point And Click",
        "thumb": "https://img.gamemonetize.com/9snllpt9q4sxcrwj8zbcfww1ngzv91ll/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51361",
        "title": "Dirty Them All",
        "description": "Lets splash some dirt over the walking people near the road with this Dirty Them All game! Drive your car through the mud and splash it all around the other people. Let them chase you until the finish line. The more people chase, the more scores you get. Let this funny and entertaining adventure begin!",
        "instructions": "Move A S or LEFT-RIGHT ARROWS or MOUSE and LEFT-CLICK",
        "url": "https://html5.gamemonetize.com/cx8jqaw5c88gc95kfizkpx4b7g7gw3oy/",
        "category": "Hypercasual",
        "tags": "1 Player, 3D, Adventure, Cars, Casual, H5, HTML5, Hypercasual, Kids, WebGL",
        "thumb": "https://img.gamemonetize.com/cx8jqaw5c88gc95kfizkpx4b7g7gw3oy/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "51375",
        "title": "Mad Dash",
        "description": "Immerse yourself in the heart-pounding action of Maddash, the ultimate action platformer! With its high-octane gameplay, Maddash delivers an adrenaline-fueled experience that will keep you on the edge of your seat. Dash, jump, and unleash your skills as you conquer an array of thrilling and dynamic levels. Engage in a fast-paced adventure where precise controls are the key to success. Mad Dash contains 30 Levels and still receiving updates on the level design part. Have fun Cheers :D",
        "instructions": "W Space Up Arrow Jump W Space Up Arrow Dash When in Air A D or Left Right Arrow Move Left Right",
        "url": "https://html5.gamemonetize.com/q9n3n1c85huobrh2bnh9b1h8gssogt30/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Action, Arcade, Best Games, Casual, Hypercasual, New, Platform, Puzzle, unity games, WebGL",
        "thumb": "https://img.gamemonetize.com/q9n3n1c85huobrh2bnh9b1h8gssogt30/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "51211",
        "title": "goemetry vertical (poligon dash)",
        "description": "poligon dash Online is a top scrolling platformer. Move over and over obstacles to stay alive. If you get it wrong, go back to the beginning!",
        "instructions": "mobile mode cube swipe right or left to move lane mode rocket hold touch and release to change angle mode cars swipe hold right or left to turn windows mode cube press A or D to move lane mode rocket press or release mouse left to change angle m",
        "url": "https://html5.gamemonetize.com/82ird9vx7ae3kzro4p09h5cdb3kjuhz3/",
        "category": "Hypercasual",
        "tags": "Arcade, Best Games, Cars",
        "thumb": "https://img.gamemonetize.com/82ird9vx7ae3kzro4p09h5cdb3kjuhz3/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "46807",
        "title": "Little Mermaid",
        "description": "Little Mermaid Endless Runner, you play as the Little Mermaid, as she swims through the ocean collecting pearls. You must avoid obstacles such as rocks, jellyfish, and sharks, and collect as many pearls as possible. The longer you swim, the faster the ocean currents become, making it more difficult to avoid obstacles.",
        "instructions": "Desktop Use the left click button to jump Mobile Tap on the screen to jump Controls and indicators Upper left side of the screen has the pause button The scores and levels are shown in the upper middle of the screen ",
        "url": "https://html5.gamemonetize.com/xyzememvkodl1dbtwi1wpfv7wtd2i7yg/",
        "category": "Hypercasual",
        "tags": "2D, Baby Hazel, Casual, HTML, HTML5, Hypercasual, Mermaid",
        "thumb": "https://img.gamemonetize.com/xyzememvkodl1dbtwi1wpfv7wtd2i7yg/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "51157",
        "title": "Relax Bubble Shooter",
        "description": "Relax Bubble Shooter is a fantastic game suitable for the whole family and children, combining relaxation and mental challenge. With a vibrant design, rich colors, and mesmerizing effects, this game will leave an unforgettable experience. Features: Super addictive game! Relaxing gameplay! Bomb, lightning, and more power-ups to help you win. Vivid levels: Go through hundreds of exciting levels! Simple game rules. Great special effects and beautiful graphics! Special reinforcement balls. Calm, soothing music.",
        "instructions": " PC Controls Aim with the mouse in the desired direction Left mouse button shoot Right mouse button change the ball Controls on mobile device Aim your finger in the desired direction and release your finger ",
        "url": "https://html5.gamemonetize.com/5g511z49pcxiibi6zof88l2nosclaef8/",
        "category": "Hypercasual",
        "tags": "Bubble, Bubble Shooter, Match 3, Match-3, Match3",
        "thumb": "https://img.gamemonetize.com/5g511z49pcxiibi6zof88l2nosclaef8/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50711",
        "title": "Amazing Digital Runner Circus",
        "description": "The incredible Digital Runner Circus offers an enjoyable and demanding experience where you dash and gather your crates within a fantastical digital circus designed for running. Sprint and swipe across the screen to dodge obstacles and test your ability to build a towering stack! Website Developer <a href='https://zh.bestcrazygames.com'>https://zh.bestcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/cnjyikth6ycyq1f2twv2iy4j0nu33vca/",
        "category": "Hypercasual",
        "tags": "Android, circus, digital circus, HTML5, Hypercasual, iPad, iPhone, Mentolatux, Mobile, run, running",
        "thumb": "https://img.gamemonetize.com/cnjyikth6ycyq1f2twv2iy4j0nu33vca/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50988",
        "title": "MushroomTarzan",
        "description": "Embark on an exhilarating journey through the lush jungle canopy in Mushroom Tarzan! Take control of the legendary vine-swinging hero as he navigates a perilous world of towering mushrooms. Your mission is to guide Tarzan through this challenging environment, leaping from one colossal mushroom to another while skillfully avoiding a plunge into the waters below. Mushroom Tarzan tests your agility and timing as you traverse the jungle treetops. With each jump, encounter smaller, more elusive mushrooms that demand precision and quick reflexes. Be on the lookout for mischievous monkeys, swooping birds, and other wild creatures that add an extr",
        "instructions": "Swipe with your mouse",
        "url": "https://html5.gamemonetize.com/dcms4he5bsr6jqp7zbn2wfyp2x2rx6ws/",
        "category": "Hypercasual",
        "tags": "1 Player, 3D, 3D Games, 8 Ball Pool, Action",
        "thumb": "https://img.gamemonetize.com/dcms4he5bsr6jqp7zbn2wfyp2x2rx6ws/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "45395",
        "title": "Demolition Car Online",
        "description": "A game with super destructive power is here! Demolish the building in front and grab bricks with your car! Sell bricks to make gold coins, boost your car&rsquo;s performance and capacity, and achieve success faster! Don&rsquo;t wait! Join and challenge!",
        "instructions": "Tap to play",
        "url": "https://html5.gamemonetize.com/t278lhv8eun90v8stxwuzrjhnyfghsia/",
        "category": "Hypercasual",
        "tags": "Car, Collecting, Kids, Management",
        "thumb": "https://img.gamemonetize.com/t278lhv8eun90v8stxwuzrjhnyfghsia/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "50856",
        "title": "Merge Muscle Tycoon",
        "description": "Engage in physical activity today, and you can achieve a fit and robust physique. Welcome to Merge Muscle Tycoon MMA Boxing, the game designed to assist you in becoming a master of muscles, a skilled boxer, or a proficient MMA fighter. Numerous workouts aimed at enhancing your strength are awaiting your exploration. Website Developer <a href='https://ru.bestcrazygames.com'>https://ru.bestcrazygames.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/wrn8er5k3jrmyo310joxsem9ilk6f6oo/",
        "category": "Hypercasual",
        "tags": "Android, Click, HTML5, html5 games, iPad, iPhone, Mentolatux, Mobile, onetouch, Sports, touch, touchscreen",
        "thumb": "https://img.gamemonetize.com/wrn8er5k3jrmyo310joxsem9ilk6f6oo/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51029",
        "title": "Monster Duelist",
        "description": "Monster Duelist immerses players into a mysterious world where they assume the role of a monster duelist. Exploring vast territories, they capture various unique monsters. Through battles against formidable opponents, players enhance their combat prowess, striving to become the ultimate duelist. Utilizing the monsters they capture, they assemble a powerful team, engage in battles, and demonstrate their skills and courage!",
        "instructions": "WASD or arrow keys or left mouse button move Left mouse button interact with in-game UI",
        "url": "https://html5.gamemonetize.com/rhifs2sxfqdfhjhczhecfb995cmmsc79/",
        "category": "Hypercasual",
        "tags": "3D, Adventure, Arena, Casual, Fighting",
        "thumb": "https://img.gamemonetize.com/rhifs2sxfqdfhjhczhecfb995cmmsc79/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50949",
        "title": "Floor Jumper Escape",
        "description": "Embark on a legendary adventure in Floor Jumper Escape, a classic platformer that combines timeless gameplay with modern challenges. Test your skills as you tap the screen to make gravity-defying jumps from floor to floor. Collect shiny money along the way, but beware of pitfalls! How high can you climb before the challenges become insurmountable? Discover a world of nostalgic fun and addictive gameplay in Floor Jumper Escape.",
        "instructions": "Tap the screen to make your character jump Time your jumps to navigate from floor to floor Collect money to score points Avoid falling off the window ledge Challenge yourself to climb as high as possible ",
        "url": "https://html5.gamemonetize.com/c01vq6i15woncpz2hku744930e70mdhk/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Arcade, Girl, jump, Jumping, Platform",
        "thumb": "https://img.gamemonetize.com/c01vq6i15woncpz2hku744930e70mdhk/512x384.jpg",
        "width": "640",
        "height": "960"
    },
    {
        "id": "50122",
        "title": "Kids Alphabet",
        "description": "Educational Game, Specifically Made for Children! Introducing &ldquo;Kids Alphabet&rdquo;, the latest educational game developed by RolinkStudio, specially crafted for children! Within this engaging game, kids will explore the wonders of the alphabet, practice writing skills, and expand their vocabulary. Featuring a captivating blend of vibrant visuals and a delightful female voice, children will be immersed in an enchanting kindergarten-like experience! This game is ideal for businesses and portals seeking to provide both education and entertainment.",
        "instructions": "Mouse click or tap to play This Game is mobile-friendly and can be played on both browsers and mobile ",
        "url": "https://html5.gamemonetize.com/zpmt9jn5art13av0mqzrlm0bd5eguogw/",
        "category": "Hypercasual",
        "tags": "Baby, Baby Games, Baby Hazel, Best Games, Educational, Kid, Kids, Letters",
        "thumb": "https://img.gamemonetize.com/zpmt9jn5art13av0mqzrlm0bd5eguogw/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50832",
        "title": "Crazy Bubble Breaker ",
        "description": "Crazy Bubble Breaker is a fun and challenging 2D bubble shooter physics puzzle game. You have to destroy all bubbles with falling balls. You can aim the bubble with a subline and release the ball. You can also bounce the ball off the walls to hit more bubbles with one ball. Can you eliminate them? Dozens of levels are waiting for you to challenge! Use your brain and try to finish all levels with the fewest balls!",
        "instructions": "On PC and Mobile Tap and hold set the ball Loose the finger release the ball",
        "url": "https://html5.gamemonetize.com/v31o8je906oivptxuqdki7tef4nhoqdj/",
        "category": "Hypercasual",
        "tags": "2D, Ball, Boys, Crazy, Girls, Kids, Timing",
        "thumb": "https://img.gamemonetize.com/v31o8je906oivptxuqdki7tef4nhoqdj/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "50877",
        "title": "Watermelon Fruit Merge",
        "description": "Combine fruits to reveal even more delightful surprises! Can you uncover the legendary watermelon? Immerse yourself in a juicy puzzle adventure today! Explore the latest craze in mobile gaming! Merge melons, pineapples, apples, and a variety of other fruits inside the box. Your mission? Keep them from reaching the top. Merge identical fruits to produce larger and more rewarding varieties, ultimately reaching the coveted Watermelon! Set your sights high and aim for your best score before the box overflows. Your ultimate objective? Website Developer <a href='https://in.kizi10.org'>https://in.kizi10.org</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/4lyq1vdatcf88ms5eus7xdkp5pultb04/",
        "category": "Hypercasual",
        "tags": "Android, Click, HTML5, Hypercasual, iPad, iPhone, Mentolatux, Mobile, watermelon",
        "thumb": "https://img.gamemonetize.com/4lyq1vdatcf88ms5eus7xdkp5pultb04/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50778",
        "title": "Family Camping Trip",
        "description": "Family Camping Trip is a fun and creative 2D cartoon puzzle game for kids and girls. You have to help the Millers find and match items for their trip. You can also design new outfits for them as you like. You will earn badges when you complete any missions. You also have to wash the car with the tools and the hints. There are more exciting links for you to unlock and play for the Millers. You will love this game and its mini puzzles!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/34ken32mucs5o4xdg1d4jpi3ti6p2bv9/",
        "category": "Hypercasual",
        "tags": "2D, Boys, Casual, Cute, Design, Girls, Kids, Puzzle",
        "thumb": "https://img.gamemonetize.com/34ken32mucs5o4xdg1d4jpi3ti6p2bv9/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "50913",
        "title": "2048 2048",
        "description": "2048 2048 - the world needs this kind of mathematics! Both old and young with a mathematical mind and a humanitarian mind can safely play with numbers. Yes, we didn&rsquo;t invent a bicycle, we just modernized the well-known game with numbers. Our design will pleasantly surprise you: 3D dice, furiously stacked, ready to throw their numbers. Just play, just have fun, just enjoy the new design of the game you already love. Just K.Corp.",
        "instructions": "Hold the cube and move it to select the direction in which the selected cube will move Then release the cube and try to take the world championship ",
        "url": "https://html5.gamemonetize.com/3xh4d3pe4xoweplx0e5p63vp2t8ic7i5/",
        "category": "Hypercasual",
        "tags": "1 Player, 2048, 3D, Fun, Matching, Number, Physics, unity",
        "thumb": "https://img.gamemonetize.com/3xh4d3pe4xoweplx0e5p63vp2t8ic7i5/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "50998",
        "title": "My Pets Shop",
        "description": "This is an easy and relaxing game in which you are the owner of a pet store! Positive and beautiful graphics, meditative gameplay. Grow food, feed animals, build new enclosures, sell animals to buyers. Your goal is to earn as much money as possible, for this try to grow and sell as many animals as possible. Have a good game!",
        "instructions": "Joystick control on the screen To catch animals get closer to them and wait for the heart indicator to fill up",
        "url": "https://html5.gamemonetize.com/mvlzpmz4k7onh6bw238n9t0wbcbe2wvt/",
        "category": "Hypercasual",
        "tags": "1 Player, Animal, Business, Collecting, Farm, Pokemon, unity",
        "thumb": "https://img.gamemonetize.com/mvlzpmz4k7onh6bw238n9t0wbcbe2wvt/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "50848",
        "title": "Nail Challenge",
        "description": "This time the challenge begins with a wood piece, a nail, and a hammer. Create your own team and start nailing the nails into the woods! You should nail before your opponents team. Dont miss chances on golden nails to get more power. Various characters in the shop will be waiting. Make sure you create the strongest team. Between the levels you will play some bonus levels, try to smash as much wood with your hammer and nail and get as many bonus game coins as you can!",
        "instructions": "Player 1 SPACE Player 2 DOWN ARROW KEY",
        "url": "https://html5.gamemonetize.com/n1lud23un2plko5mpk0fj1ccu91453or/",
        "category": "Hypercasual",
        "tags": "2 Player, 3D, Action, Adventure, Arena, Battle, HTML5, Race, Sport",
        "thumb": "https://img.gamemonetize.com/n1lud23un2plko5mpk0fj1ccu91453or/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50860",
        "title": "Santa Girl Dash",
        "description": "The daughter of Santa Claus has to collect all present gifts that are scattered around the North Pole. But beware, there are many enemies and obstacles on the way. Santa Girl Dash is an endless game where you have to go the longer way to beat the record. Website Developer <a href='https://onduck.com'>https://onduck.com</a>",
        "instructions": "Mobile Touch the right side of the screen to jump Touch the left side of the screen to slide Desktop Press up arrow key to jump Press down arrow key to slide ",
        "url": "https://html5.gamemonetize.com/nhnylaa7ec1fkg5qktic0tb0ockeqmkr/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Arcade, Christmas, Girl, Platform, running, Santa, Winter",
        "thumb": "https://img.gamemonetize.com/nhnylaa7ec1fkg5qktic0tb0ockeqmkr/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "50844",
        "title": "Squid Hit",
        "description": "Craft your unique tentacled monster in the laboratory. Navigate through levels, unlocking new characters, and enhancing your creatures abilities. Your monster isnt just an experiment &ndash; its a hero, freeing hostages and vanquishing enemies.",
        "instructions": "Desktop Use mouse or touchpad to select abilities and attack enemies Mobile Use the touchscreen for seamless control and combat ",
        "url": "https://html5.gamemonetize.com/of5zh6q5uf1cyq5149cjgd3cl4klzaal/",
        "category": "Hypercasual",
        "tags": "3D, Action, Alien, Battle, Casual, Creation, demolition, Fantasy, Fighting, Fire, Frozen, Hypercasual, Killing, WebGL",
        "thumb": "https://img.gamemonetize.com/of5zh6q5uf1cyq5149cjgd3cl4klzaal/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50842",
        "title": "My Little Car Wash",
        "description": "Wash and shine with Car Washing Game, a 2D cartoon game that lets you clean different vehicles. You don&rsquo;t need any experience, just follow the hints and use the tools to make the vehicles look new. You will have 22 vehicles to choose from, each with its dirt and stains. You will also have the drivers watching you as you work, so be quick and efficient. You will earn yellow stars for each vehicle you wash, and you will need them to unlock more vehicles. Car Washing Game is a game that will teach you some washing skills and make you have fun!",
        "instructions": "On PC and Mobile Tap and drag",
        "url": "https://html5.gamemonetize.com/iwvv23u51fe6armbmvhgo06ccnpw69fd/",
        "category": "Hypercasual",
        "tags": "2D, Boys, Car, Casual, Educational, Girls, Kids, Skill",
        "thumb": "https://img.gamemonetize.com/iwvv23u51fe6armbmvhgo06ccnpw69fd/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "39972",
        "title": "Christmas Pong",
        "description": "Christmas Pong is an online ping-pong game that is similar to the classic game. Looking for a fun and festive way to celebrate Christmas this year? Why not try your hand at Christmas Pong, the online pong game that everyone is talking about? With exciting gameplay and beautiful Christmas-themed graphics, Christmas Pong is the perfect way to get into the holiday spirit!",
        "instructions": "Tap to play",
        "url": "https://html5.gamemonetize.com/6oy15a3vt8k5gedmn2h09fhovecg4ryf/",
        "category": "Hypercasual",
        "tags": "Action, Arcade, Fun, Funny, Game, Games, HTML, HTML5, Hypercasual, NapTech Games, Online",
        "thumb": "https://img.gamemonetize.com/6oy15a3vt8k5gedmn2h09fhovecg4ryf/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "50828",
        "title": "Gravity Moose",
        "description": "Gravity Moose is an old-school gravity runner. Why is this game crazy? You are a running Moose with the ability to change gravity!",
        "instructions": "Tap the screen to change the gravity avoid obstacles and collect colorful balls Have fun ",
        "url": "https://html5.gamemonetize.com/hiq48wf5f9ipr8fqy50occmx136g9d5t/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Animal, Christmas, Jumping, Platform, run, running",
        "thumb": "https://img.gamemonetize.com/hiq48wf5f9ipr8fqy50occmx136g9d5t/512x384.jpg",
        "width": "420",
        "height": "240"
    },
    {
        "id": "50705",
        "title": "Climate Activist",
        "description": "Would you like to embark on an adventure in the art galleries? The to avoid guards and go near the arts and prepare little surprises for the visitors.",
        "instructions": "Move W A S D or ARROW KEYS Jump SPACE Sprint L-SHIFT Control Camera MOUSE",
        "url": "https://html5.gamemonetize.com/ulxe9ac0cqa6a9ajpyyzmpyiwotzitf3/",
        "category": "Hypercasual",
        "tags": "Action, Adventure, Brain, Casual, Coloring, Crazy, Decoration, Girl, Girls, Hypercasual, Skill, WebGL",
        "thumb": "https://img.gamemonetize.com/ulxe9ac0cqa6a9ajpyyzmpyiwotzitf3/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50655",
        "title": "Angry Plants",
        "description": "Fight for survival in this thrilling game. Place unique plants with different skills to fend off waves of zombies. Upgrade your vegetation and create an indestructible barrier. Can you keep your garden safe from the onslaught of the living dead?",
        "instructions": "Desktop Drag plants onto the field using a mouse or touchpad Mobile Use the touchscreen to place plants on the battlefield ",
        "url": "https://html5.gamemonetize.com/1rkuefl640zbdd4hnyq9jf4iyds2ny03/",
        "category": "Hypercasual",
        "tags": "Army, Battle, Casual, Defense, Fruits, Plant, Tower Defense, Zombie",
        "thumb": "https://img.gamemonetize.com/1rkuefl640zbdd4hnyq9jf4iyds2ny03/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50634",
        "title": "Zombie Escape: Horror Factory",
        "description": "Zombie Escape Horror Factory is an exciting survival game that immerses you in a zombie infested apocalyptic world. Your mission is to repair all the generators with your teammates, which when completed will open a door for you to escape this living nightmare. An immersive experience with tension and fear everywhere. Can you successfully complete the mission and escape?",
        "instructions": "WASD or slide to move",
        "url": "https://html5.gamemonetize.com/ifcdrnwla32frs6rgrw3ulbbgnip63qq/",
        "category": "Hypercasual",
        "tags": "3D, Avoid, Boy, Escape, Kids, Zombie",
        "thumb": "https://img.gamemonetize.com/ifcdrnwla32frs6rgrw3ulbbgnip63qq/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "50631",
        "title": "Eat Eat",
        "description": "Eat eat is a fun and addictive game where you have to put balls in the mouth of a spinning head. The eaten balls will reappear in the game. The more balls one eats, the higher the score will be. You can buy balls by paying for them with a bill, but the price of the ball increases. Try to complete all 40 levels and get the highest score!",
        "instructions": "Touch and hold to open the gates to make the balls falls at the right timing so the spinning head can eat them ",
        "url": "https://html5.gamemonetize.com/mfddadhfdmhut2j8yhy6xbfs6mqjig8h/",
        "category": "Hypercasual",
        "tags": "1 Player",
        "thumb": "https://img.gamemonetize.com/mfddadhfdmhut2j8yhy6xbfs6mqjig8h/512x384.jpg",
        "width": "1080",
        "height": "1520"
    },
    {
        "id": "50310",
        "title": "Black Hole vs Monster",
        "description": "Black Hole is ready for battle against big monsters. Gather your army with your black hole and fight against bosses. Dont forget to upgrade the hole to fight bigger and stronger monsters! Let the fight begin.",
        "instructions": "MOUSE",
        "url": "https://html5.gamemonetize.com/55askten4cbml9eqxif6lz1asjrbl77w/",
        "category": "Hypercasual",
        "tags": ".io Games, Battle, Collecting, Skibidi, Skibidi Toilet, War",
        "thumb": "https://img.gamemonetize.com/55askten4cbml9eqxif6lz1asjrbl77w/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50611",
        "title": "3D Desert Parkour",
        "description": "A super cute tower defense game, many people have been obsessed with it and cannot extricate themselves. Multiple levels can be challenged.",
        "instructions": "A super cute tower defense game many people have been obsessed with it and cannot extricate themselves Multiple levels can be challenged ",
        "url": "https://html5.gamemonetize.com/db0jzeruvp0lsimoh65qcmu1f6gnxrj7/",
        "category": "Hypercasual",
        "tags": "1 Player, 3D, Hypercasual",
        "thumb": "https://img.gamemonetize.com/db0jzeruvp0lsimoh65qcmu1f6gnxrj7/512x384.jpg",
        "width": "960",
        "height": "680"
    },
    {
        "id": "50560",
        "title": "Bananas Aminowanas",
        "description": "Classic Platform retro game. Jumpin monkey. Grab all the baneines XD. Cmon its just a simple game, i dont want to write all this",
        "instructions": "arrows keys",
        "url": "https://html5.gamemonetize.com/33cmaxcjpghlpsroascp4jqhd1uoioh7/",
        "category": "Hypercasual",
        "tags": "Action, Animal, Platform, Retro",
        "thumb": "https://img.gamemonetize.com/33cmaxcjpghlpsroascp4jqhd1uoioh7/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "50577",
        "title": "AVOIDER",
        "description": "A fun and challenging arcade game where you have to avoid falling objects, monsters and even lasers! Avoid the boxes and balls that fall on you from the left, right and right on you! Collect all the gems that will meet on your way. Do not forget that you can jump. Try to hold out as long as possible!",
        "instructions": "Desktop Press the left right keyboard arrow keys to move Press up arrow key to jump Mobile Use touch screen buttons ",
        "url": "https://html5.gamemonetize.com/uckme9zldquchem8mbi3u5djh06qjwdw/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Avoid, HTML5",
        "thumb": "https://img.gamemonetize.com/uckme9zldquchem8mbi3u5djh06qjwdw/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "44592",
        "title": "Avatoon Avatar Maker, Creator",
        "description": "Avatoon Avatar Maker is a dress up game. You are not bored and neither should your social media be. Cartoonize your social life and create cartoon faces. It is so exciting to express you and your life in a role play.",
        "instructions": "Tap or click",
        "url": "https://html5.gamemonetize.com/kd1eao4srjm42l6h4hcze6ivbtpyelh2/",
        "category": "Hypercasual",
        "tags": "Cartoon, Creation, Dress Up, Girls, Kids, Makeover",
        "thumb": "https://img.gamemonetize.com/kd1eao4srjm42l6h4hcze6ivbtpyelh2/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "50385",
        "title": "Kids Coloring Book Vip",
        "description": "Do you want to play a game with fun and quality time? This game is for you. This game is designed for all age groups to play comfortably. Complete all the missions and enjoy the fun!!!",
        "instructions": "Mouse click to play",
        "url": "https://html5.gamemonetize.com/u2l2gq0m1vsljpwah8zfo9a0rt2hqd0x/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Color, Coloring, Draw, Drawing, Kid, Kids",
        "thumb": "https://img.gamemonetize.com/u2l2gq0m1vsljpwah8zfo9a0rt2hqd0x/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "50450",
        "title": "Gun Runner Clone Game 3d",
        "description": "Discover a great variety of arsenal resources available in this stickman shooting game. Gather gold coins to make your stickman shooter undefeated. You can buy a gun, a machine gun, a shotgun, a sniper rifle or even a minigun! Each weapon can be improved. In addition, to protect your character from bullets, there are helmet and body armor available. Still not enough? In this stickman game, you have an opportunity to completely change the look of stickman by choosing one of the many skins for the shooter. Simple graphic stylistics and addicting gameplay, makes your shooter game experience light and extremely thrilled at the same time. What&rsquo;s m",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/f95ngkd85gsfqjcvk6cnowcyl3yuno0i/",
        "category": "Hypercasual",
        "tags": ".io Games, 3D Games, Arcade, Best Games, Casual, Games, Hypercasual, Mobile",
        "thumb": "https://img.gamemonetize.com/f95ngkd85gsfqjcvk6cnowcyl3yuno0i/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50399",
        "title": "Alien Jump",
        "description": "Jump around the space with a cute space monster through the galaxy! Collect coins, avoid obstacles and dont fall into the abyss! Get as far as you can! Challenge your friends and find out who is the space king!",
        "instructions": "Press the left side of the screen to move to left Press the right side of the screen to move to right Desktop arrow keyboard keys to move ",
        "url": "https://html5.gamemonetize.com/azjnib88w1wogc9rtwxil46y4pvubn80/",
        "category": "Hypercasual",
        "tags": "Alien, Arcade, Hypercasual, jump, Jumping, Space",
        "thumb": "https://img.gamemonetize.com/azjnib88w1wogc9rtwxil46y4pvubn80/512x384.jpg",
        "width": "900",
        "height": "1600"
    },
    {
        "id": "50418",
        "title": "BTC Farmer",
        "description": "BTC Farmer is an instant money idle clicker game that offers a virtual crypto mining experience. Earn money by upgrading to the fastest GPU and speeding up your hardware with new additions. Let your graphics card do the work and increase your speed to make even more money! With a simple interface thats easy to understand, this exciting game provides a virtual crypto mining experience thats perfect for beginners. Start playing online now and enjoy making cash with BTC Farmer !",
        "instructions": "Use the left mouse button to interact with the in-game UI ",
        "url": "https://html5.gamemonetize.com/panb25m5rm1u7nmlpb7jdhnxfjbu2euo/",
        "category": "Hypercasual",
        "tags": "Arcade, Casual, Click, Clicker, Hypercasual, Management, Miner",
        "thumb": "https://img.gamemonetize.com/panb25m5rm1u7nmlpb7jdhnxfjbu2euo/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "50085",
        "title": "NARUTOvsBLEACH",
        "description": "NARUTO vs BLEACH is a side-scrolling ACT anime fighting mobile game with smooth movements, highly recognizable character skills, and seamless combos, making combat more free. [Fast-paced fighting and striking feeling, operation is art]",
        "instructions": "By operating characters to release skills energy will be accumulated at the same time When the energy is full super powerful skills can be released ",
        "url": "https://html5.gamemonetize.com/lhr8ran85565q4gz8erow92mcym1txwx/",
        "category": "Hypercasual",
        "tags": "Adventure, Battle, Boxing, Hypercasual",
        "thumb": "https://img.gamemonetize.com/lhr8ran85565q4gz8erow92mcym1txwx/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "50279",
        "title": "Baby Doll Design ",
        "description": "Are you ready to conquer the fashion world? Play the fabulous dress up game LOL Surprise! OMG Fashion Club and become a style expert! Dive into the world of fashion games and let your creativity sparkle: collect clothes, put together unique outfits, and surprise yourself by doing every style makeover! So, are you ready to become a fashion stylist?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/x7tejyllb2svjmul228lbov2ewysid1h/",
        "category": "Hypercasual",
        "tags": "Dress Up, Girl, Girls, Kid, Kids, Makeover, unity",
        "thumb": "https://img.gamemonetize.com/x7tejyllb2svjmul228lbov2ewysid1h/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "45314",
        "title": "Idle GPU Mining Clicker",
        "description": "Idle GPU Mining Clicker is an instant money idle clicker game that offers a virtual crypto mining experience. Earn money by upgrading to the fastest GPU and speeding up your hardware with new additions. Let your graphics card do the work and increase your speed to make even more money! With a simple interface that is easy to understand, this exciting game provides a virtual crypto mining experience that is perfect for beginners. Start playing online now and enjoy making cash with Idle GPU Mining Clicker !",
        "instructions": "To play all you need to do is upgrade your GPU and let it do the hard work for you The faster your GPU the more money you will earn As you progress through the game you can unlock new additions and upgrade your hardware to make it even faster ",
        "url": "https://html5.gamemonetize.com/6tiofsuh3m6ug0qxjjg2cksiavd7t04o/",
        "category": "Hypercasual",
        "tags": "Casual, Clicker, Hypercasual, Miner",
        "thumb": "https://img.gamemonetize.com/6tiofsuh3m6ug0qxjjg2cksiavd7t04o/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49728",
        "title": "Zombie Base",
        "description": "Zombie Base is a design game with multiple levels waiting for you to challenge. You need to collect gold coins to enhance the strength of weapons and ammunition to pass the level.",
        "instructions": "Design the character by controlling the character with your finger mouse During the shooting process you can continuously avoid the attacks of monsters and kill all the monsters to pass the level ",
        "url": "https://html5.gamemonetize.com/8aboa18yi7mrhakas1xzjjamrg5vjqhh/",
        "category": "Hypercasual",
        "tags": "1 Player, Adventure, Battle, Hypercasual",
        "thumb": "https://img.gamemonetize.com/8aboa18yi7mrhakas1xzjjamrg5vjqhh/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "50305",
        "title": "15 Cat Games",
        "description": "This addicting collection offers 15 arcade mini-games, each with unique graphics and a different order of play, ensuring an ever-changing and captivating experience.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/vogk6uilzt8mua7gr4pmocyavttrmzck/",
        "category": "Hypercasual",
        "tags": "2D, Animal, Arcade, Casual, Cat, Collection, HTML5",
        "thumb": "https://img.gamemonetize.com/vogk6uilzt8mua7gr4pmocyavttrmzck/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47839",
        "title": "Feed The Fox",
        "description": "Feed the Fox is a fun game to play. In this game, the main character is a hungry fox who needs to eat to survive. Help the fox eat the little chicks that are coming down but be aware of the tiny bombs that are coming down with the chicks as well. To continue playing the game keep your eyes on the bombs. Use the arrows on the screen or the keyboard arrows to play the game if you are playing on your computer.",
        "instructions": "Control Desktop Use the right and left arrow keys of the keyboard to move characters left and right Click the right buttons of the mouse to jump characters Mobile Click on the screen to jump characters And swipe the screen to move left right Con",
        "url": "https://html5.gamemonetize.com/d44iecxtk09o1mjh1gib634fplng302q/",
        "category": "Hypercasual",
        "tags": "2D, Adventure, Animal, Classic, Game, Games, HTML, HTML5, Online",
        "thumb": "https://img.gamemonetize.com/d44iecxtk09o1mjh1gib634fplng302q/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "49838",
        "title": "Flip Ninja",
        "description": "A fun action/skill ninja game where you flip the gravity! Tap to flip the ninja! Avoid the projectiles and become a flip master! Accuracy is the main thing here.",
        "instructions": "Touch the screen to flip the Gravity Avoid the projectiles and catch the fruits to score Precision is the key ",
        "url": "https://html5.gamemonetize.com/fdlb9cy2cmn9g9c250r7tjc9eitrbkt4/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Action, Arcade, Jumping, Ninja",
        "thumb": "https://img.gamemonetize.com/fdlb9cy2cmn9g9c250r7tjc9eitrbkt4/512x384.jpg",
        "width": "693",
        "height": "1100"
    },
    {
        "id": "50199",
        "title": "Sonic Superstars",
        "description": "Adventure through the mystical Northstar Islands in this all-new take on classic 2D Sonic high-speed action platforming. Play as Sonic, Tails, Knuckles, and Amy Rose and harness all-new Emerald powers to move and attack in dynamic new ways. Collect Rings and unlock new characters in this fantastic new Sonic adventure.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/739l2hxbik0wdmhgepzsetiuzhbdv28r/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Adventure, Anime, Best Games, Cartoon Network, Casual, Dragon Ball Z, HTML5, Superhero",
        "thumb": "https://img.gamemonetize.com/739l2hxbik0wdmhgepzsetiuzhbdv28r/512x384.jpg",
        "width": "800",
        "height": "480"
    },
    {
        "id": "50171",
        "title": "Dodge the Creeps 2.0",
        "description": "This is a simple 2D arcade game. In this game your character must move and avoid the enemies for as long as possible. Escape from relentless waves of enemies with your own unique traits. Survive until level is cleared. then play the next level.",
        "instructions": " Use Up amp Down arrow keys or W amp S keys to move ",
        "url": "https://html5.gamemonetize.com/za09zzgoi7lmlc6kqc6ql07vjebxad8a/",
        "category": "Hypercasual",
        "tags": "2D, Arcade, Cool, Escape, Fun, Levels, survival, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/za09zzgoi7lmlc6kqc6ql07vjebxad8a/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50198",
        "title": "Moto Xtreme",
        "description": "The Moto Xtreme game is a very unique motorcycle simulation driving game. In the game, you act as a professional motorcyclist, increase your horsepower and throttle, complete various cool stunts, and challenge the impossible. Levels, thrilling extreme operations",
        "instructions": "Pass exciting and tense levels by continuously operating the motorcycles throttle and rotation direction ",
        "url": "https://html5.gamemonetize.com/n94ny6soglqxhxusj1afqemclv31u8yb/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Hypercasual, Physics",
        "thumb": "https://img.gamemonetize.com/n94ny6soglqxhxusj1afqemclv31u8yb/512x384.jpg",
        "width": "960",
        "height": "640"
    },
    {
        "id": "50160",
        "title": "Easy Coloring SantaClaus",
        "description": "Welcome to Easy Coloring SantaClaus, where creativity knows no bounds! This delightful coloring game is designed to spark the imagination of both kids and adults alike. Dive into a world of vibrant hues and endless possibilities as you choose from a selection of charming images, waiting for your artistic touch. Unleash your creativity and bring these images to life with your favorite colors. Easy Coloring SantaClaus offers the perfect canvas for your artistic expression. Website Developer <a href='https://www.video-igrice.com/'>https://www.video-igrice.com/</a>",
        "instructions": "Mouse to play ",
        "url": "https://html5.gamemonetize.com/r4orr8uwing2wff6oizj89pqoo70ix0u/",
        "category": "Hypercasual",
        "tags": "Christmas, Coloring, Drawing, Fun, HTML5, Kids, School, Winter",
        "thumb": "https://img.gamemonetize.com/r4orr8uwing2wff6oizj89pqoo70ix0u/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "50169",
        "title": "Angry Flappy Birds",
        "description": "Prepare for a thrilling twist on the classic bird-shooting game with Angry Flappy Birds. In this game, youre not just launching birds; youre taking them on an adrenaline-pumping journey through challenging pipes.",
        "instructions": "Launch the Birds Use your slingshot to launch the birds and start their flight Control Altitude Tap the screen to make the birds ascend and release to let them descend Navigate the Pipes Guide your birds through a series of pipes similar to the clas",
        "url": "https://html5.gamemonetize.com/e3j9hj33rwpnmwbowhmvvj41ta0768zd/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Arcade, Bird, fly, Pixel",
        "thumb": "https://img.gamemonetize.com/e3j9hj33rwpnmwbowhmvvj41ta0768zd/512x384.jpg",
        "width": "480",
        "height": "320"
    },
    {
        "id": "50123",
        "title": "Dual",
        "description": "Your survival depends on the defiance of the two orbs (vessels) - they are synchronistic devices, a dance and song between two entities bound together in symbiosis. The rules are simple: control the two balls in sync, survive no matter what, and stay calm.",
        "instructions": "Touch the right side of the screen to turn right and the left side of the screen to turn left for the phone You can also use the right and left keys on the keyboard for the desktop ",
        "url": "https://html5.gamemonetize.com/eqt9d3h53pycptru67tn9nxfho46a4gd/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Arcade, Highscore, Hypercasual, Skill",
        "thumb": "https://img.gamemonetize.com/eqt9d3h53pycptru67tn9nxfho46a4gd/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "50087",
        "title": "Texas Holdem",
        "description": "Texas Hold&rsquo;em poker is a player-versus-player public card game. Usually 2-6 people participate. Texas holdem poker has a total of 52 cards, and there is no trump card. Each player gets five cards and compares them to determine the winner.",
        "instructions": "From big to small they are Big King Little King 2 A K Q J 10 9 8 7 6 5 4 3 The size of the card type single straight pair The card types of Zi Connected Pair Three Cards and Three Cards in a Row",
        "url": "https://html5.gamemonetize.com/28my3vo6nu726qub2mbdfj2hau7ebr2u/",
        "category": "Hypercasual",
        "tags": ".io, 2D",
        "thumb": "https://img.gamemonetize.com/28my3vo6nu726qub2mbdfj2hau7ebr2u/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49720",
        "title": "Hole and Collect",
        "description": "Try to collect all the objects in the area with the cute black hole before the time runs out! Group them and destroy them with smart moves. You can buy new black holes with the money you earn.",
        "instructions": "WASD or ARROW KEYS",
        "url": "https://html5.gamemonetize.com/j005mth1swnpqsqo4bb0xcq3znf2zgkt/",
        "category": "Hypercasual",
        "tags": "Collecting, Fun, Funny",
        "thumb": "https://img.gamemonetize.com/j005mth1swnpqsqo4bb0xcq3znf2zgkt/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "49768",
        "title": "Doggy Save",
        "description": "Doggy Save is an original puzzle-solving casual game. It has a large number of brain-burning levels, and in each level, there is a puppy waiting for you to save. The rich creativity and interesting puzzle questions may break common sense and bring you something new.",
        "instructions": "In Doge Bottle you can pass the level by drawing lines to prevent bees from touching the dog Once the bees touch the dog the dog will be hurt ",
        "url": "https://html5.gamemonetize.com/yuftzb5q9g4f9vwuygb6qxxv6y3pdzon/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Hypercasual, Physics",
        "thumb": "https://img.gamemonetize.com/yuftzb5q9g4f9vwuygb6qxxv6y3pdzon/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "49739",
        "title": "Sharpshooter",
        "description": "Sharpshooter is a casual puzzle game with bullet reflection as its core gameplay. There are multiple scenes in the game, including deserts, bars, bridges, castles, etc. In these scenes, the gun master needs to use his skilled marksmanship to target the enemy and kill him with one blow.",
        "instructions": "Sharpshooter can use the bounce of the wall to change the shooting route during the game and eliminate all enemies on the map to complete the level ",
        "url": "https://html5.gamemonetize.com/rgu9vnxk1hk7svzfd7bpnil3ky8ro5o9/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Hypercasual",
        "thumb": "https://img.gamemonetize.com/rgu9vnxk1hk7svzfd7bpnil3ky8ro5o9/512x384.jpg",
        "width": "640",
        "height": "1386"
    },
    {
        "id": "49963",
        "title": "Metal Driller",
        "description": "Metal Driller is a casual mining adventure where you control the characters ragdoll physics-powered drill and delve deep into the mines, unlocking new levels and upgrades. Customize your gameplay with a unique skill tree that resets after each chapter. Collect cool Drill costumes as you progress and deck out your character and their drill companions in various outfits.",
        "instructions": "Use the WASD arrow keys the left mouse button to control the character ",
        "url": "https://html5.gamemonetize.com/lwdb15lgg945ik6qzdnfklr6j5b6ou4h/",
        "category": "Hypercasual",
        "tags": "3D, 3D Games, Arcade, Casual, Hypercasual, Mine, Miner, Unity3D",
        "thumb": "https://img.gamemonetize.com/lwdb15lgg945ik6qzdnfklr6j5b6ou4h/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49781",
        "title": "Hammer Crush",
        "description": "Hammer Crush is the latest sensation, revolving around aligning elements to target the rock monster with your hammer. Its simplicity belies its profound depth. Embark on an expansive journey, honing your intellect while enjoying the gameplay across various challenging levels. Website dev <a href='https://www.kizi10.org/'>https://www.kizi10.org/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/etfc131f7txwzcvhz4zpih7qk09fg1aa/",
        "category": "Hypercasual",
        "tags": "1 Player, Android, HTML5, Hypercasual, iPad, iPhone, Kids, Mentolatux, Mobile, Puzzle, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/etfc131f7txwzcvhz4zpih7qk09fg1aa/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49799",
        "title": "Trash Factory",
        "description": "Help the trash pandas take out the garbage! - Sort trash into the correct containers - Tap the switchers to change the direction of the trash path - Level up by filling trash containers - Keep the manager happy by correctly sorting trash",
        "instructions": "- Sort trash into the correct containers - Tap the switchers to change the direction of the trash path - Level up by filling trash containers - Keep the manager happy by correctly sorting trash",
        "url": "https://html5.gamemonetize.com/ba0d6haabctafqjo153z9j2onrh9rg0g/",
        "category": "Hypercasual",
        "tags": "2D, Arcade, Cartoon, Casual, Color, Cute, Hypercasual, Mobile, Pixel, Retro, Timing, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/ba0d6haabctafqjo153z9j2onrh9rg0g/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49604",
        "title": "Skibidi Hero.IO",
        "description": "Skidibi Hero: IO is an action game where you have to survive countless waves of monsters. Control your hero to move around, collecting all of the points from defeating enemies to leveling up. You will have 3 choices to upgrade your power so choose wisely to survive till the end of the game",
        "instructions": "- Use you joystick in sence - Smooth Graphics - Awesome hero",
        "url": "https://html5.gamemonetize.com/4ks356oenpbqv9qz7artzrsz828nlh2b/",
        "category": "Hypercasual",
        "tags": ".io, Arcade, Battlegrounds, Fun, Gun, Skibidi Toilet, survival",
        "thumb": "https://img.gamemonetize.com/4ks356oenpbqv9qz7artzrsz828nlh2b/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "48729",
        "title": "Runner Master 3d",
        "description": "its simple game count on skills and brain you need to collect the diamonds to be able to pass the levels every level become more harder and need more brain use with skill",
        "instructions": "WASD Move move mouse Space jump R to restart the level ",
        "url": "https://html5.gamemonetize.com/fgfe63omqjse80dgi10xl8fm006cpmhz/",
        "category": "Hypercasual",
        "tags": "3D, Action, Brain, jump, Jumping, Puzzle, running, Skill",
        "thumb": "https://img.gamemonetize.com/fgfe63omqjse80dgi10xl8fm006cpmhz/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48989",
        "title": "Meteor.io",
        "description": "Collect the shards, dodge the meteorite! A simple and addictive casual game that will test your reaction and agility. Become the best shard collector and show how far you can reach without getting hit by a barrage of meteorites!",
        "instructions": "Control with joystick wasd spacebar Collect shards dodging meteorites flying at you Watch the time bar ",
        "url": "https://html5.gamemonetize.com/ou78d7yjy1fvg9ww5qd9228mjzyctdlh/",
        "category": "Hypercasual",
        "tags": ".io, 1 Player, Android, Best",
        "thumb": "https://img.gamemonetize.com/ou78d7yjy1fvg9ww5qd9228mjzyctdlh/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "49800",
        "title": "Sushi Supply Co",
        "description": "Build a sushi empire with Kitty Chef! - Tap on chefs to speed up the making of sushi. - Upgrade your chefs &amp; warehouse to increase your income.",
        "instructions": "- Tap on chefs to speed up the making of sushi - Upgrade your chefs amp warehouse to increase your income ",
        "url": "https://html5.gamemonetize.com/1o7ojdx0qdsl7gz3jpywu31qnxlffuuk/",
        "category": "Hypercasual",
        "tags": "2D, Animal, Anime, Business, Cartoon, Casual, Cute, Hypercasual, Management",
        "thumb": "https://img.gamemonetize.com/1o7ojdx0qdsl7gz3jpywu31qnxlffuuk/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49891",
        "title": "Scary Joker: Haunted Dorm",
        "description": "Scary Joker: Haunted Dorm is a 3D tower defense game. In the game, when players enter a room, they can build economies and defenses in their own room to prevent the butcher from entering. Of course, you can also play the role of a butcher and catch people. Horrifying atmosphere, exciting experience! How long can you hold?",
        "instructions": "Slide to move",
        "url": "https://html5.gamemonetize.com/2vi3x6zi4s0f3t26mq6spzu3jbxv4hca/",
        "category": "Hypercasual",
        "tags": "3D, 3D Games, Android, Avoid, Defense, HTML5, Kids, Tower Defense",
        "thumb": "https://img.gamemonetize.com/2vi3x6zi4s0f3t26mq6spzu3jbxv4hca/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "49853",
        "title": "Long Hand Escape",
        "description": "Long Hand Escape is a fun puzzle game. Use your brain and your long, flexible hands to steal treasures. Solve riddles in the best escape games and thief puzzle games with levels and train your brain with IQ testing skills. Are you ready?",
        "instructions": "Slide to control",
        "url": "https://html5.gamemonetize.com/mdnj18dj5j96sy66ralvwlqhyvpx1s07/",
        "category": "Hypercasual",
        "tags": "3D, Avoid, Brain, Escape, Funny, HTML5, Kids, Strategy",
        "thumb": "https://img.gamemonetize.com/mdnj18dj5j96sy66ralvwlqhyvpx1s07/512x384.jpg",
        "width": "576",
        "height": "1024"
    },
    {
        "id": "49895",
        "title": "15 Halloween Games",
        "description": "This addicting Halloween game offers 15 thrilling mini-games, each with unique graphics and a different order of play, ensuring an ever-changing and captivating experience.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/jhdl0xjniv94773raf8c5g9sc698r1xe/",
        "category": "Hypercasual",
        "tags": "2D, Arcade, Casual, Collection, Halloween, Hypercasual, Match 3, Monster, Puzzle, Zombie",
        "thumb": "https://img.gamemonetize.com/jhdl0xjniv94773raf8c5g9sc698r1xe/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49771",
        "title": "Doge Bottle",
        "description": "Doge Bottle is an original puzzle-solving casual game. It has a large number of brain-burning levels, and in each level, there is a puppy waiting for you to save. The rich creativity and interesting puzzle questions may break common sense and bring you something new.",
        "instructions": "Doge Bottle Collect all the puzzle icons in the glass by sorting them properly Once it overflows it is a failure ",
        "url": "https://html5.gamemonetize.com/j5x20vs1j80yti34pjl6a5ae9bzn7z0z/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Hypercasual",
        "thumb": "https://img.gamemonetize.com/j5x20vs1j80yti34pjl6a5ae9bzn7z0z/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "49750",
        "title": "Deadflip Challenge 2024",
        "description": "A laid-back puzzle game that challenges you to land securely, its straightforward on the surface but surprisingly intricate in its depth. Navigate through a wide array of levels, engaging your intellect while thoroughly enjoying the experience. Website Developer <a href='https://www.bestcrazygames.com/'>https://www.bestcrazygames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/2hilma3vnj9ky6bgbsvyhximwpku2juq/",
        "category": "Hypercasual",
        "tags": "Android, HTML5, Hypercasual, iPad, iPhone, Mentolatux, Mobile",
        "thumb": "https://img.gamemonetize.com/2hilma3vnj9ky6bgbsvyhximwpku2juq/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49686",
        "title": "City Heroes Jump",
        "description": "In City Heroes Jump, adventure takes a sky-high leap into exhilarating fun! Set against a bustling urban landscape backdrop, this game offers more than just an ordinary trampoline park experience. Imagine soaring through the air like a superhero, bouncing from one trampoline to another as you complete daring missions and avoid obstacles. Website Developer <a href='https://www.brightestgames.com/'>https://www.brightestgames.com/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/1ondzf11yxw8a0lk8yhkfofs00vl5lwv/",
        "category": "Hypercasual",
        "tags": "Android, Click, HTML5, Hypercasual, iPad, iPhone, Mentolatux, Mobile",
        "thumb": "https://img.gamemonetize.com/1ondzf11yxw8a0lk8yhkfofs00vl5lwv/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49820",
        "title": "Pumpkinoide",
        "description": "Pumpkinoid is a simple one touch arcade game that is a little like break out and a little like pinball. There are three medals to be achieved based on score and there are three new paddles that can be unlocked also based on score. There are seven backgrounds will be picked each time you play. Enjoy with Pumpkinoid!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/yegs9nxern3dqcc2cimi97cxp5rq402n/",
        "category": "Hypercasual",
        "tags": "Arcade, Arkanoid, Ball, Bricks, HTML",
        "thumb": "https://img.gamemonetize.com/yegs9nxern3dqcc2cimi97cxp5rq402n/512x384.jpg",
        "width": "600",
        "height": "1024"
    },
    {
        "id": "49780",
        "title": "Crunch Lock",
        "description": "In this enthralling journey, numerous wrenches come together to orchestrate a complex and synchronized performance alongside numerous screws. This task calls for agile coordination and clever sequencing. Step into the shoes of the unscrewing virtuoso, injecting each phase with an unparalleled finesse as you navigate through a succession of adrenaline-pumping trials. Website Developer <a href='https://www.crazygamesonline.com'>https://www.crazygamesonline.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/9gwp2yv4dtnrpt88k3t5zvndlp9y0emo/",
        "category": "Hypercasual",
        "tags": "Android, Click, HTML5, Hypercasual, iPad, iPhone, Mentolatux, Mobile, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/9gwp2yv4dtnrpt88k3t5zvndlp9y0emo/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49740",
        "title": "Halloween Monster Traffic",
        "description": "Halloween is coming! The little monsters are ready to work! But the roads are full of cars! Can you help them find the right way? Tap the screen at the right time, and help them cross the road! Enjoy various fun obstacles and levels! What are you waiting for? Try this game! Have a spooky and happy Halloween! Have fun!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/9amxzsogy7tyk9v2ks1zby6kf4t8jai9/",
        "category": "Hypercasual",
        "tags": "Boys, Car, Casual, Girl, Halloween, Kids, Monster",
        "thumb": "https://img.gamemonetize.com/9amxzsogy7tyk9v2ks1zby6kf4t8jai9/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "49783",
        "title": "Garten of Rainbow Monsters Unblocked",
        "description": "Welcome to the enchanting world of Garten of Rainbow Monsters Unblocked! This captivating adventure game invites you to delve into the eerie wonders of a haunted kindergarten. Brace yourself as you encounter and engage in thrilling battles against mischievous bam monsters. Embark on this magical journey today! Website Developer <a href='https://www.kizi10.org'>https://www.kizi10.org</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/0h6t8bch7enfhrg2z9ikfp886p1ti4l2/",
        "category": "Hypercasual",
        "tags": "Android, HTML5, Hypercasual, iPad, iPhone, Mentolatux, Mobile, Monster, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/0h6t8bch7enfhrg2z9ikfp886p1ti4l2/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49711",
        "title": "Arkanoid Bricks",
        "description": "Arkanoid Bricks is a game in which you need to destroy various platforms with their unique characteristics with the help of a ball, you will also meet various skills that will help you do this, such as lasers, fireball, giant ball, cannon, etc..",
        "instructions": "Click and hold the mouse or touch to move the paddle from side to side Always keep the ball in play Unlock new power ups by breaking the blocks that contain them ",
        "url": "https://html5.gamemonetize.com/noc0ensjwnnu79p8ak0uqyut45b4v9dz/",
        "category": "Hypercasual",
        "tags": "Arkanoid, Ball, Best, Best Games, Bricks, Fun, HTML5, Kids, Mobile, Skill",
        "thumb": "https://img.gamemonetize.com/noc0ensjwnnu79p8ak0uqyut45b4v9dz/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "49794",
        "title": "Tap Pumpkin",
        "description": "Tap Pumpkin is an addictive arcade game that will test your reactions and accuracy. In this simple but addictive game, your goal is to tap the screen to make the pumpkin jump and avoid moving obstacles. The game may seem simple at first glance, but progress is far from easy. With each level, the difficulty increases and you will need instant reaction and accuracy.",
        "instructions": "Tap the Screen Just tap anywhere on the screen to make the pumpkin jump Avoid Obstacles Choose your jumping moments carefully to help your pumpkin avoid moving obstacles Achieve Maximum Score See how far you can go and aim to break your own record ",
        "url": "https://html5.gamemonetize.com/l77ysroukeulkn9owg4iqojdeaiztqgb/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Arcade, Halloween, Hypercasual, Jumping",
        "thumb": "https://img.gamemonetize.com/l77ysroukeulkn9owg4iqojdeaiztqgb/512x384.jpg",
        "width": "320",
        "height": "480"
    },
    {
        "id": "49766",
        "title": "Turtle Hero Animal Rescue",
        "description": "Join the fun and adventure in Turtle Hero Animal Rescue, a thrilling game with cute 2D cartoon animals. You have to collect yellow stars and reach the finish line in each level. The game tests your flexibility and precision as you navigate through various obstacles. The more stars you get, the more hearts you can buy to enhance your gameplay. Turtle Hero Animal Rescue is a game that will keep you entertained for hours.",
        "instructions": "W jump S move down from the current platform ",
        "url": "https://html5.gamemonetize.com/0d020vrh23kp6y05gn2h3pvrkgbzlh7t/",
        "category": "Hypercasual",
        "tags": "2D, Animal, Avoid, Boys, Collecting, Kids, Rescue, Superhero",
        "thumb": "https://img.gamemonetize.com/0d020vrh23kp6y05gn2h3pvrkgbzlh7t/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "49656",
        "title": "Bus Collect HTML5",
        "description": "An easygoing brain-teaser where your goal is to land all passengers safely. Though it seems straightforward, it offers a surprising level of depth. Enjoy a wide range of levels while honing your problem-solving skills. Website Developer <a href='https://www.game-plays.com'>https://www.game-plays.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/mnl5ha2dyssilu9pa803w59ss4xknh7t/",
        "category": "Hypercasual",
        "tags": "Android, Click, HTML5, iPad, iPhone, Mentolatux, Mobile, Spaceship, vehicle, WebGL",
        "thumb": "https://img.gamemonetize.com/mnl5ha2dyssilu9pa803w59ss4xknh7t/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49737",
        "title": "SpobgeBob Halloween Coloring Book",
        "description": "Dive into SpobgeBob Halloween Coloring Book! Express your creativity with SpobgeBob Halloween Coloring Book, a delightful and free online coloring game for all ages! Embark on a colorful adventure where you can bring your favorite SpobgeBob characters to life with just a tap of your finger. This game offers endless artistic possibilities and a chance to showcase your coloring skills in the spirit of Halloween.",
        "instructions": "Mouse to play ",
        "url": "https://html5.gamemonetize.com/8vtkqr5xztqk5g2mtrkszlp741l1cwid/",
        "category": "Hypercasual",
        "tags": "Arcade, Casual, Coloring, Halloween, Kids, Spongebob",
        "thumb": "https://img.gamemonetize.com/8vtkqr5xztqk5g2mtrkszlp741l1cwid/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "49527",
        "title": "Skibidi Toilet MakeOver Playtime",
        "description": "Welcome to your unique universe of toilet creatures, filled with the oddest, most amusing, and one-of-a-kind bathroom monsters! Youll have the opportunity to customize every aspect of your toilet monsters appearance. Aim for perfection, as your creation will be showcased on a leaderboard and scrutinized by a highly discerning audience. Prepare to unleash your creative flair and stay tuned for the grand finale: a trending monster dance. Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ttoj989jdso0idjzp54ycu5kaookuk2c/",
        "category": "Hypercasual",
        "tags": "2D, Android, HTML5, Hypercasual, iPad, iPhone, Mentolatux, Mobile, Puzzle, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/ttoj989jdso0idjzp54ycu5kaookuk2c/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49679",
        "title": "Building Empire Tycoon",
        "description": "Building Empire Tycoon is a flexible city simulator time management game that engages the player with its simple and addictive mechanics. This provides 3 modes to play including Time-Trial, Endless and Career, each bringing different missions and game play. Building Empire Tycoon is a game about buying and selling building for profit. Buy houses when their prices are at rock bottom, then sell them at their peak before the price crashes. Get rich in record time through virtual Building Empire speculations .",
        "instructions": "Building Empire Tycoon is a game about buying and selling building for profit Buy houses when their prices are at rock bottom then sell them at their peak before the price crashes Get rich in record time through virtual Building Empire speculations Mo",
        "url": "https://html5.gamemonetize.com/413fyel12hcjjicekxbtkf0mqrfggsi2/",
        "category": "Hypercasual",
        "tags": "Casual, Hypercasual, Management, Simulation",
        "thumb": "https://img.gamemonetize.com/413fyel12hcjjicekxbtkf0mqrfggsi2/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "49525",
        "title": "Candy Monster Box",
        "description": "Candy Monster Box offers an engaging, captivating gameplay experience that ensures endless entertainment. Slide right or left to align the box with the candies. Share this complimentary game with your loved ones. Embark on an adventure in the candy universe. Assist the jelly monsters by unwrapping and gathering fruity candies for them.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/8y2socljhxgwy1wh0lk2d38gntaki4d8/",
        "category": "Hypercasual",
        "tags": "2D, Android, HTML5, Hypercasual, iPad, iPhone, Mentolatux, Mobile, Monster, Puzzle",
        "thumb": "https://img.gamemonetize.com/8y2socljhxgwy1wh0lk2d38gntaki4d8/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46732",
        "title": "Magic Land",
        "description": "Magic Land is an endless game where you have to play a role of a wizard where you have to collect pumpkins while avoiding all the obstacles. As you collect pumpkins your score will increase. If you collide with the obstacle you will fall from the rope.",
        "instructions": "Control Desktop Click the left button of the mouse to move the characters Mobile Tap on the screen to move the characters Controls and Indicators The scores are shown in the upper middle of the screen ",
        "url": "https://html5.gamemonetize.com/3h3k7ccu8mv7x40urmavk2ekrka8m0td/",
        "category": "Hypercasual",
        "tags": "Adventure, Brain, HTML, HTML5, Online",
        "thumb": "https://img.gamemonetize.com/3h3k7ccu8mv7x40urmavk2ekrka8m0td/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49620",
        "title": "Pumpkin Smash",
        "description": "Pumpkin Smash is a delightful and addictive game that captures the essence of the fall season, offering players a fun and visually appealing experience filled with pumpkin-related adventures. Whether youre a fan of casual games or simply looking for some autumn-themed entertainment, Pumpkin Madness is the perfect way to celebrate the season.",
        "instructions": "WASD or Arrow keys - gt Move the Player Space - gt Jump Mouse Move - gt Direction of the weapon Left mouse click - gt Attack",
        "url": "https://html5.gamemonetize.com/885k33tjwfqv1ak1sk13xme863r2r9rk/",
        "category": "Hypercasual",
        "tags": "Adventure, Arcade, Casual, Halloween, hunter, Hypercasual",
        "thumb": "https://img.gamemonetize.com/885k33tjwfqv1ak1sk13xme863r2r9rk/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "49528",
        "title": "Flappy Halloween2",
        "description": "Flappy Halloween is a fun and addictive game that captures the spirit of Halloween while challenging players to test their reflexes and coordination. Its a perfect choice for enjoying some Halloween-themed entertainment on your computer during the spooky season.",
        "instructions": "Click to make your pumpkin fly The game is endless and the objective is to see how far you can go without colliding with any obstacles ",
        "url": "https://html5.gamemonetize.com/6w366mgxfl4oz9p0pg4bpntks97bn8ze/",
        "category": "Hypercasual",
        "tags": "Casual, Halloween, Hypercasual, Skill, Skills",
        "thumb": "https://img.gamemonetize.com/6w366mgxfl4oz9p0pg4bpntks97bn8ze/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "49500",
        "title": "Super Ball Collect HTML5",
        "description": "An easygoing brain-teaser where your mission is to land all the passengers safely. It appears straightforward but offers surprising depth. Enjoy a wide range of levels while honing your mental agility and having a great time. Website Developer <a href='https://www.crazygamesonline.com'>https://www.crazygamesonline.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/nn8ess1wgmxuksnfqh0yd6l6jhc5s573/",
        "category": "Hypercasual",
        "tags": "Android, Arcade, Clicker, HTML5, Hypercasual, iPad, iPhone, Mentolatux, Mobile",
        "thumb": "https://img.gamemonetize.com/nn8ess1wgmxuksnfqh0yd6l6jhc5s573/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49504",
        "title": "Grimace Shake Slide",
        "description": "Welcome to Grimace Shake Slide! Tap and slide light and right or hold mouse click to control the paddle. Dont Let the grimace creatures fall into the purple lava. Send all grimaces to the tubes to make them fall into the juicy pool. Can you get the highest score?",
        "instructions": "Slide left and right or mouse click",
        "url": "https://html5.gamemonetize.com/1a8pz1adof4au8o5up62cj94urkvpehd/",
        "category": "Hypercasual",
        "tags": "Grimace, Grimace Shake",
        "thumb": "https://img.gamemonetize.com/1a8pz1adof4au8o5up62cj94urkvpehd/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "49445",
        "title": "Candy Match Sagas 2",
        "description": "Enjoy the adventure in the magic world of Candy Match Sagas 2. Immerse yourself in an exciting Match 3 game Secuel with many levels and excellent graphics. Help the little Witch to solve all the Match 3 puzzles and escape from the magic world using your skills, and amazing power-ups to complete the levels. Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "Use the mouse or Touch to match the blocks",
        "url": "https://html5.gamemonetize.com/o2bv4nu33660pv8v0zgh4u1zzw6eylge/",
        "category": "Hypercasual",
        "tags": "Arcade, Bejeweled, Best Games, Candy, Casual, Farm, Google, HTML5, kiz10, Match-3, Witch",
        "thumb": "https://img.gamemonetize.com/o2bv4nu33660pv8v0zgh4u1zzw6eylge/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "49121",
        "title": "Grimace Hop",
        "description": "Dive into the thrilling world of Grimace Hop and experience the adrenaline rush of head-to-head matchups. With its simple yet addictive gameplay, this game is designed to keep you entertained for hours on end. Show off your jumping skills, strategic thinking, and lightning-fast reflexes as you aim to be the first to reach five points.",
        "instructions": "Hold the Left Mouse Button and release to Jump High ",
        "url": "https://html5.gamemonetize.com/gsp3b58pcb0xikp5b4toch5p5y29itva/",
        "category": "Hypercasual",
        "tags": "1 Player, 3D, Block, Fun",
        "thumb": "https://img.gamemonetize.com/gsp3b58pcb0xikp5b4toch5p5y29itva/512x384.jpg",
        "width": "400",
        "height": "600"
    },
    {
        "id": "49080",
        "title": "Robot Rush",
        "description": "Robot Rush is a challenging and fast paced action shooter. Destroy all robots on the screen and get the highest score possible to advance to the next level.",
        "instructions": "Mouse click or tap to play Click on enemies to shoot them but dont let them get to you ",
        "url": "https://html5.gamemonetize.com/zm8x6cy2fiw7fehhgt36qnnylo7bgkot/",
        "category": "Hypercasual",
        "tags": "Battlegrounds, Casual, Hypercasual, Robot, Shoot, Shooter, Shooting",
        "thumb": "https://img.gamemonetize.com/zm8x6cy2fiw7fehhgt36qnnylo7bgkot/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49306",
        "title": "Meme Piggy: Adventure",
        "description": "Meme Pig rushing to the aid of Princess Pig! Overcome all difficulties and save your princess. The game is an adventure where we play as a pig. This is a fun platformer that will make you laugh with its meme-like animations and sounds. Overcome obstacles, collect stars, and you will become a top player!",
        "instructions": "Personal Computer Movement - WASD Jump - Space Double Jump - Space x2 Pause - ESC Phone Tablet Use interface buttons ",
        "url": "https://html5.gamemonetize.com/zpyfekps1wjxkojv2n53cfmonxcyji9p/",
        "category": "Hypercasual",
        "tags": "Animal, Arcade, Best Games, Fun, Funny, Platform",
        "thumb": "https://img.gamemonetize.com/zpyfekps1wjxkojv2n53cfmonxcyji9p/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47711",
        "title": "Road Madness",
        "description": "If you like race cars and guns, you will love this game! You can upgrade and unlock more destructive cars, the further you get. Enjoy epic effects and power ups while hunting the new bosses and get achievements for it!",
        "instructions": "Shoot enemy cars and upgrade your gear to survive in higher levels Avoid obstacles and gather power ups from destroyed special enemies Defeat bosses at the end of levels to progress further ",
        "url": "https://html5.gamemonetize.com/pcfjrvn3isqukyuyf6i3gffax8kvibgr/",
        "category": "Hypercasual",
        "tags": "Driving, HTML, HTML5",
        "thumb": "https://img.gamemonetize.com/pcfjrvn3isqukyuyf6i3gffax8kvibgr/512x384.jpg",
        "width": "600",
        "height": "800"
    },
    {
        "id": "48943",
        "title": "Among Us Collect Coin",
        "description": "Among Us Collect Coin is an exhilarating and addicting endless running game. Players will take control of an adorable crewmate character and embark on an adventure through an endless course. The mission is simple: collect the gold coins and achieve the highest score. However, remember that youll encounter various obstacles along the course, requiring quick reflexes and agility to overcome. Are You Ready for Endless Fun with Among Us Collect Coin by ripogame.com?",
        "instructions": "Tap left and right of the screen or Left Arrow Right Arrow or A D keys",
        "url": "https://html5.gamemonetize.com/gi3iqiw7xgmuew74mputakin7sr40s8q/",
        "category": "Hypercasual",
        "tags": "3D Games, Collecting, Mobile, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/gi3iqiw7xgmuew74mputakin7sr40s8q/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "49128",
        "title": "Toca Life Adventure",
        "description": "Run out any story with Toca Life adventure. You&rsquo;ll get all the fun of your other favorite levels such as City, Vacation, Office, Hospital, and more, all together in one place. Collect balls to increase the score and unlock new characters.Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "Use the mouse or touch",
        "url": "https://html5.gamemonetize.com/wl12iuserxdpc4y0b8vcjoz6alzccms5/",
        "category": "Hypercasual",
        "tags": "1 Player, 2 Player, 2D, Adventure, Arcade, Best Games, Cartoon, endless, Family, Fantasy, Hypercasual",
        "thumb": "https://img.gamemonetize.com/wl12iuserxdpc4y0b8vcjoz6alzccms5/512x384.jpg",
        "width": "800",
        "height": "480"
    },
    {
        "id": "46429",
        "title": "Sliding Tim: Way to home",
        "description": "Adventure game based on completing a difficult path. You play as the hero Tim. He was far from home and he needed help to run back. But the path ahead is not easy, along the way you have to overcome many different obstacles, you will need to go through mud, desert and even red-hot lava. It is important to keep the pace, to slip somewhere, and to slow down in time. At first glance, a simple task can turn into a failure, because with each new step, unpredictable routes await you.",
        "instructions": "Press the spacebar to make the player start running and release when needed to stop the player from running You can also use the LMB instead of the space bar ",
        "url": "https://html5.gamemonetize.com/84rvpxnkansrlfh9i0h2yewafwk684lt/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Hypercasual, Obstacle, running",
        "thumb": "https://img.gamemonetize.com/84rvpxnkansrlfh9i0h2yewafwk684lt/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "46697",
        "title": "Cube Adventure Run",
        "description": "Try to pass over the blocks! 9 different cubes! Cube Adventure Run is a fun casual game.",
        "instructions": "Use A and D or Left and Right Arrow Key to move the character Use the Left Mouse Button Click to Move and collect the cubes ",
        "url": "https://html5.gamemonetize.com/dec1iei9ohuvd7fm4njkm7tkugsydmb2/",
        "category": "Hypercasual",
        "tags": "1 Player, 3D, Arcade, Block, Fun",
        "thumb": "https://img.gamemonetize.com/dec1iei9ohuvd7fm4njkm7tkugsydmb2/512x384.jpg",
        "width": "400",
        "height": "600"
    },
    {
        "id": "46944",
        "title": "Dinosaur Endless",
        "description": "Dinosaur is a new endless game you must to jump via spikes but not touch the spikes every level have difrent dificulty and difrent speed on circle the circle is rotate and you must jump jump Dinosaur is a new endless game you must to jump via spikes but not touch the spikes every level have difrent dificulty and difrent speed on circle the circle is rotate and you must jump jump Dinosaur is a new endless game you must to jump via spikes but not touch the spikes every level have difrent dificulty and difrent speed on circle the circle is rotate and you must jump jump Dinosaur is a new endless game you must to jump via spikes but not touch t",
        "instructions": "You use Mouse to click or touch if you use android",
        "url": "https://html5.gamemonetize.com/8u80akhgtad4i3bevcp0mg62bjv5ef3c/",
        "category": "Hypercasual",
        "tags": "1 Player",
        "thumb": "https://img.gamemonetize.com/8u80akhgtad4i3bevcp0mg62bjv5ef3c/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46242",
        "title": "Dirty Seven",
        "description": "Dirty Seven is a shedding-type card game for 2 players. The objective of the game is to be the first player to discard all the cards in your hand. At the beginning the two players are dealt 7 cards each. The players can see their own cards. One card is dealt face-up onto the waste pile. Remaining cards are set aside forming a stock pile. In each turn player is supposed to discard one or more cards. If player has no matching card to throw, he/she must pick a card from the stock pile. Player can discard a card only if it matches either the rank or the suit of the top card in the waste pile.",
        "instructions": "To draw a card from the stock pile click the top card once To discard your card to the waste pile either drag and drop the card on top of the pile or simply click the card ",
        "url": "https://html5.gamemonetize.com/w3452owuwcny67ylbc19r0xfk00zvqzt/",
        "category": "Hypercasual",
        "tags": "2 Player, 2D, Card, Casual, Classic, HTML5, Hypercasual, Strategy",
        "thumb": "https://img.gamemonetize.com/w3452owuwcny67ylbc19r0xfk00zvqzt/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47523",
        "title": "The Mando",
        "description": "The Mando &eacute; uma homenagem em forma de game ao Star Wars, The Mandaloriam e Flappy Bird. Com isso o jogador ir&aacute; se divertir em quando joga e tenta conquistar 100 pontos ouvindo a trilha sonora cl&aacute;ssica de The Mandalorian enquanto controla o pr&oacute;prio Mandaloriano voando nos c&eacute;us do planeta Nevaro, planeta cl&aacute;ssico da s&eacute;rie The Mandalorian.",
        "instructions": "Toque ou clique na tela para pular ",
        "url": "https://html5.gamemonetize.com/5gor8gckf5d4rpdxvaxsow5dixwn05hw/",
        "category": "Hypercasual",
        "tags": "Family, Fantasy, fly, HTML5, jump",
        "thumb": "https://img.gamemonetize.com/5gor8gckf5d4rpdxvaxsow5dixwn05hw/512x384.jpg",
        "width": "480",
        "height": "854"
    },
    {
        "id": "49075",
        "title": "Dont Drop The Skibidi",
        "description": "Dont let Skibidi and Grimace fall! And pop all the balloons that you see on the screen! Tap with your finger or click with your mouse on the screen to popo the balloons and touch/click the Skibidi/Grimace to prevent it from falling down. You need to play and sign a good record to unlock the Grimace! Enjoy this supercool game!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/o3450qzrjrt9bzsx606ywx2v8dked4m2/",
        "category": "Hypercasual",
        "tags": "Grimace, Grimace Shake, HTML5, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/o3450qzrjrt9bzsx606ywx2v8dked4m2/512x384.jpg",
        "width": "600",
        "height": "1024"
    },
    {
        "id": "47730",
        "title": "Flappy Ring",
        "description": "Flappy Ring - jump or lose. One click - one jump. Set records! Compete with your friends! You are a brave goose trying to get home, flying through a scary forest. Dont run into obstacles. Collect coins and compete with other players! In the game you will find a generated infinite level. The ability to continue the game after death. Become the best goose in the high score table and tell your friends!",
        "instructions": "Control Click the mouse or finger on the screen and the goose will fly higher Your goal is to collect as many coins as possible There is no pause It is possible to continue playing after losing ",
        "url": "https://html5.gamemonetize.com/zw90faeblma3xobtp69dpdubq6r1ejk5/",
        "category": "Hypercasual",
        "tags": "2D, Arcade, Bird, Click, fly, Forest, Pixel",
        "thumb": "https://img.gamemonetize.com/zw90faeblma3xobtp69dpdubq6r1ejk5/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "40096",
        "title": "Diamond Compiler",
        "description": "Diamond Compiler - in this game all you have to do is collect the diamonds! Collect as many diamonds as possible to stay alive in the game. Do not forget about the obstacles that are coming from the sky. Move left and right or jump to avoid the obstacle.",
        "instructions": "Control Desktop Use the up arrow keys of the keyboard to jump and click the left button of the mouse to turn around Mobile Click on the screen to jump characters And swipe the screen to move left right Controls and Indicators The scores and lev",
        "url": "https://html5.gamemonetize.com/mb2rjtvy72ygi16qfhknkifs1qo11p0o/",
        "category": "Hypercasual",
        "tags": "2D, Arcade, Fun, Funny, Game, Games, Obstacle, Online",
        "thumb": "https://img.gamemonetize.com/mb2rjtvy72ygi16qfhknkifs1qo11p0o/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "48418",
        "title": "Barbie&rsquo;s Sketch",
        "description": "Experience the fun and challenges of sketchboarding with Barbie. Here, Barbie is the main character of the game, where she sketches to reach her destination. Stay aware of the new environment and different obstacles, and help Barbie avoid all the obstacles on her way.",
        "instructions": "PC There are two buttons on the screen click the left button on the screen to speed up and the right button to jump Mobile There are two buttons on the screen tap the left button on the screen to speed up and the right button to jump ",
        "url": "https://html5.gamemonetize.com/emziektbc3tv89elpu9lbjjccox53q39/",
        "category": "Hypercasual",
        "tags": "Adventure, Arcade, Barbie, Hypercasual, NapTech Games, survival",
        "thumb": "https://img.gamemonetize.com/emziektbc3tv89elpu9lbjjccox53q39/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "48957",
        "title": "UnstoppableShooter",
        "description": "Unstoppable Shooter is a shooting game. By adjusting the shooting strength and direction of the stickman equipment, you can resist the constantly attacking enemies.",
        "instructions": "Click on the blank space to continue The angle of the ups and dynamic adjustment adjustment",
        "url": "https://html5.gamemonetize.com/42k8bct5nde66kw9jtdlxi8hpsw9sl4u/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Shooting",
        "thumb": "https://img.gamemonetize.com/42k8bct5nde66kw9jtdlxi8hpsw9sl4u/512x384.jpg",
        "width": "1136",
        "height": "640"
    },
    {
        "id": "48966",
        "title": "Dont Drop The Grimace!",
        "description": "Dont let Grimace fall! And drink all the milkshakes for Grimaces Birthday! Sing along to the Happy Birthday Grimace song! Add some BLING to your Grimace",
        "instructions": "Tap Grimace to keep him in the air And tap all the birthday milkshakes that appear ",
        "url": "https://html5.gamemonetize.com/rqwwao9y4ks24rmby2xxk6akhek9pyai/",
        "category": "Hypercasual",
        "tags": "Adventure, Arcade, Grimace, Grimace Shake, Hypercasual",
        "thumb": "https://img.gamemonetize.com/rqwwao9y4ks24rmby2xxk6akhek9pyai/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48981",
        "title": "MechDinosaur",
        "description": "A hyper-casual game with a variety of dinosaur armors to choose from. Use the dinosaur armor to pass the level to your hearts content.",
        "instructions": "A hyper-casual game with a variety of dinosaur armors to choose from Use the dinosaur armor to pass the level to your hearts content ",
        "url": "https://html5.gamemonetize.com/vm0t1dm804h6hgo77coq5oc4z5r4mch6/",
        "category": "Hypercasual",
        "tags": "1 Player, Battle, Dinosaur",
        "thumb": "https://img.gamemonetize.com/vm0t1dm804h6hgo77coq5oc4z5r4mch6/512x384.jpg",
        "width": "1387",
        "height": "640"
    },
    {
        "id": "48442",
        "title": "Speakerman: Skibidi Dop Yes Yes",
        "description": "&ldquo;Speakerman: Skibidi Dop Yes&rdquo;, is a fun game to play. To move to the next pillar, all you have to do is make the wood log to the required length. But it&rsquo;s not as easy as you think. You need perfect timing to make a perfect length wood log. Do not make it too long or too short; otherwise, you will fall. Play now and have fun.",
        "instructions": "Desktop Tap the left button of the mouse to go from one pillar to another pillar as much as you need to tap and release Mobile Tap the screen to go from one pillar to another pillar as much as you need to tap and release ",
        "url": "https://html5.gamemonetize.com/ignuxa3yy79wizagsy0g3c3e8xgqjo0c/",
        "category": "Hypercasual",
        "tags": "Adventure, Best, Best Games, Hypercasual, NapTech Games, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/ignuxa3yy79wizagsy0g3c3e8xgqjo0c/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "48872",
        "title": "Long Neck Run 3D",
        "description": "What will you do if you are tall enough to look down the Effiel Tower? Here is a collecting arcade game with 3D stickman game art animations. Your target is to collect as many of the same colorful rings as your current color as you can while running forward to the finish platform. Then you will see taller and taller buildings and items. I hope you will unlock taller buildings!",
        "instructions": "While playing the game Long Neck Run 3D you maneuver using the A-D keys or the left and right arrow keys Your objective is to extend your neck by collecting various colored rings scattered throughout the course There are rings of different colors on th",
        "url": "https://html5.gamemonetize.com/7m20k12fbi6b2v1i1bfkmvrdqimaoqm7/",
        "category": "Hypercasual",
        "tags": "1 Player, 3D, 3D Games, Casual, Collecting, Fun, Game, Games, HTML5, Hypercasual, Platform, Stack, Stunts, WebGL",
        "thumb": "https://img.gamemonetize.com/7m20k12fbi6b2v1i1bfkmvrdqimaoqm7/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "48902",
        "title": "Skibidi Fishing",
        "description": "Help Skibidi to catch the magic treasure at the bottom of the sea. Collect fish, shoot him, and earn coins to upgrade your fishing gear. Better stuff is more distance that you need to reach the bottom, buy new guns to destroy everything and other objects to help your way to that treasure.Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "Use the mouse or touch to play",
        "url": "https://html5.gamemonetize.com/v8wa2j5tkgzu6pg187rmnofj0qzizc1l/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Action, Arcade, Best, Casual, Fishing, HTML5, Hypercasual",
        "thumb": "https://img.gamemonetize.com/v8wa2j5tkgzu6pg187rmnofj0qzizc1l/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "48695",
        "title": "Weapon Transformer",
        "description": "Are you ready to defeat enemies and gain coin? Use your bullets and weapons wisely! Do not forget to buy new weapons and more bullets before the attack!",
        "instructions": "Use moue and keyboard to controle the player",
        "url": "https://html5.gamemonetize.com/40si1r6i221zh18w93qw5gkntkk8uhuq/",
        "category": "Hypercasual",
        "tags": "1 Player, Action, Cartoon Network, Fighting, Hypercasual, Tower Defense",
        "thumb": "https://img.gamemonetize.com/40si1r6i221zh18w93qw5gkntkk8uhuq/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "47123",
        "title": "Craft Conflict",
        "description": "Welcome to the thrilling world of strategy and combat! In this captivating game, youll collect resources - gold and stone - to construct towers with mages and archers, as well as recruit mighty warriors, mages, and archers. Unleash your tactical skills, employ strategic maneuvers, and claim victory in this exhilarating clash! Embark on your journey, conquer new territories, and become a true military strategist in this gripping game!",
        "instructions": "-Navigate the cursor across the screen for movement -Approach ruins to construct combat towers in their place -Enter the unit purchase zone to summon soldiers for reinforcement -Destroy enemy towers to claim them while ensuring to repair your own -De",
        "url": "https://html5.gamemonetize.com/8cwnvmwsvotgwfe5gvmoo50kt7rsc3gj/",
        "category": "Hypercasual",
        "tags": "1 Player, 3D, 3D Games, Arcade, Battle, Castle, Casual, Hypercasual, Tower Defense",
        "thumb": "https://img.gamemonetize.com/8cwnvmwsvotgwfe5gvmoo50kt7rsc3gj/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "48750",
        "title": "Rolling Skibidi",
        "description": "An unsuspecting Skibidi drank too much and ended up in a wheel ... Help him before its too late! Take control of your Skibidi and ride the barrel down the mountain. Watch out for the boulders, trees and wildlife! Key Features: - Addictive one touch game play that is easy to pick up but difficult to master! - Its a Skibidi running on a giant barrel down a mountain! What more do you want! - Highly addictive",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/dofllavuxzlls6pxbifnje7avl9zl7jh/",
        "category": "Hypercasual",
        "tags": "Arcade, Ballon, HTML5, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/dofllavuxzlls6pxbifnje7avl9zl7jh/512x384.jpg",
        "width": "1280",
        "height": "800"
    },
    {
        "id": "7973",
        "title": "Kid Ball Adventure",
        "description": "Enter a fantasy world of bouncing balls and magic castles in Kid Ball Adventure is a 2D platformer where risk is balanced with great reward! Take control of Kid Ball as he pursues those who captured his love through treacherous castle dungeons. To guide Kid Ball to victory, you will need to overcome many challenging stages filled with traps and deadly enemies, bouncing over spikes and using booster cannons to your advantage! Locate the key and unlock the exit to move on to the next daunting chamber of hazards!",
        "instructions": "Arrow keys on the Desktop Buttons on Mobile",
        "url": "https://html5.gamemonetize.com/30q2nhz4ns0p9q7nn6bk1lrmsbml8i0c/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Adventure, Best, Casual, Funny, Kid, Kids, Platform",
        "thumb": "https://img.gamemonetize.com/30q2nhz4ns0p9q7nn6bk1lrmsbml8i0c/512x384.jpg",
        "width": "800",
        "height": "480"
    },
    {
        "id": "48677",
        "title": "Skibidi Toilet Hidden Stars Challenge",
        "description": "Embark on a whimsical adventure in the quirky world of Skibidi Toilet Hidden Stars, a delightful and free online hidden game designed especially for kids. Dive into this enchanting experience right here and right now, where the bathroom becomes a realm of mystery and fun. Your mission, should you choose to accept it, is to uncover all 5 hidden stars cleverly concealed within each level. As you successfully unveil these elusive stars, youll unlock access to exciting new levels filled with even more surprising challenges. Join the Skibidi Toilet Hidden Stars quest, where curiosity meets discovery, and where every click leads to another star.",
        "instructions": "Use left mouse click to play ",
        "url": "https://html5.gamemonetize.com/nt50nffh5il2bj15cs15unkrb0r0mt2h/",
        "category": "Hypercasual",
        "tags": "Fun, Hidden, HTML5, Hypercasual, Kids, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/nt50nffh5il2bj15cs15unkrb0r0mt2h/512x384.jpg",
        "width": "960",
        "height": "540"
    },
    {
        "id": "48592",
        "title": "Swing Grimace",
        "description": "Help Grimace to jump side to side and try to avoid the spikes! Thats all you need to do but try to resist the more you can! Try to sign you best personal record in the leaderboard! Happy Birthday Grimace!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/m7gg5fgclnoyuwv247crbille8hwasgh/",
        "category": "Hypercasual",
        "tags": "Arcade, Grimace, HTML, HTML5, Mobile",
        "thumb": "https://img.gamemonetize.com/m7gg5fgclnoyuwv247crbille8hwasgh/512x384.jpg",
        "width": "768",
        "height": "1024"
    },
    {
        "id": "47984",
        "title": "Yasin Cengiz Game",
        "description": "Help the Tiktoker Yasin to catch all the food in a rushtime. Eat all food and dont let fall or you will lose a life. Evade the bombs and dont let the food fall, collect cash and coins to buy power ups, more speed, special powers and more to reach the highest scores.Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/g1ut0m8pmc3fb0nznardzk2xhc4z3pti/",
        "category": "Hypercasual",
        "tags": "1 Player, Action, Balance, Burger, Casual, Click, Dancing, Fun, Funny, Hypercasual",
        "thumb": "https://img.gamemonetize.com/g1ut0m8pmc3fb0nznardzk2xhc4z3pti/512x384.jpg",
        "width": "480",
        "height": "800"
    },
    {
        "id": "48535",
        "title": "Sky Runner Only Up Parkour ",
        "description": "Dash from rooftop to rooftop. Flip, jump, fall, and vault over obstacles to set all new records. Join other guys and compete to win the daily race for special rewards! Scale buildings around the city and land tricks to gain extra speed. Leave your opponents to rage as you take home the win!",
        "instructions": "Mouse Controls",
        "url": "https://html5.gamemonetize.com/co5wqzv6bizk3ej7da0onbydypx5o4t6/",
        "category": "Hypercasual",
        "tags": "1 Player, 3D, 3D Games, Action, Adventure, Arcade, Boy, running, Unity3D",
        "thumb": "https://img.gamemonetize.com/co5wqzv6bizk3ej7da0onbydypx5o4t6/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46753",
        "title": "Cops Chase",
        "description": "Run!! Police cars are chasing you! Hold your steering strong and evade them away. Make your way through power-ups, speed-ups, bombs, and coins. Level up and speed up your vehicle, do not get busted. Ready to take the challenge?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ml8amwz0tnf3bq91ux1ktlgh93edxsa4/",
        "category": "Hypercasual",
        "tags": "3D, Action, Adventure, Android, Arcade, HTML5, Hypercasual, iPhone",
        "thumb": "https://img.gamemonetize.com/ml8amwz0tnf3bq91ux1ktlgh93edxsa4/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "48415",
        "title": "Captain Gold",
        "description": "Captain Gold is a hyper-casual game that comes with an adventure theme. In this game, the player needs to help Captain, the game character, in smashing and collecting gold and other stones. Captain is somewhere away from the city and is busy extracting gold, diamond, ruby, and other useful resources from the mines. He has to break the stones, gold and diamonds with the hammer, collect and take them to his place in his cart. To help Captain, you need to throw the hammers at the stones on time and smash them. Captain Gold, hyper-casual game, adventure theme, smashing, collecting gold, diamonds, rubies, precious resources, hammers, easy-to-use",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/zhop7a3olf3f3nmk8gfqif0msfkeagmc/",
        "category": "Hypercasual",
        "tags": "Arcade, Collecting, Gold, Hypercasual, Island, Jigsaw, Mine, Miner, run, running, Shoot, Shooter, Shooting, Silver",
        "thumb": "https://img.gamemonetize.com/zhop7a3olf3f3nmk8gfqif0msfkeagmc/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48403",
        "title": "Skibidi Run Fast Run",
        "description": "Skibidi Run Fast Run! is a fun adventure game to play on. Here is Skibidi Toilet who has been stuck in middle with a whole lot of traps, help him to dodge them. There are really fast-paced obstacles passing by, keep away from them and survive as long as you can. This game will boost your reflexes while the hardest objects moving on him.",
        "instructions": "Mouse click or tap to play ",
        "url": "https://html5.gamemonetize.com/t17lqtggk0kyour9k18cvzqs6957gv62/",
        "category": "Hypercasual",
        "tags": "HTML, Mobile, run, running, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/t17lqtggk0kyour9k18cvzqs6957gv62/512x384.jpg",
        "width": "600",
        "height": "1024"
    },
    {
        "id": "48253",
        "title": "Rolling the Ball 3D",
        "description": "Roll, rotate, jump and even try going back, you need to keep your balance and avoid obstacles. As the slope gets steeper, it becomes harder to hold on and not fall. Its a rolling ball games course in an abstract world, but with uncompromising physics!",
        "instructions": "Tap left or right to move",
        "url": "https://html5.gamemonetize.com/vp18bzksobrsx1padm8vq5nj8srzozb8/",
        "category": "Hypercasual",
        "tags": "Ball, Fun, Skill",
        "thumb": "https://img.gamemonetize.com/vp18bzksobrsx1padm8vq5nj8srzozb8/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "48340",
        "title": "Ice Princess Dress Up",
        "description": "Welcome to the enchanting world of the Ice Princess Dress Up game! Get ready to immerse yourself in a magical realm where you can unleash your creativity and style. Dress Up the Ice Princess: Your mission is to dress up the beautiful Ice Princess in a variety of stunning outfits. Mix and match elegant dresses, sparkling tiaras, and shimmering accessories to create the perfect royal look. Winter Wonderland Wardrobe: Explore a wardrobe filled with exquisite winter-themed clothing items. From luxurious gowns to cozy fur wraps, youll find everything you need to craft a unique ensemble for the Ice Princess.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/4kjoxdnlogn1usdzeauicoitqz5xt6s4/",
        "category": "Hypercasual",
        "tags": "Baby Hazel, Dress Up, Frozen, Girl, Girls, Hair, Hypercasual, Ice, Kid, Kids, Princess",
        "thumb": "https://img.gamemonetize.com/4kjoxdnlogn1usdzeauicoitqz5xt6s4/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48247",
        "title": "Flappy Around",
        "description": "Flappy Around is a reaction game where each subsequent level will become much more difficult. Try to stay in flight as long as possible, while avoiding any contact with obstacles. Set your best record in this not easy task.",
        "instructions": "Use Mouse for desktop and Touch Controls for mobile device",
        "url": "https://html5.gamemonetize.com/kgfc325x1hj54d5a8j52k6db6xk8byan/",
        "category": "Hypercasual",
        "tags": "Arcade, Ball, Bird, fly, Game, Highscore, HTML5, Red",
        "thumb": "https://img.gamemonetize.com/kgfc325x1hj54d5a8j52k6db6xk8byan/512x384.jpg",
        "width": "480",
        "height": "854"
    },
    {
        "id": "48191",
        "title": "FreelancerSim",
        "description": "Have you ever wanted to work from home and earn money? Yes, today we are freelancing and earning money by working from home. We can earn money by typing the required words or by detonating viruses on computers. We can buy things for our home or feed ourselves with the money we earn. If you go hungry and die, everything starts from scratch.",
        "instructions": " Move back and forth with the WASD keys to play Mobile control buttons available ",
        "url": "https://html5.gamemonetize.com/cn9sghe1o7h0s777l0uaojfb9z8rp0x5/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Action, Arcade, Boys, Girls, Pixel, Simulation, Simulator",
        "thumb": "https://img.gamemonetize.com/cn9sghe1o7h0s777l0uaojfb9z8rp0x5/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48273",
        "title": "Snake Down",
        "description": "Use your reaction to go down as far as possible in the Snake Down game. Each click changes your direction of movement, so try to correctly calculate your path and not meet obstacles. Collect fruits along the way and get points for your record.",
        "instructions": "Use Mouse for desktop and Touch Controls for mobile device",
        "url": "https://html5.gamemonetize.com/wa2hhxmp63p50y4s17mkb64qrlp70kke/",
        "category": "Hypercasual",
        "tags": "2D, Arcade, Fruit, Game, HTML5, Jumping, Mobile, New, Snake, Worm",
        "thumb": "https://img.gamemonetize.com/wa2hhxmp63p50y4s17mkb64qrlp70kke/512x384.jpg",
        "width": "480",
        "height": "854"
    },
    {
        "id": "48214",
        "title": "Swing Skibidi",
        "description": "Help Skibidi Toilet to jump side to side and try to avoid the spikes! Thats all you need to do but try to resist the more you can! try to sign you best personal record in the leaderboard!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/7c14nb5n8vpa1t7o4e6bebksx60ob9bn/",
        "category": "Hypercasual",
        "tags": "HTML, Jumping, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/7c14nb5n8vpa1t7o4e6bebksx60ob9bn/512x384.jpg",
        "width": "768",
        "height": "1024"
    },
    {
        "id": "3865",
        "title": "Super Friday Squid Challenge",
        "description": "Boyfriend and Girlfriend back with new adventures. They lost all the money gambling and now they have to join to the Squid games. Help them to complete all the songs in different weeks to win the high prize and recover the money that they lost. Many people will die here but dont hasitate and keep dancing and dont miss any arrow. Complete the 12 levels and be the winner of 38 million USD in this crazy game",
        "instructions": "Desktop Controls Use the arrow keys to play mobile controls Touch the areas of the game to play ",
        "url": "https://html5.gamemonetize.com/lt5hbe3py7u0ua3013qox7bgjji5uofg/",
        "category": "Hypercasual",
        "tags": "Casual, Funny, kiz10, Music",
        "thumb": "https://img.gamemonetize.com/lt5hbe3py7u0ua3013qox7bgjji5uofg/512x384.jpg",
        "width": "550",
        "height": "750"
    },
    {
        "id": "48185",
        "title": "Skibidi Triple Jump",
        "description": "Skibidi Triple Jump Game, a single-touch jumping reaction game, has everything you need to make your next app store hit! Use your skills and agility to survive by jumping over obstacles and avoid getting hit. Just tap the screen and makeup to three jumps before touching the ground again. Avoid the dangerous obstacles or your Skibidi character will explode and the game will be over!",
        "instructions": "Mouse click Touch the screen or press spacebar key to jump ",
        "url": "https://html5.gamemonetize.com/m7kahwh1v04r7vxyg24abl0w1quufl7z/",
        "category": "Hypercasual",
        "tags": "HTML, HTML5, Hypercasual, jump, Jumping, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/m7kahwh1v04r7vxyg24abl0w1quufl7z/512x384.jpg",
        "width": "768",
        "height": "1024"
    },
    {
        "id": "48141",
        "title": "Adventure Capitalist Hole",
        "description": "The thrilling online game Adventure Capitalist Hole has taken the gaming community by storm. This recreational game immerses players in a perilous quest to amass wealth and capital. The highlight? Kiz10.com is completely free to play and provides hours of entertainment for both desktop and mobile enthusiasts.Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/cqj1nqf5rabzlarwhiplklrjle52h46t/",
        "category": "Hypercasual",
        "tags": "Casual, Highscore, kiz10, Point And Click",
        "thumb": "https://img.gamemonetize.com/cqj1nqf5rabzlarwhiplklrjle52h46t/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48151",
        "title": "Skibidi Toilet Adventure",
        "description": "Skibidi Toilet Adventure is a fun and challenging platformer game that is perfect for fans of the Skibidi Toilet meme. Its a great game for players of all ages, and its sure to provide hours of entertainment.",
        "instructions": "Desktop Tap the left button of the mouse to go from one pillar to another pillar as much as you need to tap and release Mobile Tap the screen to go from one pillar to another pillar as much as you need to tap and release ",
        "url": "https://html5.gamemonetize.com/m60kgrjh9fhcw8pr6ft2ewnpujm8iv2o/",
        "category": "Hypercasual",
        "tags": "2D, Action, Best, Best Games, Casual, Fun, HTML, HTML5, Hypercasual, NapTech Games, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/m60kgrjh9fhcw8pr6ft2ewnpujm8iv2o/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "48136",
        "title": "Punch Skibidi Toilets",
        "description": "Be the champ and knock down as many tree as possible with your Head super Skibidi toilet! Play this adrenaline rush game with lots of intensity. Be specific with your timing as you need to punch the tree in the exact time to smash it so you can create a way to run as far as you can. Achieve high scores are play lot more running games only with Mapi Games!",
        "instructions": "Mouse Button or Spacebar key to play ",
        "url": "https://html5.gamemonetize.com/34ccd7htq1m9gkxhyhp429f97awrd86e/",
        "category": "Hypercasual",
        "tags": "HTML, Mobile, Punch, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/34ccd7htq1m9gkxhyhp429f97awrd86e/512x384.jpg",
        "width": "320",
        "height": "568"
    },
    {
        "id": "47988",
        "title": "Block Destroyer",
        "description": "A game in which you have to destroy towers by throwing balls. You need to destroy various buildings by throwing balls, after passing the level you get coins that you can use to buy new balls",
        "instructions": "Tap the screen to throw the ball Aim to destroy the building and click on the screen the ball will fly in the direction where you clicked ",
        "url": "https://html5.gamemonetize.com/e1jra50a3tpm5v48ww15bbiv9atmrdz1/",
        "category": "Hypercasual",
        "tags": "3D, Ball, Block, Bricks, crash, Mobile",
        "thumb": "https://img.gamemonetize.com/e1jra50a3tpm5v48ww15bbiv9atmrdz1/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48113",
        "title": "Drive Mad Master",
        "description": "Drive Mad is a car game where you drive on a track filled with obstacles. Your aim is to reach the finish line in one piece. You have to balance your speed so your car doesnt flip over. This is harder than it sounds, as there are many thrilling and creative stunts and obstacles for you to enjoy. Do you have what it takes to finish every level in Drive Mad?",
        "instructions": "Steer forward - W D X Up arrow Right arrow Mouse click Steer backward - S A Z Down arrow Left arrow",
        "url": "https://html5.gamemonetize.com/2f5lypvwnzn32ckrbv6ki83lw86t7w0f/",
        "category": "Hypercasual",
        "tags": "Arcade, Boy, Car, Driving, Girl, Kid",
        "thumb": "https://img.gamemonetize.com/2f5lypvwnzn32ckrbv6ki83lw86t7w0f/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48049",
        "title": "Skibidi Blocks",
        "description": "Skibidi Blocks Game is a fast-paced and challenging building block runner game that will test your reflexes and strategic thinking skills. A stack of blocks through a series of obstacles, collecting Poo along the way. The blocks will automatically move forward, so you must carefully plan your jumps and movements to avoid falling off the screen.",
        "instructions": "Desktop Use the left mouse click or the Keyboard up arrow key to jump up Mobile Tap on the screen to jump ",
        "url": "https://html5.gamemonetize.com/s4o38io2njqugp5wwc4q6nhlu8pt9ltv/",
        "category": "Hypercasual",
        "tags": "Arcade, Casual, Fun, HTML, HTML5, Hypercasual, Online, Platform, Play, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/s4o38io2njqugp5wwc4q6nhlu8pt9ltv/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "46819",
        "title": "Time Bomb Rush ",
        "description": "Introducing Time Bomb Rush, the newest parkour game! Dont miss out on the action. In this thrilling game, your mission is to prevent your explosives from detonating until you reach the finish line. Navigate through obstacles, gather fuses, and compete against the ticking clock before the fuses burn out. Remember, success is achieved by holding onto every single fuse until the very end. Will you emerge victorious?",
        "instructions": "Drag to move avoid obstacles and collect bombs survive to the end ",
        "url": "https://html5.gamemonetize.com/mft1597mavroaqdrsgoly8e73zsld15r/",
        "category": "Hypercasual",
        "tags": "3D, Adventure, Android, Avoid, Best, Bomb, Boy, Collecting, Kids, Mobile, run, running",
        "thumb": "https://img.gamemonetize.com/mft1597mavroaqdrsgoly8e73zsld15r/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "48026",
        "title": "Skibidi Vs Alien",
        "description": "Skibidi Vs. Alien is an endless runner survival game where you play as Skibidi, a young alien who must dance his way through a series of challenging levels in order to defeat the evil aliens who have invaded his planet. The game is simple to play but difficult to master. You control Skibidi by tapping the screen to make him jump and slide. You must avoid obstacles and enemies while collecting power-ups to help you stay alive. The levels get progressively more difficult as you progress, and you will need to use all of your skills to survive.",
        "instructions": "Desktop Use the right click button to go up or down Mobile Tap on the screen to go up or down ",
        "url": "https://html5.gamemonetize.com/1v06gmcc1cj54tugaaaglb86k6ah1b5j/",
        "category": "Hypercasual",
        "tags": "Action, Adventure, Alien, Arcade, Casual, Fun, Game, Games, HTML, HTML5, Hypercasual, Online, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/1v06gmcc1cj54tugaaaglb86k6ah1b5j/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "46805",
        "title": "Ear Doctor Online",
        "description": "Imagine the satisfaction of becoming an otolaryngologist! Utilize your remarkable abilities to effectively combat troubling infections, alleviate the agony and distress of patients, and ultimately bring joy to everyone involved! This exceptional simulation game provides an immersive insight into the world of otolaryngology, showcasing the vital role they play in improving lives every single day!",
        "instructions": "Just use left mouse or tap on screen to play the game",
        "url": "https://html5.gamemonetize.com/e1w58o0ycqhydmwnjdtpvna4porcsch3/",
        "category": "Hypercasual",
        "tags": "1 Player, 2D, Best, Casual, Doctor, Girl, Kids, Mobile, Online, Simulator, Surgery",
        "thumb": "https://img.gamemonetize.com/e1w58o0ycqhydmwnjdtpvna4porcsch3/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "38048",
        "title": "Angry Birdz",
        "description": "Angry Birdz is a captivating physics-based mobile game that challenges players to launch a variety of quirky, feathered creatures at intricate structures built by mischievous pigs. Utilize unique bird abilities, each with its own strategic advantage, to topple the pigs defenses and retrieve stolen eggs. With engaging levels, and clever puzzles, Angry Birdz offers a fresh take on the classic slingshot gameplay, providing hours of addictive fun for players of all ages. Website Developer <a href='https://hyhygames.com/'>https://hyhygames.com/</a>",
        "instructions": "Slide your finger to aim and release to shoot green pigs",
        "url": "https://html5.gamemonetize.com/ded8u67zw9pbvhio4cbd6prt2bd0713x/",
        "category": "Hypercasual",
        "tags": "Arcade, Bird, Hypercasual",
        "thumb": "https://img.gamemonetize.com/ded8u67zw9pbvhio4cbd6prt2bd0713x/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "48027",
        "title": "Swing Skibidi Toilet",
        "description": "It is easy to control but hard to get a high score! Just tap the screen or click the mouse button to control the Skibidi Toilet Helicopter and try to avoid colliding with miscellaneous obstacles. There are many achievements for you to challenge.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/zhb4ktg6hszedoiexhngoejz50z9u23n/",
        "category": "Hypercasual",
        "tags": "Arcade, Games, HTML, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/zhb4ktg6hszedoiexhngoejz50z9u23n/512x384.jpg",
        "width": "600",
        "height": "1024"
    },
    {
        "id": "44344",
        "title": "Diy Makeup",
        "description": "Diy Makeup is an unique makeup game for girls. In this game, you run a DIY makeups store. You can not only do makeups for your customers, but also DIY makeups according to your fashion taste. With the raw ingredients that your customers give you, you can DIY Lipsticks, face masks, eye shadows etc. Ready for a try? Have a good time!",
        "instructions": "Tap or click",
        "url": "https://html5.gamemonetize.com/28s63u661hqzw6ymyi48jpckbeftdlj2/",
        "category": "Hypercasual",
        "tags": "Fun, Funny, Girl, Girls, Kids, Makeover",
        "thumb": "https://img.gamemonetize.com/28s63u661hqzw6ymyi48jpckbeftdlj2/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "45588",
        "title": "Farm Town",
        "description": "Welcome to Farm Town, a place where the spirit of family adventure and farming awaits you! Embark on a journey of nurturing plants, uncovering the vastness of the land, engaging in delightful games, and tending to adorable pets and animals. Generate profits by selling goods and amass coins to expand your farm, ultimately bringing happiness and joy to your beloved land. Allow the captivating storyline to transport you into a realm of tranquility, enabling you to escape from your worries and indulge in a calming gaming experience. Discover all these treasures that await you in Farm Town today!",
        "instructions": "Tap to play slide to plant seeds chop down trees and do businesses",
        "url": "https://html5.gamemonetize.com/kl6gvl61gusv4wp4ffo6hk2wyvo80t82/",
        "category": "Hypercasual",
        "tags": "Best, Boy, Business, Casual, Farm, Girl, iPad, iPhone, Kids, Management, Mobile, Mouse, Online, Simulation",
        "thumb": "https://img.gamemonetize.com/kl6gvl61gusv4wp4ffo6hk2wyvo80t82/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "47931",
        "title": "Elemental Friends Adventure",
        "description": "Elemental Friends Adventure is a captivating online platform game that will take you on an exciting adventure in the digital world and provide you with hours of fun and amusement. Elemental Friends Adventure, a free game on kiz10.com, combines Disneys enchantment with exciting game play. Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "Controls Desktop Use the WASD keys to move and Jump Touch controls Use Buttons Game to move and Jump",
        "url": "https://html5.gamemonetize.com/yfg9tirgwqowk7eczp99ngl7qs8dxwyq/",
        "category": "Hypercasual",
        "tags": "kiz10, Levels, Platform, survival",
        "thumb": "https://img.gamemonetize.com/yfg9tirgwqowk7eczp99ngl7qs8dxwyq/512x384.jpg",
        "width": "800",
        "height": "550"
    },
    {
        "id": "45530",
        "title": "Dream Restaurant 3D",
        "description": "Ready for the ultimate restaurant challenge in Dream Restaurant 3D? Embark on a journey to establish your very own restaurant empire. The mission is straightforward: swiftly attend to customers, prepare delectable hamburgers, stack them up, and gracefully serve them around the tables. Expand your team by hiring proficient waiters, accumulate profits, and gradually construct an unparalleled restaurant empire!",
        "instructions": "Slide to play the Dream Restaurant 3D unlock new areas collect cash and make foods for customers ",
        "url": "https://html5.gamemonetize.com/0lmv5h0j5tuk9gi94xd8crb2dwfmkqn3/",
        "category": "Hypercasual",
        "tags": "1 Player, 3D, Android, Best, Boy, Business, Girl, Kids, Management, Mobile, Online, Restaurant, Shopping, Simulation",
        "thumb": "https://img.gamemonetize.com/0lmv5h0j5tuk9gi94xd8crb2dwfmkqn3/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "47917",
        "title": "Skibidi Jump Challenge",
        "description": "Skibidi Jump Challenge is a fun yet challenging game to play. Here, the player has to make a stack of dustbins and jump at the right time to place the skibidi toilet on top of the stack. Focus on the timing; do not let the toilet fall, or the game will be over. Website developer <a href='https://naptechgames.com/'>https://naptechgames.com/</a>",
        "instructions": "Control Desktop Click with the left button of the mouse to jump to the skibidi toilet Mobile Tap on the mobile screen to jump to the skibidi toilet ",
        "url": "https://html5.gamemonetize.com/7ulrer64ihv4hqk58kaw6sx71vkq5mtm/",
        "category": "Hypercasual",
        "tags": "2D, Action, Adventure, jump, Jumping, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/7ulrer64ihv4hqk58kaw6sx71vkq5mtm/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "46995",
        "title": "Skbidi MakeUp",
        "description": "Skbidi MakeUp is a Makeup Run Kit time ,become a nice skibidi and Give your girls the sweetest makeovers ever! Pickup your favorite brushes and makeover your princess to be beautiful. Have fun will playing it on <a href='https://www.bestcrazygames.com.'>https://www.bestcrazygames.com.</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/sw2tskkqn8aq4zkwgbzja746xse4fhre/",
        "category": "Hypercasual",
        "tags": "Adventure, Android, Arcade, HTML5, Hypercasual, Interactive, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/sw2tskkqn8aq4zkwgbzja746xse4fhre/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "46319",
        "title": "Pop Band Maker",
        "description": "Do you enjoy playing in musical groups? Its such a soothing experience. Pop Band Maker provides you with an opportunity to relish the atmosphere of being in a band. You can select either a male or female character, and then pick three specific roles youd like to alter the most. Customize their appearance, posture, and performances, and even snap pictures of them. A variety of shapes are available for you to mix and match, and youll always find your personal favorite! Enjoy the fun!",
        "instructions": "Left mouse to play the game choose female or male and start your game ",
        "url": "https://html5.gamemonetize.com/vwualoti4oxdfcx68e8ycc2kp1as3p2z/",
        "category": "Hypercasual",
        "tags": "Best, Casual, Decorate, Dress Up, Fashion, Girl, Girls, Kids",
        "thumb": "https://img.gamemonetize.com/vwualoti4oxdfcx68e8ycc2kp1as3p2z/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "37161",
        "title": "Blitz Slices",
        "description": "Embark on a thrilling adventure with Blitz Slices, an exhilarating game where your nimble knife skills are put to the test as you slice through various fruits while skillfully maneuvering past challenging obstacles.",
        "instructions": "Maximize your score by simply clicking on the screen ",
        "url": "https://html5.gamemonetize.com/jy46am86peqasrromj8cpm9urg3gd54k/",
        "category": "Hypercasual",
        "tags": "Fruit, Fruits, run, running, Slicing",
        "thumb": "https://img.gamemonetize.com/jy46am86peqasrromj8cpm9urg3gd54k/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "46756",
        "title": "Cooking Mania",
        "description": "Live out your dreams as a chef in your own restaurant. Choose from one of the five different restaurants with rising difficulty. Upgrade your equipment to manage the growing amount of customers that love your food.",
        "instructions": "Make the different customer orders as fast as you can Earn money and upgrade your restaurant to make cooking easier Collect daily rewards and buy more complicated restaurants as the game progresses ",
        "url": "https://html5.gamemonetize.com/k6zytamc1xi7j627myi4r6lxap9a7sk7/",
        "category": "Hypercasual",
        "tags": "Cook, Cooking, Management, Simulation, Simulator",
        "thumb": "https://img.gamemonetize.com/k6zytamc1xi7j627myi4r6lxap9a7sk7/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47028",
        "title": "Move Ragdoll Duel",
        "description": "Move Ragdoll Duel is a delightful 3D casual battle game that promises to captivate you with its enchanting graphics and immersive gameplay. Embark on thrilling battles armed with an array of weapons, including basketballs and throwing knives. To launch your weapon, simply slide your finger across the screen to select the desired direction, and release your finger. Additionally, you have the ability to teleport to your weapons location by tapping the screen. Dont miss out on the action - join the battle now!",
        "instructions": "Slide your finger on the screen to select the direction in which you want to release the weapon and then release your finger to launch it Tap again to teleport to the location of your weapon ",
        "url": "https://html5.gamemonetize.com/3qqjkshankp9p85xp7v1f8yffx2bk3my/",
        "category": "Hypercasual",
        "tags": "1 Player, Arcade, Best, Casual, Fight, Fighting, Kids, Mobile, Online, Stickman, War, weapons",
        "thumb": "https://img.gamemonetize.com/3qqjkshankp9p85xp7v1f8yffx2bk3my/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "47926",
        "title": "Skibidi Toilet In The Tower",
        "description": "Skibidi in The Tower takes the Endless runner (i guess endless flyer) genre! Help our friend Skibidi the alien to get as high as he can, avoiding the obstacles such as rolling mines, spikes, bats on the way and collecting as many coins as possible. Dont hit any enemies or its game over for skibidi! Challenge your friends scores on the local leader boards to see who comes out top in this addictive, challenging and entertaining arcade game.",
        "instructions": "Left Key Move Left Right Key Move Right Touch Left Move Left Touch Right Move Right",
        "url": "https://html5.gamemonetize.com/5m4etimwios8nihmds3zulroo7bfxxjx/",
        "category": "Hypercasual",
        "tags": "Arcade, Boy, Boys, HTML, HTML5, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/5m4etimwios8nihmds3zulroo7bfxxjx/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46534",
        "title": "Blob Giant Rush",
        "description": "Do you want to participate in an incredibly fascinating race? Blob Giant Rush is the perfect running game for you! If you enjoy playing slime games, then youll absolutely love controlling this slime ball as it runs around! Your objective is clear: watch out for obstacles, dodge them, gather all the jelly, and transform into a massive ball during an enormous sprint! Grow in size and strength, allowing the jelly to leap and the super jelly to run, ensuring the collection of extraordinary rewards!",
        "instructions": "Slide to move the blob man avoid obstacles on the road ",
        "url": "https://html5.gamemonetize.com/ii3m3vpakqditrxwdldx7jq41b4lqyzj/",
        "category": "Hypercasual",
        "tags": "1 Player, 3D, Arcade, Avoid, Boy, Casual, Collecting, Girl, Kids, Mobile, Online, run, running",
        "thumb": "https://img.gamemonetize.com/ii3m3vpakqditrxwdldx7jq41b4lqyzj/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "46014",
        "title": "One Wheel Rush",
        "description": "How are your cycling skills? Are you interested in challenging the ever-changing track? You need to ride across all the bridges to get to your destination. There are all kinds of surprises on the bridge that will test your unicycle-riding skills. Pay attention to using different wheels on different bridges. Dont be nervous and start the challenge!",
        "instructions": "Left mouse or click to choose the number of wheels tap the screen to jump",
        "url": "https://html5.gamemonetize.com/nymzhxv2cic2v9yont1ohgba98udxrc6/",
        "category": "Hypercasual",
        "tags": "1 Player, Adventure, Arcade, Avoid, Bike, Boy, Highscore, jump, Kids, Mobile, Obstacle, Online",
        "thumb": "https://img.gamemonetize.com/nymzhxv2cic2v9yont1ohgba98udxrc6/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "39782",
        "title": "Evading The Police",
        "description": "Running is exciting and if you are running from the police while you are the thief the running will be more thrilling. Evading the police is a very fun game where the player has to overcome different obstacles. However, the player has to stay away from the police too. In this game, the player has to use his attention to skip the obstacle and fool the police. Use the keyboard arrow buttons to pla the game.",
        "instructions": "Desktop Use the right click button of the mouse to jump objects Mobile Tap to jump objects to escape from police Controls and Indicators The upper left side of the screen has the pause button Right Side Sound ON OFF The scores and levels are shown ",
        "url": "https://html5.gamemonetize.com/g2ymeyc1pjl5bg32nsam5cxlnhy5w7wg/",
        "category": "Hypercasual",
        "tags": "2D, Action, Adventure, Fun, HTML, HTML5, jump, Jumping, Online, Play",
        "thumb": "https://img.gamemonetize.com/g2ymeyc1pjl5bg32nsam5cxlnhy5w7wg/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "47803",
        "title": "Color Pathio",
        "description": "Get ready for a thrilling and colorful adventure with Color Pathio, the ultimate hyper casual mobile game! In this fast-paced and fun-filled experience, immerse yourself in a world of vibrant hues and exciting challenges. Color Pathio invites you to embark on an exhilarating run where every step counts. Your mission? Navigate through an ever-changing landscape, meticulously painted in a mesmerizing array of colors. Your goal is simple: follow the path and paint it as you go! Embrace the art of coloring while dashing through a maze of twists and turns. The gameplay is refreshingly straightforward, making it accessible to players of all ages.",
        "instructions": "Move the Player with Mouse Or touch the screen",
        "url": "https://html5.gamemonetize.com/tncwd978bjyspy7l8vwypjil31uwwi12/",
        "category": "Hypercasual",
        "tags": "Casual, Color, Coloring, Fun, Funny, Hypercasual, run, running",
        "thumb": "https://img.gamemonetize.com/tncwd978bjyspy7l8vwypjil31uwwi12/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46883",
        "title": "Idle Casino Manager Tycoon",
        "description": "Have you ever fantasized about being a millionaire casino mogul? Embark on a thrilling journey as an enterprising capitalist tycoon, steering your way through idle profits. Amass a fortune and transform into a wealthy business magnate! Begin with a modest casino and embark on a mission to elevate your enterprise and ascend as a tycoon of capitalism. Expand your casino by constructing new floors, boosting your idle funds, and upgrading the premises for an unforgettable gambling experience!",
        "instructions": "Tap to start the game slide to move unlock new areas and build new machines ",
        "url": "https://html5.gamemonetize.com/uam16wjrvnbeaqg189bie72t4zjbvub4/",
        "category": "Hypercasual",
        "tags": "1 Player, Android, Business, Casino, Casual, iPad, iPhone, Management, Mobile, Mouse, Online, Simulation, Simulator",
        "thumb": "https://img.gamemonetize.com/uam16wjrvnbeaqg189bie72t4zjbvub4/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "45580",
        "title": "Family Farm Seaside",
        "description": "Experience the enchanting world of Family Farm Seaside as you immerse yourself in this captivating farming simulation game. Delight in the sheer joy of nurturing adorable farm animals and cultivating a plethora of crops, all in the pursuit of transforming your humble farm into a flourishing haven of success! Feel the thrill of unlocking an array of fascinating equipment to enhance your operations right from the onset. With boundless possibilities awaiting, the power to build your dream farm along the picturesque seaside lies solely in your hands. Begin crafting your dream farm now.",
        "instructions": "Tap to play slide to plant seeds and build different buildings",
        "url": "https://html5.gamemonetize.com/nbx5ip6gaavkx15slmtk2iujg220q9c8/",
        "category": "Hypercasual",
        "tags": "1 Player, Best, Boy, Business, Casual, Farm, Girl, iPad, iPhone, Kids, Management, Mobile, Online, Simulation",
        "thumb": "https://img.gamemonetize.com/nbx5ip6gaavkx15slmtk2iujg220q9c8/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "47814",
        "title": "Island Construction",
        "description": "A cool online adventure game developed in the simulator genre. Your hero turns out to be the only survivor on a tropical island. The player must carefully explore a new world, collecting resources, growing vegetables and more. The online game has unsurpassed graphics, animation and pleasant musical accompaniment",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/6fwdhysjyf8b3s7uzo3ycsv41ko8xqma/",
        "category": "Hypercasual",
        "tags": "Adventure, Arcade, Casual, Farm, HTML5, Simulation",
        "thumb": "https://img.gamemonetize.com/6fwdhysjyf8b3s7uzo3ycsv41ko8xqma/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47820",
        "title": "Soldiers duel",
        "description": "Your task is simple - come up with your strategy to unite warriors and archers on the battlefield and fight enemies! You must quickly combine your troops into an invincible army if you want to win!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/sy015jqe1wa4veqg45zmhnubfaxygd3p/",
        "category": "Hypercasual",
        "tags": "3D, Arcade, Casual, HTML5, Stickman",
        "thumb": "https://img.gamemonetize.com/sy015jqe1wa4veqg45zmhnubfaxygd3p/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46103",
        "title": "Rolling Balls 3D",
        "description": "Are you a fan of ball games? If so, why not try out the exciting and enriching Rolling Balls 3D? This game will test your speed and reaction skills, so put your best foot forward and aim to reach the checkpoints with lightning speed. With a competitive edge, this fast-paced game attracts numerous players. Take charge of the rolling ball and outwit your opponents. Be prepared for the fresh challenges that await! Come onboard and let the race begin!",
        "instructions": "WASD to control the ball collect coins and avoid obstacles",
        "url": "https://html5.gamemonetize.com/2sz83q1o7wwr0b0s2mmssofca9rmpqub/",
        "category": "Hypercasual",
        "tags": "1 Player, Avoid, Balance, Ball, Best, Boy, Kids, Mobile, Obstacle, Online, run, running, Skill",
        "thumb": "https://img.gamemonetize.com/2sz83q1o7wwr0b0s2mmssofca9rmpqub/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "46122",
        "title": "Maze Love Balls",
        "description": "Are you seeking a stimulating puzzle game to challenge your cognitive prowess and unleash your imagination? Look no further than Love Balls Maze! This extraordinary game is designed to put your skills to the test. Your objective is simple yet deceivingly difficult: help two balls reunite. However, be prepared to encounter a myriad of obstacles at each level that impede the balls progress. Successfully guiding them toward each other calls for resourcefulness and ingenious problem-solving. Its time to showcase your aptitude for puzzle-solving to the world. Get ready to embark on this exciting journey with Maze Love Balls!",
        "instructions": "Slide and hold to move two balls and make them meet each other",
        "url": "https://html5.gamemonetize.com/quy3uokbhnnrxpqu5iczp6xqkun5tytl/",
        "category": "Hypercasual",
        "tags": "3D, Android, Arcade, Ball, Boy, Casual, Girl, iPad, iPhone, Kids, Maze, Mobile, Mouse, Online",
        "thumb": "https://img.gamemonetize.com/quy3uokbhnnrxpqu5iczp6xqkun5tytl/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "44593",
        "title": "Vlinder Doll Dress Up",
        "description": "Vlinder Girl Dress Up is a design-your-own dress up game where Vlinder Doll is your personal fashion avatar creator and self-emoji maker. Create your own avatar facial expressions with various skin tones, eye colors, hairstyles, hair colors and more. Share your memories on social apps and get more likes!",
        "instructions": "Tap or click",
        "url": "https://html5.gamemonetize.com/3q9g9wss5hbt2k5wfi42huhqsr4j5ki3/",
        "category": "Hypercasual",
        "tags": "Dress Up, Fashion, Girl, Girls, Kids, Makeover",
        "thumb": "https://img.gamemonetize.com/3q9g9wss5hbt2k5wfi42huhqsr4j5ki3/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47259",
        "title": "MC Flappy Steve ",
        "description": "This game is a flappy game where you can live the most important and most beautiful memories of your life, you will never be bored and you will really have fun, I wish you a good game",
        "instructions": "Just press anywhere on the screen If you are on a PC with the mouse ",
        "url": "https://html5.gamemonetize.com/qja29juhi44vzafimglrq8z9c3wy2j6h/",
        "category": "Hypercasual",
        "tags": ".io, 1 Player, 2D, Adult, Adventure, Arcade, Bird, Funny, Game, Minecraft, run",
        "thumb": "https://img.gamemonetize.com/qja29juhi44vzafimglrq8z9c3wy2j6h/512x384.jpg",
        "width": "135",
        "height": "240"
    },
    {
        "id": "47330",
        "title": "Ship Up",
        "description": "Ship Up is a minimalist spaceship game that will test your skills and reflexes. In this exciting game, you take control of a spacecraft that moves vertically through a challenging obstacle-filled environment.",
        "instructions": "Click or use the mouse to move the player left or right",
        "url": "https://html5.gamemonetize.com/m9m7mvbnht6e1hr2asjix6y9g5blml6a/",
        "category": "Hypercasual",
        "tags": "Arcade, Mobile, Space",
        "thumb": "https://img.gamemonetize.com/m9m7mvbnht6e1hr2asjix6y9g5blml6a/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "47724",
        "title": "Skibidi And The Pumpkin",
        "description": "Hey Mr. Pumpkin you need to escape from the Skibidi Toilet! Try to resit the more you can and complete all 20 Levels! Enjoy this summer season with this great trend game!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/fyu3dymni8ou08mmqqy9nn50etojouhi/",
        "category": "Hypercasual",
        "tags": "Arcade, Boy, Halloween, HTML, jump, Jumping, Mobile, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/fyu3dymni8ou08mmqqy9nn50etojouhi/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "46658",
        "title": "Switch! Out",
        "description": "Switch from wall to wall to avoid oncoming objects. Collect stars to increase your score. (Collect 5 in a row to increase your score by 5 and become invincible for a short time.) The longer you last, the better the score. - Features - - Fun, fast-paced action! - One-Touch gameplay - Tap screen to switch to opposite wall. - Gameplay changes as you progress - Game gets faster and harder! - Endless gameplay. - Appealing, simplistic graphics.",
        "instructions": "Click to switch walls ",
        "url": "https://html5.gamemonetize.com/0f6jwzfuj7eszk74ow8lkutzu53zgnqs/",
        "category": "Hypercasual",
        "tags": "2D, Android, Ball, Block, Casual, Click, endless, Game, Highscore, Hypercasual, iPhone, Mobile, Obstacle, unity",
        "thumb": "https://img.gamemonetize.com/0f6jwzfuj7eszk74ow8lkutzu53zgnqs/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "47590",
        "title": "Super Mario &amp; Sonic FNF Dance",
        "description": "Super Mario &amp; Sonic FNF Dance is a rhythm action game. Featuring Super Mario and Sonic to perform great dance performance! Choose your music and defeat Sonic in this exciting battle dance music game. Upgrade your special performance to gain more score! Enjoy the cool song!",
        "instructions": "Use Arrow Keys Key 1 2 3 4 Special MOVES when available",
        "url": "https://html5.gamemonetize.com/khgpgcan9lxdopmb1nu0p2hsuqpmglld/",
        "category": "Hypercasual",
        "tags": "3D, 3D Games, Dancing, Fantasy, Mario, Music, Play, Rhythm, Simulation, unity, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/khgpgcan9lxdopmb1nu0p2hsuqpmglld/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47536",
        "title": "Rainbow Monster VS Skibidi Toilet",
        "description": "Rainbow Monster VS Skibidi Toilet is a combination between action and stealth game. As a Rainbow Monster you must survive from hurdles of Skibidi Toilet. Take aimlessly all Skibidi Toilet enemies from behind. Dont let them catch you!",
        "instructions": "Key Left Move left Key Right Move right Key Up Jump move up Key Down Move down W A S D Camera Pan Z X attack",
        "url": "https://html5.gamemonetize.com/cnu703sdunnure2h4yow3vc2card6msa/",
        "category": "Hypercasual",
        "tags": "1 Player, 3D, 3D Games, Fantasy, Mario, Music, Play, Rhythm, Simulation, Skibidi Toilet, Stealth, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/cnu703sdunnure2h4yow3vc2card6msa/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47457",
        "title": "Coloring Book Super Mario",
        "description": "Coloring Book Super Mario For Kids is fun coloring book for kids and adults! If you like Super Mario characters then you will love this fun cartoon themed coloring book! Choose one of the cute images, pick your favorite color and start coloring! Enjoy it!",
        "instructions": "Just one Click Tap to play use mouse and keyboard to play ",
        "url": "https://html5.gamemonetize.com/8j9gg42aifrn4mmp4z3mshvvsnea3dgq/",
        "category": "Hypercasual",
        "tags": "Boys, Cartoon, Color, Coloring, HTML5, Kids, Mario, Mobile, School",
        "thumb": "https://img.gamemonetize.com/8j9gg42aifrn4mmp4z3mshvvsnea3dgq/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "47302",
        "title": "Everyone Flee",
        "description": "You must ensure that everyone can flee! But be aware that your moves apply to everyone. Move all the players in a way that everybody safely reaches the door. If one cannot make it, everybody fails, beware of that too.",
        "instructions": "Use WASD keys to move around avoid obstacles You can use arrow keys to move as well ",
        "url": "https://html5.gamemonetize.com/mxr6q4l0shhi0ynnq633vvpub8h5kt4m/",
        "category": "Hypercasual",
        "tags": "2D, Action, Adventure, Android, Guessing, Interactive, iPhone, Love, Physics, Platform, Puzzle",
        "thumb": "https://img.gamemonetize.com/mxr6q4l0shhi0ynnq633vvpub8h5kt4m/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "46657",
        "title": "PenguinDash!",
        "description": "All you have to do is get as far as you can, but watch out for the crates and explosive TNTs! Penguins cant fly, so use your jumps wisely! Game gets faster and harder the further you go! - HOW TO PLAY - Jump from one platform to another, avoiding obstacles. Collect gems to increase your score. Collect 5 diamond gems to restore health by one heart. Use gems to buy power ups. The 3 in total to choose from: - Running Shoes: Your score increases at a quicker rate. - Shield: Take one free hit without losing health - Bandana: You have the ability to triple jump!",
        "instructions": "Click to Jump A quick click will prdoce a hop jump and and long click will produce a higher longer jump Press jump anytime in mid air to double jump ",
        "url": "https://html5.gamemonetize.com/7j68su1viy4c2av6k78yu1ea14t2vpg2/",
        "category": "Hypercasual",
        "tags": "2D, Casual, Click, endless, Game, Highscore, jump, Jumping, Obstacle, Penguin, Platform, Play, Side Scrolling, unity",
        "thumb": "https://img.gamemonetize.com/7j68su1viy4c2av6k78yu1ea14t2vpg2/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "45302",
        "title": "Color Parrot",
        "description": "Color Parrot is an amazing and free to play coloring game where No download needed to play it. A magical world where your imagination takes flight and cool images of parrot come alive with the stroke of your colors! Step into a world filled with charm, beauty, and endless possibilities as you embark on a journey of creativity and relaxation. Coloring has been proven to reduce stress and anxiety, enhance focus and concentration, and stimulate mindfulness. Play around and have fun with colorful Parrot!",
        "instructions": "Mouse to play ",
        "url": "https://html5.gamemonetize.com/46itxreij1zlrsruvzt4otccj7jt5suf/",
        "category": "Hypercasual",
        "tags": "Animal, Arcade, Cartoon, Coloring, Fun, Games, HTML5, Hypercasual, Online, School",
        "thumb": "https://img.gamemonetize.com/46itxreij1zlrsruvzt4otccj7jt5suf/512x384.jpg",
        "width": "480",
        "height": "854"
    },
    {
        "id": "47488",
        "title": "Prisoner of the dungeon",
        "description": "You are a prisoner and must escape from the dungeon. Touch arrows to move. Heart will make you gain life. Fruits will make you earn points and gain a little bit of life. Monsters will lower your life. Good luck!",
        "instructions": "Touch arrows to move ",
        "url": "https://html5.gamemonetize.com/ehp62lmer7snkl0yxi9darb6sf4zph77/",
        "category": "Hypercasual",
        "tags": "1 Player, Action, Adventure, Arcade",
        "thumb": "https://img.gamemonetize.com/ehp62lmer7snkl0yxi9darb6sf4zph77/512x384.jpg",
        "width": "320",
        "height": "480"
    },
    {
        "id": "47391",
        "title": "Fast Food Universe",
        "description": "Do you like fast food? Then lets start a business where we can make money by producing fast food. Delicious burgers, French fries, pizzas, sweets. They all look delicious from each other. The customers are under the spell of the sweet smell coming from inside. Theres a queue at the door. Every job is waiting for you. You have to catch up with all of them. Take care of the customers. Serve the placed orders quickly. Take special care of VIP customers. Turn the wheel of surprise and use the advantages. You can see the order list in the upper right corner of the game screen. Being fast is very important in fast food businesses. Lets get invol",
        "instructions": "Movement Drag with your mouse Follow the the game Grow your business by making the necessary purchases Note Play without skipping the tutorial",
        "url": "https://html5.gamemonetize.com/e7w6kqjchyrxdrxs0mc96csvb9ek95g1/",
        "category": "Hypercasual",
        "tags": "Arcade, Food, Funny, Kids, Restaurant",
        "thumb": "https://img.gamemonetize.com/e7w6kqjchyrxdrxs0mc96csvb9ek95g1/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "44790",
        "title": "Hexa Word",
        "description": "Hexa Word is a skill game where you have to create words using letters from the hexa size, challenge yourself by tapping or connecting letters from different hexa letters to make valid words, score as much as possible before time run out.",
        "instructions": "Use mouse or touch on the screen ",
        "url": "https://html5.gamemonetize.com/zox0pu15xu4dmbk5axyuj2a79qvwthhi/",
        "category": "Hypercasual",
        "tags": "Best, Casual, Educational, HTML5, Letters, Logic, Logical, Mobile, School, Skill, Word",
        "thumb": "https://img.gamemonetize.com/zox0pu15xu4dmbk5axyuj2a79qvwthhi/512x384.jpg",
        "width": "1280",
        "height": "768"
    },
    {
        "id": "47265",
        "title": "Desert Building Stacking",
        "description": "Your objective is to build a bloks that reaches great  while maintaining stability. The taller the building you build, the more points you earn. Your task is to strategically place these blocks on top of each other to construct a stable and towering structure. Take your time and carefully plan each move to ensure a stable construction. Your score is determined by the  of the bloks you manage to build. However, you can always restart the level and try again to improve your construction skills. Remember, the key to success in Desert Building Stacking is a combination of careful planning, precise block placement, and maintainin",
        "instructions": "HOW TO PLAY Press ldquo Space rdquo or touch the screen to insert a new floor ",
        "url": "https://html5.gamemonetize.com/2trxtfcqx3eeejjyr49fb976pbq7a2ol/",
        "category": "Hypercasual",
        "tags": "3D, Action, Bricks, endless, HTML5, Strategy",
        "thumb": "https://img.gamemonetize.com/2trxtfcqx3eeejjyr49fb976pbq7a2ol/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47274",
        "title": "Rainbow Monster Impostor Catcher",
        "description": "Look no further than Rainbow Monster Impostor Catcher! In this thrilling game, youll take control of Rainbow Blue as you embark on a mission to capture the mischievous Among Us characters before time runs out. With its captivating gameplay and addictive challenges, Rainbow Monster Impostor Catcher guarantees hours of fun and entertainment. Whether youre a fan of strategy games, action-packed adventures, or puzzle-solving quests, this game has it all. Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "Computer controls Use the mouse to select items move with the WASD and Spacebar keys to attack Touch controls Tap the game buttons to move around the map and attack ",
        "url": "https://html5.gamemonetize.com/izpx2q93ri3o86i81yqoh7zy4gj2dqqn/",
        "category": "Hypercasual",
        "tags": "Escape, kiz10, run, Timing",
        "thumb": "https://img.gamemonetize.com/izpx2q93ri3o86i81yqoh7zy4gj2dqqn/512x384.jpg",
        "width": "800",
        "height": "500"
    },
    {
        "id": "44346",
        "title": "Sailor Battle Outfit",
        "description": "Every girl likes Sailor Style! Especially when they are wearing sailor suits. Here are five fashion, Sofia, Zoe, Adella, Jade, Bella, they like Sailor suit most. They happen to be going to the masquerade party. Please help these girls to dress up like Sailor Girls! Have fun during the dress-up time!",
        "instructions": "Tap or click",
        "url": "https://html5.gamemonetize.com/tim2jwaqnam9ria8byybauhgk4cvbgw4/",
        "category": "Hypercasual",
        "tags": "Fun, Girl, Girls, Kids, Makeover",
        "thumb": "https://img.gamemonetize.com/tim2jwaqnam9ria8byybauhgk4cvbgw4/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47227",
        "title": "Funny Skibidi Toilet Face",
        "description": "Funny Skibidi Toilet Face is a super fun online game for kids that you can play for free. Its in HTML5, No Need to Install it! Make the funniest face of our famous Skibidi Toilet character! Play around and have fun!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/sxpe7t5j4er3r9a0upv3kuxgf8s5emey/",
        "category": "Hypercasual",
        "tags": "Android, Boys, Fun, Funny, HTML5, Hypercasual, Kids, Mobile, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/sxpe7t5j4er3r9a0upv3kuxgf8s5emey/512x384.jpg",
        "width": "640",
        "height": "480"
    },
    {
        "id": "44347",
        "title": "Princess Color Number",
        "description": "Princess Coloring By Number is a color filler game. Princess Coloring Book is an awesome coloring book for kids and adults with beautiful and cute princess coloring pages painted by numbers! Our princess coloring book is primarily for girls of all ages, but its for all princess lovers, from 0 to 100 years old!",
        "instructions": "Tap or click",
        "url": "https://html5.gamemonetize.com/lchueh3gpki8r358kv95y9qfg5wxpg3w/",
        "category": "Hypercasual",
        "tags": "Coloring, Drawing, Girls, Kids, Princess",
        "thumb": "https://img.gamemonetize.com/lchueh3gpki8r358kv95y9qfg5wxpg3w/512x384.jpg",
        "width": "504",
        "height": "800"
    },
    {
        "id": "47046",
        "title": "Idle Mine&amp;Merge",
        "description": "Dig into the mines and get deep discovering all the blocks that are underground, defeat various enemies and bosses to earn money and buy new weapons and tools to dig, merge them with each other and make them stronger!",
        "instructions": "- Click on enemies to kill them - Buy new weapon and tools - Click start to start digging",
        "url": "https://html5.gamemonetize.com/akqvrchqz6x75fqi4p0gt1wzq4hoidus/",
        "category": "Hypercasual",
        "tags": "2D, Block, Casual, Clicker, Collecting, Hypercasual, Mine, Minecraft, Miner",
        "thumb": "https://img.gamemonetize.com/akqvrchqz6x75fqi4p0gt1wzq4hoidus/512x384.jpg",
        "width": "960",
        "height": "540"
    },
    {
        "id": "44594",
        "title": "Violet Castle Clean",
        "description": "Violet Dream Castle Clean is a dress up game for girls. Help Violet fulfill her royal duties and make the princess look perfect before heading off to her special ball. Once youve chosen your dress and completed your look, youll see her carriage waiting outside. Its time for Princess Violet to perform her royal duties at the ball.",
        "instructions": "Tap or click",
        "url": "https://html5.gamemonetize.com/l1rfvumtqk9rs0rpj5895ub1bq3m5ymw/",
        "category": "Hypercasual",
        "tags": "Castle, Cleaning, Dress Up, Girls, Kids, Princess",
        "thumb": "https://img.gamemonetize.com/l1rfvumtqk9rs0rpj5895ub1bq3m5ymw/512x384.jpg",
        "width": "800",
        "height": "504"
    },
    {
        "id": "47219",
        "title": "Cube Sorting",
        "description": "In Sort Em All , your mission is to master the water sorting. Sort and merge the same color water in tubes with various shapes, using your strategic skills to solve each level. As you progress, the puzzles become more challenging, putting your brain to the ultimate test. Exercise your mental muscles and enjoy the satisfaction of finding the perfect sorting solution.",
        "instructions": "In Sort Em All your mission is to master the water sorting Sort and merge the same color water in tubes with various shapes using your strategic skills to solve each level As you progress the puzzles become more challenging putting your brain to th",
        "url": "https://html5.gamemonetize.com/qw2drs3mi8kpt5od04jlgced20168yxg/",
        "category": "Hypercasual",
        "tags": "3D, 3D Games, Adventure, Army, Ball",
        "thumb": "https://img.gamemonetize.com/qw2drs3mi8kpt5od04jlgced20168yxg/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "46736",
        "title": "Blackpink Formal Dance Party",
        "description": "Jennie, Lisa, Jisoo, and Rose from the famous K-pop group BLACKPINK are graduating from high school! Help each single one of them to get ready for the senior night by choosing delicate and stylish dresses with airy skirts. Use modern trends and classic looks. Dont forget to pamper up the hair and makeup for the prom. Have fun playing Blackpink Formal Dance Party on dressupwho.com",
        "instructions": "Use mouse and left click to browse around the game",
        "url": "https://html5.gamemonetize.com/ipjsh81sfc03kr2vh201sqyw4rrf959w/",
        "category": "Hypercasual",
        "tags": "2D, Anime, Barbie, Cartoon, Celebrity, Cute, Design, Dress Up, Fantasy, Fashion, Summer",
        "thumb": "https://img.gamemonetize.com/ipjsh81sfc03kr2vh201sqyw4rrf959w/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47181",
        "title": "Dodge Run 3D",
        "description": "Dodge Run 3D - Hyper casual Running Game is an addictive arcade game. you will fall in love with it! The game is very simple Well, enjoy the game time now! The game is very simple. You only need to slide the screen to control the person to run.in Each level Try to avoid obstacles and after few levels you unlock new skins .",
        "instructions": "Just swipe on screen to move click and Drag the Mouse Move left and right to avoid obstacles ",
        "url": "https://html5.gamemonetize.com/ly5no229118o0cw5ixv6hmnomhny809o/",
        "category": "Hypercasual",
        "tags": "3D, Hypercasual, Unity3D",
        "thumb": "https://img.gamemonetize.com/ly5no229118o0cw5ixv6hmnomhny809o/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "47157",
        "title": "Sky Race 3D",
        "description": "Sky Race 3D is an exhilarating and fast-paced mobile racing game that will keep you hooked with its thrilling gameplay and vibrant graphics. In this game, you take on the role of a competitive runner, participating in exciting races",
        "instructions": "Use Up arrow key to run The games intuitive controls and responsive gameplay make it easy to pick up and play ensuring an enjoyable experience for players of all ages and skill levels ",
        "url": "https://html5.gamemonetize.com/0la2poxsjgpf05legkfxk8obwkyeyyjo/",
        "category": "Hypercasual",
        "tags": "Adventure, Arcade, Casual, Hypercasual, Race, run",
        "thumb": "https://img.gamemonetize.com/0la2poxsjgpf05legkfxk8obwkyeyyjo/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "46717",
        "title": "Tiles Hops",
        "description": "follow the rhythm and use your musical reflexes to guide the ball from tiles to tiles. Touch, Hold and Drag the ball to make it jump on the Tiles.Dont miss it up because if you did you will start from the beggin.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/9mhho4zcgf3uxqd65hdpvmevfmapjlmg/",
        "category": "Hypercasual",
        "tags": "Action, Adventure, Arcade, Hypercasual",
        "thumb": "https://img.gamemonetize.com/9mhho4zcgf3uxqd65hdpvmevfmapjlmg/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46989",
        "title": "Hit The Skibidi",
        "description": "Hit The Skibidi is a fun game where you need to throw a diamond sword to Steve by tapping the screen at the right time. When you reach a score of 10, Steve transforms into Herobrine, and when you reach a score of 20, Herobrine turns into Skibidi Toilet, playing the magnificent song of Skibidi Toilet! Focus while throwing the swords and try to send them to empty spaces. Enjoy the game!",
        "instructions": "Just tap the screen when you want to throw diamond sword",
        "url": "https://html5.gamemonetize.com/1dv9otzttahq1mg82nean3qg6nnbtkr3/",
        "category": "Hypercasual",
        "tags": "Boy, Boys, Click, endless, Funny, Game, Games, Highscore, Hypercasual, Kid, Minecraft, Music, Turn Based",
        "thumb": "https://img.gamemonetize.com/1dv9otzttahq1mg82nean3qg6nnbtkr3/512x384.jpg",
        "width": "720",
        "height": "1280"
    }
]