[
    {
        "id": "50999",
        "title": "Egg Challenge",
        "description": "3, 2, 1, and start! Get ready for a fun challenge! In this game, you can play with 1, 2, or 3 players. The rules are very simple: just press the button and throw the eggs into the basket. In single-player mode, choose a time limit and try to throw 10 eggs into the basket within the selected time. In 2 and 3 player modes, be the winner of this competition by throwing 10 eggs into the basket before all your opponents. A fun and competitive game awaits you!",
        "instructions": "PLAYER 1 W PLAYER 2 J PLAYER 3 UP ARROW",
        "url": "https://html5.gamemonetize.com/o3393ixcsvl1ako9w4zpg7qnk2isq3ki/",
        "category": "Multiplayer",
        "tags": "1 Player, 2 Player, 2 Player Games, Animal, Funny, Kids, Race",
        "thumb": "https://img.gamemonetize.com/o3393ixcsvl1ako9w4zpg7qnk2isq3ki/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50908",
        "title": "Super Fighting Player",
        "description": "Super Fighting Player is all about intense multiplayer combat! Battle with up to 4 players online in this 2D fun cartoon-themed cross between Soldat and Halo.",
        "instructions": "Use W A S D to move and the Left Mouse Button To Shoot Middle Mouse Button For Grenade and Right Mouse Button For Melee Use Space For Jump ",
        "url": "https://html5.gamemonetize.com/bwstg0w9nyiwxg28uwqkbif74k3jd02b/",
        "category": "Multiplayer",
        "tags": "Action, Adventure, Fun, Gun, Multiplayer, Shoot, Shooter, Shooting",
        "thumb": "https://img.gamemonetize.com/bwstg0w9nyiwxg28uwqkbif74k3jd02b/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50966",
        "title": "Ducklings.io",
        "description": "Its time to relax, youre a duck now, Quack! Swim around and rescue as many ducklings as possible. Dodge the reckless boats, they will hurt you. Upgrade your home by retrieving more ducklings and get the coolest looking nest in the pond.",
        "instructions": "Mouse Keyboard Arrows Joypad",
        "url": "https://html5.gamemonetize.com/e1whjwhbyjsiaj82vmd60sgw9tk5370l/",
        "category": "Multiplayer",
        "tags": ".io Games, 3D, Animal, Collecting, Cool, Cute, Kid, Kids, Simulation, Skill, Slither, touch",
        "thumb": "https://img.gamemonetize.com/e1whjwhbyjsiaj82vmd60sgw9tk5370l/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48215",
        "title": "Far Orion",
        "description": "The year is 2121. Technology has advanced far beyond the bounds of our wildest fantasies, but great progress demands great sacrifice... Explore other worlds in the search for treasure and limitless power! Command a team of brave heroes and lead your world to victory!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ecfl6prpqgli1899z0kdy33gwtgbrqie/",
        "category": "Multiplayer",
        "tags": "1 Player, Adventure, Arena, Battle, Clans, Fight, Fighting, HTML5, Princess, RPG, WebGL, Witch, Wizard, World",
        "thumb": "https://img.gamemonetize.com/ecfl6prpqgli1899z0kdy33gwtgbrqie/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48847",
        "title": "Skibidi Online",
        "description": "Skibidi Online is a multiplayer shooter game! Shoot attacking Skibidi Toilets in PvP or CO-OP mode. Fight on 10 different maps with melee and ranged weapons.",
        "instructions": "Mouse click to attack WASD to move Space to jump E to equip weapon TAB to view stats",
        "url": "https://html5.gamemonetize.com/zsp6q6syr025l3eaypqw6rxm9myjqn39/",
        "category": "Multiplayer",
        "tags": ".io, .io Games, 3D, 3D Games, Action, Multiplayer, Shooter, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/zsp6q6syr025l3eaypqw6rxm9myjqn39/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46678",
        "title": "Snakes &amp; Ladders",
        "description": "one hundred squares full of traps and tricks Roll the dice and try you luck ladders will take you up but snakes will take you down ! This is a great game for a 100 day party! This game can be played atleast 2 players.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/4z7sfy67x4agxldckygr8twlwxghzvy5/",
        "category": "Multiplayer",
        "tags": "2 Player, Action, Adventure, Android, HTML5, Hypercasual, iPhone, Multiplayer",
        "thumb": "https://img.gamemonetize.com/4z7sfy67x4agxldckygr8twlwxghzvy5/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "47431",
        "title": "Pixel Pulling",
        "description": "Engage in an exhilarating rope pulling race and demonstrate your superiority by emerging victorious in five rounds. May luck be on your side as you embark on this thrilling and enjoyable the challenge!",
        "instructions": "Controls for the computer The W key makes the red character pull the rope the up arrow key makes the blue character pull the rope On touch devices The red and blue buttons on the screen make the character pull the string ",
        "url": "https://html5.gamemonetize.com/saezdmha5ddhhwkvk2y29kyrq81dxwuy/",
        "category": "Multiplayer",
        "tags": "2 Player, 2 Player Games, Click, Multiplayer",
        "thumb": "https://img.gamemonetize.com/saezdmha5ddhhwkvk2y29kyrq81dxwuy/512x384.jpg",
        "width": "1000",
        "height": "1000"
    },
    {
        "id": "47424",
        "title": "Zomblox.io",
        "description": "Multiplayer zombie survival game! Invite friends and defeat waves of zombies. Destroy loot boxes to get more powerful weapons. Play on 3 different maps or create your own maps using the level editor.",
        "instructions": "Move - WASD ARROWS Attack - MOUSE CLICK Jump - SPACE Pickup Weapon - E Show Stats - TAB",
        "url": "https://html5.gamemonetize.com/rha2cyp1q8590dx3imb4gx8b7p74ilo3/",
        "category": "Multiplayer",
        "tags": ".io, .io Games, Action, Multiplayer, Online, Zombie",
        "thumb": "https://img.gamemonetize.com/rha2cyp1q8590dx3imb4gx8b7p74ilo3/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47235",
        "title": "fall heroes Guys 3d",
        "description": "Fall Heroes Guys 3D! This exhilarating game is a fantastic blend of excitement and challenges, drawing inspiration from the beloved Fall Guys. In this thrilling 3D adventure, youll plunge into a whimsical world filled with daring obstacles, wacky characters, and intense multiplayer action! Join a hilarious cast of quirky Fall Heroes Guys as they compete in gravity-defying races and mind-bending obstacle courses. Navigate through dynamic landscapes, hopping, dashing, and tumbling your way to victory. But beware, the competition is fierce, and only the most skilled and strategic players will emerge triumphant!",
        "instructions": "Joystick To move",
        "url": "https://html5.gamemonetize.com/yocok5sw4zsau6c1881fo4znr39fx7m5/",
        "category": "Multiplayer",
        "tags": ".io, .io Games, 3D, 3D Games, Adventure, Arcade, Arena, Battlegrounds, Multiplayer, Race, Unity3D",
        "thumb": "https://img.gamemonetize.com/yocok5sw4zsau6c1881fo4znr39fx7m5/512x384.jpg",
        "width": "800",
        "height": "600"
    }
]