[
    {
        "id": "52221",
        "title": "NeedFor Race",
        "description": "Need For Race is a racing game. Enjoy unlimited racing with a variety of vehicles in the game. How many exciting races will you finish? Win races, save money, change or upgrade your car. Dont worry about running out of races, 3 different free maps are waiting for you!!",
        "instructions": "MOVE WASD OR ARROW KEYS NOS LEFT SHIFT CAMERA C HANDBRAKE SPACE ",
        "url": "https://html5.gamemonetize.com/p1zh6bcsu83hzcptbv7x0eubfnpk5l7d/",
        "category": "Racing",
        "tags": "1 Player, 3D, Action, Arcade, Best Games, Car, Cars, Crazy, Driving, free games for your website, Race, Racing, Traffic, unity games for your website",
        "thumb": "https://img.gamemonetize.com/p1zh6bcsu83hzcptbv7x0eubfnpk5l7d/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "52199",
        "title": "Hurry Ambulance",
        "description": "Hurry Ambulance is a fun driving game where you race through traffic in an ambulance. Collect powerups to finish your track. Explode cars in your path by crashing into them !!",
        "instructions": "Web Move Arrow Keys or WASD Nitro Space Mobile Only Touch the screen",
        "url": "https://html5.gamemonetize.com/yzqhfszxs3gciarf9qz6h38acj511nlz/",
        "category": "Racing",
        "tags": "1 Player, 3D, Action, Car, Cars, Driving, free games for your website, Racing, Traffic, unity games for your website, WebGL",
        "thumb": "https://img.gamemonetize.com/yzqhfszxs3gciarf9qz6h38acj511nlz/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "52198",
        "title": "Traffic Monster",
        "description": "Are you ready to drive fast on the highway? It&rsquo;s time to show your driving skills on high speed among the multitude of cars on the highway. All you have to do is to avoid colliding with other cars and collecting as many points as possible. You have at your disposal many car models, four game modes as a single player, 3 weather options and smooth car controls. Have fun!",
        "instructions": "- W or up arrow to accelerate - A D or left right arrow to steer car - Space bar to use handbrake",
        "url": "https://html5.gamemonetize.com/fnq9espr17eq3tl854i2lf6xxqyinvzk/",
        "category": "Racing",
        "tags": "3D, Action, Adventure, Car, Cars, Racing, Traffic",
        "thumb": "https://img.gamemonetize.com/fnq9espr17eq3tl854i2lf6xxqyinvzk/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "52130",
        "title": "Crazy Wheelie Motorider",
        "description": "Put on your helmet. A fun motor racing games with you. Get out of heavy traffic with the engine and earn the highest score and modify your Motorcycles.",
        "instructions": "MOVE WASD OR ARROW KEYS WHEELIE SHIFT",
        "url": "https://html5.gamemonetize.com/gnhpf2el1x0jrcm9mff5dyz3zjkwpx9q/",
        "category": "Racing",
        "tags": "3D, Boy, Boys, Car, Cars, free games for your website, games for your website, Hot, Moto, Motorcycle, Race, Racing, Traffic, unity games for your website",
        "thumb": "https://img.gamemonetize.com/gnhpf2el1x0jrcm9mff5dyz3zjkwpx9q/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "52097",
        "title": "TinyCars",
        "description": "Experience the adrenaline in pixel-art style with Tinycars, an exhilarating top-down racing game by Mapi. Ignite the tracks on 15 diverse circuits, competing against 6 rivals in this captivating arcade racing adventure. Employ every cunning maneuver at your disposal, including shortcuts, teleports, electric weapons, and nitro speed bursts, to outpace your opponents and etch your name in the hall of fame while unlocking even more thrilling tracks.",
        "instructions": "Mouse click or tap to play ",
        "url": "https://html5.gamemonetize.com/anvg9koxb58atul7n9hoafb9s5k42kjv/",
        "category": "Racing",
        "tags": "Arcade, drift, drifting, HTML, HTML5, html5 games for your site, Race, Racing",
        "thumb": "https://img.gamemonetize.com/anvg9koxb58atul7n9hoafb9s5k42kjv/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "52056",
        "title": "GT Cars Super Racing",
        "description": "Dive into the adrenaline-pumping world of GT Cars Super Racing, a game that pays homage to the classic arcade racing games of the 80s. Featuring fantastic gameplay and a precise car control system, the experience unfolds across 21 diverse circuits with numerous surprises awaiting discovery. Vibrant and detailed graphics, coupled with an impeccable car control system, deliver an immersive racing adventure. Revel in the engine sounds as you maintain optimal speed, strategically deploying the turbo for that crucial boost. With its compelling features, GT Cars Super Racing stands out as a top-tier rally arcade racing game.",
        "instructions": "Left Key Steer Left Right Key Steer Right P Key Pause Game Mouse Selection",
        "url": "https://html5.gamemonetize.com/i75jt7c82ftf8np80l2pzbco08iupk2y/",
        "category": "Racing",
        "tags": "Arcade, Cars, drift, Driving, Race, Racing, Supercars, Top Down",
        "thumb": "https://img.gamemonetize.com/i75jt7c82ftf8np80l2pzbco08iupk2y/512x384.jpg",
        "width": "1280",
        "height": "800"
    },
    {
        "id": "52036",
        "title": "Ultimate Speed Driving",
        "description": "Ultimate Speed Driving: A Realistic Racing Simulation Game Do you love driving fast and furious? Do you want to learn how to drift, speed, and fly with cool sports cars? Then Ultimate Speed Driving is the game for you! This game is easy to play and fun to master. You can choose from a variety of awesome cars and complete different challenges in a huge open world. Enjoy the stunning views along the way. Experience the adrenaline rush of high-speed racing and have fun!",
        "instructions": "On PC WASD move On Mobile Tap the buttons on the screen ",
        "url": "https://html5.gamemonetize.com/5w5vg2k07d4diw09qi0s4vivhtpchcz4/",
        "category": "Racing",
        "tags": "3D, Boys, Car, Casual, Obstacle, Simulation, Timing",
        "thumb": "https://img.gamemonetize.com/5w5vg2k07d4diw09qi0s4vivhtpchcz4/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "51994",
        "title": "Crazy City Race",
        "description": "Crazy City Race is a milestone in the genre of endless arcade racing. Drive your car through highway traffic, earn cash, upgrade your car and buy new ones. Endless racing is now redefined!",
        "instructions": "Arrow Keys",
        "url": "https://html5.gamemonetize.com/5gxamwjbqyril96u8f4v1tg86afkxsun/",
        "category": "Racing",
        "tags": "3D, Action, Arcade, Car, Cars, free games for your website, free html5 games for your website, Race, Racing, Traffic, unity games for your site, unity games for your website",
        "thumb": "https://img.gamemonetize.com/5gxamwjbqyril96u8f4v1tg86afkxsun/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "51905",
        "title": "Water City Racers",
        "description": "Water City Racers game is a 3D car racing game with various game modes. You can race against other cars, earn diamonds from all of these. Also you can explode vehicles in traffic and earn diamonds from those vehicles by having fun! Various super sports cars and very fun game modes are waiting for you! Lets play!",
        "instructions": "Move W A S D NOS SHIFT Look back T Fix cars position R Handbrake SPACE",
        "url": "https://html5.gamemonetize.com/0vvdg2deu0564yo8g4x3ed4yf16n60si/",
        "category": "Racing",
        "tags": "3D, Action, Adventure, Arcade, Car, car tuning, Casual, Race, Racing, Simulation",
        "thumb": "https://img.gamemonetize.com/0vvdg2deu0564yo8g4x3ed4yf16n60si/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "50770",
        "title": "Bike Rider Highway",
        "description": "Experience the thrill of high-speed motorcycle racing. Zoom past cars and trucks, evade traffic, and accelerate to incredible speeds. Collect various riders, capture and share your most spectacular crashes, and challenge friends in exhilarating online races. Personalize your motorcycle for the ultimate racing adventure on lightning-fast highways in Highway Rider! Website Developer <a href='https://www.playbestgames.online/'>https://www.playbestgames.online/</a>",
        "instructions": "AD left right SPACE brake ",
        "url": "https://html5.gamemonetize.com/gyl655ocml06pd9vvz21q61fpz20xezy/",
        "category": "Racing",
        "tags": "Android, Bike, HTML5, iPad, iPhone, Mentolatux, Mobile, Motorcycle, Racing, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/gyl655ocml06pd9vvz21q61fpz20xezy/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51851",
        "title": "Ambulance Driver 3D",
        "description": "Get behind the wheel and become an Ambulance Driver in this thrilling 3D game! Your mission is to race against the clock, navigating through city streets and picking up patients. Carefully maneuver your ambulance through traffic, reaching the hospital in record time. But be cautious! Every second counts, and avoiding accidents is crucial. Can you skillfully steer the ambulance, fulfill your duties, and save lives?",
        "instructions": "WASD or Arrow Button",
        "url": "https://html5.gamemonetize.com/z16ffybvskwtucq4vzlf24n3h5v872wl/",
        "category": "Racing",
        "tags": "1 Player, 3D, 3D Games, Hypercasual, Race, Timing",
        "thumb": "https://img.gamemonetize.com/z16ffybvskwtucq4vzlf24n3h5v872wl/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "51850",
        "title": "Huggy Jet Ski Racer 3D",
        "description": "Embark on a thrilling aquatic adventure with &lsquo;Huggy Jet Ski Racer&rsquo;! Dive into the excitement of 3D jet ski racing as you navigate through 18 challenging levels. Race against the clock to conquer each course, overcoming obstacles and detonating barriers along the way. Feel the rush of the wind and the splash of the waves as you aim to finish each level within the given time. Are you ready to rev up your jet ski, break through obstacles, and become the ultimate Huggy Jet Ski Racer?",
        "instructions": "WASD or Arrow Button Space Fire",
        "url": "https://html5.gamemonetize.com/8hh649c8v79bg5cbwcvx1l2o7k639ies/",
        "category": "Racing",
        "tags": "1 Player, 3D, 3D Games, Hypercasual, Race, Racing",
        "thumb": "https://img.gamemonetize.com/8hh649c8v79bg5cbwcvx1l2o7k639ies/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "51817",
        "title": "Motocross Jumper",
        "description": "Motocross Jumper game with realistic physics, fun and nice graphics!!! Motocross features many cool tricks, including multiple animation states depending on the bikers actions. Perform tricks, 360, wheelies, front ends and more. Control the bike as you perform cool tricks and pull off some in-air stunts. The mechanics include crash detection, with animations and various physics detection routines.",
        "instructions": "UP Accelerate LEFT Rotate Left Right Rotate Right Mouse To move in the",
        "url": "https://html5.gamemonetize.com/6isksqrzax6vpbdgz39vk72d4v33zdxw/",
        "category": "Racing",
        "tags": "Arcade, HTML5, jump, Jumping, Mobile, Motocross, Motorcycle",
        "thumb": "https://img.gamemonetize.com/6isksqrzax6vpbdgz39vk72d4v33zdxw/512x384.jpg",
        "width": "1024",
        "height": "600"
    },
    {
        "id": "51809",
        "title": "Rally Championship",
        "description": "Rally CHAMPIONSHIP is a fun classic 2D arcade racing game similar with the classic racing games of the 80s. Play ten different circuits to race in a car that runs automatically; unlock two or more powerful cards that are hidden and discover other features while playing. Use the turbo when you need an extra speed boost and set the best lap time. The game shows colorful and detailed graphics and a nice sound effects you will enjoy.",
        "instructions": "Left Turn Left Right Turn Right Down Brake Mouse to select in the menu ",
        "url": "https://html5.gamemonetize.com/lor9twj628e1nbr14vfjr59f89bqdexb/",
        "category": "Racing",
        "tags": "Arcade, Car, drift, drifting, Driving, HTML5, Mobile, Racing, Sport",
        "thumb": "https://img.gamemonetize.com/lor9twj628e1nbr14vfjr59f89bqdexb/512x384.jpg",
        "width": "1024",
        "height": "800"
    },
    {
        "id": "51688",
        "title": "The Racing Crew",
        "description": "Keep your finger to the floor and be ready for absolutely anything in this ridiculously entertaining mobile racing game where you really never know what&rsquo;s around the next corner. Fine tune your ride, keep your foot on the gas, dodge the endlessly varied obstacles, and try to keep out the way of your equally manic rivals in super-fast, super-exciting, psychedelic races that always offer something new and unexpected. Feel the need for speed?",
        "instructions": "Use Arrow Keys to control the car and Drag mouse for camera",
        "url": "https://html5.gamemonetize.com/m13bpia73gypx425z4xglyjm168zj7zn/",
        "category": "Racing",
        "tags": "3D, 3D Games, Best, Best Games, Cars, drift, drifting, New, Race, Racing, Simulation, Simulator, Supercars, Unity3D",
        "thumb": "https://img.gamemonetize.com/m13bpia73gypx425z4xglyjm168zj7zn/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "51610",
        "title": "Taxi time",
        "description": "Taxi Time is an immersive game that demands players&rsquo; skillful control and strategic thinking. Get ready for a smooth journey along the highway, collect all the stars, and avoid straying off the track to achieve success!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/hdu654b2p3zp7uwlzfjdbk12zc00ik8v/",
        "category": "Racing",
        "tags": "1 Player, 2D, Action, Arcade, Car, Cars, drift, drifting, free html5 games for your website, HTML, Race",
        "thumb": "https://img.gamemonetize.com/hdu654b2p3zp7uwlzfjdbk12zc00ik8v/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "51631",
        "title": "Bike Stunt BMX Simulator",
        "description": "Ride your BMX on big ramps and get crazy air, or get technical with street skating. Do huge flips and stunts, or chain together awesome combos with manuals, grinds and wallrides. The choice is yours with 7 different skate parks made with inspiration from all around the world. You can even create your very own skate parks to ride! Both your rider and your BMX bike are fully customizable, with tons of options to make yours absolutely unique!",
        "instructions": "WASD - move Shift - sprint Space - jump",
        "url": "https://html5.gamemonetize.com/wn95132kglrwr3ot49d3pb41ke0ckcp4/",
        "category": "Racing",
        "tags": "Bicycle, Bike, Physics, Racing, Simulation, Simulator",
        "thumb": "https://img.gamemonetize.com/wn95132kglrwr3ot49d3pb41ke0ckcp4/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51556",
        "title": "Tuk Tuk Rikshaw Parking",
        "description": "Tuk Tuk Auto Rickshaw Parking Game 2024 &ndash; Experience The New Adventure in Tuk Tuk Auto Rickshaw Games 2024 It is a common perception that Tuk Tuk Auto Rickshaw Games 2023 is all about racing games only. With the advancement of technology, developers have explored new and exciting phases of these games. Tuk Tuk Auto Rickshaw Parking game 2024 is the new face of adventure. You can enjoy a new venture other than a Tuk Tuk Auto Rickshaw racing game. These Parking Games 2024 are available online and you can download them on your devices as well. Let&rsquo;s try to learn about the exciting features of these Parking Games.",
        "instructions": "Keyboard Arrow Controls",
        "url": "https://html5.gamemonetize.com/mksxtod2y0fafx23x99ofmobfrq2xr95/",
        "category": "Racing",
        "tags": "3D, 3D Games, Boy, Boys, Car, Cars, Parking, Race, Racing, Simulation, Simulator, Unity3D",
        "thumb": "https://img.gamemonetize.com/mksxtod2y0fafx23x99ofmobfrq2xr95/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51498",
        "title": "Ball Run Jumper 3D",
        "description": "This exciting and thrilling 3d endless game will have you competing with your friends to see who can make the highest score. Race your way through the 3d environment collecting coins, boosters, and power-ups to help you along the way, Unlock new opportunities and characters as you progress, and show off your score on your friends. Play now and get your friends involved in Ball Jumper Race 3d",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/qo28o62wvf4rvpkyvrziytav7zo32ipy/",
        "category": "Racing",
        "tags": "Adventure, Ball, Race, Racing",
        "thumb": "https://img.gamemonetize.com/qo28o62wvf4rvpkyvrziytav7zo32ipy/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "47167",
        "title": "Pixel Racers",
        "description": "Challenge your friends in thrilling races to determine the fastest. Complete the round three times to claim victory. Get ready for an exciting gaming experience and may the best racer win! Have fun and enjoy the game!",
        "instructions": "Keyboard Up arrow key Down arrow key Left arrow key Right arrow key W A S D Mobile Arrow keys that appear on the screen",
        "url": "https://html5.gamemonetize.com/iv1ljto5akj90d0jq9lsxuf1tg4fdopr/",
        "category": "Racing",
        "tags": "2 Player, Car, Drawing, Race, Racing",
        "thumb": "https://img.gamemonetize.com/iv1ljto5akj90d0jq9lsxuf1tg4fdopr/512x384.jpg",
        "width": "2000",
        "height": "1600"
    },
    {
        "id": "51123",
        "title": "Tanks of the Galaxy",
        "description": "Break into the world of thrilling 2D top-down shooter Tanks of the Galaxy and take part in epic tank battles! The rules are simple: destroy enemy tanks with different weapons, dodge their projectiles, use shields and environment to defeat the enemy. Earn coins to upgrade your tank, buy and upgrade more powerful weapons. Enjoy truly addictive gameplay and become the most devastating member of the tank war!",
        "instructions": "WASD arrow keys move Space switch weapon Left-click shoot Move mouse aim",
        "url": "https://html5.gamemonetize.com/3bvyq1w5frfw2whnz8mdmspkjhh0ufqj/",
        "category": "Racing",
        "tags": "Battle, Race, Racing, Tank, Tanks",
        "thumb": "https://img.gamemonetize.com/3bvyq1w5frfw2whnz8mdmspkjhh0ufqj/512x384.jpg",
        "width": "960",
        "height": "540"
    },
    {
        "id": "51352",
        "title": "Drift No Limit: Car Racing",
        "description": "Welcome to the world of adrenaline drift racing! Are you ready to plunge into incredible adventures on the asphalt? Game Features Huge vehicle fleet: choose from numerous powerful cars, each of which has its own character and features. From classic sports cars to exotic race cars, the possibilities are endless! Car tuning: Pump and customize your car down to the smallest detail. Prepare for street battles by customizing the engine, suspension, aerodynamics and even the color of your car. Multiple cities to play in the open world: a variety of locations. Explore fascinating cities full of secret streets and incredible drift spots.",
        "instructions": "The car is controlled using the keyboard and on-screen buttons Main control buttons arrows for driving a car space - handbrake",
        "url": "https://html5.gamemonetize.com/dhgq49zx1c1bysozsv022edrspueuef6/",
        "category": "Racing",
        "tags": "Cars, drift, drifting, Driving, Race, Racing",
        "thumb": "https://img.gamemonetize.com/dhgq49zx1c1bysozsv022edrspueuef6/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "51415",
        "title": "Hard Wheels Winter 2",
        "description": "Control a monster truck and pass many challenging obstacles in Hard Wheels Winter 2. Get to the finish without crashing to earn coins and upgrade the truck.",
        "instructions": "Desktop Arrow keys or W A S D to control the monster truck Mobile Use on-screen buttons to drive ",
        "url": "https://html5.gamemonetize.com/eg6q3rmzewxldnbltt9180ncdi6gnt11/",
        "category": "Racing",
        "tags": "Android, Car, Cars, Driving, HTML5, iPhone, Mobile, monstertruck, Obstacle, offroad, Truck, vehicle",
        "thumb": "https://img.gamemonetize.com/eg6q3rmzewxldnbltt9180ncdi6gnt11/512x384.jpg",
        "width": "900",
        "height": "506"
    },
    {
        "id": "51356",
        "title": "Ultimate Flying Car 2",
        "description": "The ultimate adventure continues with the super flying cars in a huge city with lots of features in the 2nd chapter of the series! This version will bring more features, more stable and fun car physics, more explosives, and more actions. The fastest cars of all time will meet you in this game. Newly designed wings and super cool flying physics will be also ready to be used during the adventure. Wins races, collect diamonds and coins and buy new cars to make your 2 player adventure more fun, greater, and more fun than before. Lets get this super adventure started!",
        "instructions": "Player 1 Move W A S D or ARROW KEYS Only in 1P Mode NOS L-SHIFT Explode F Camera C Look back T Reset R Player 2 Move ARROW KEYS NOS M Explode J Camera O Look back L Reset U",
        "url": "https://html5.gamemonetize.com/3knzad0dhfc1tpsvjykwljw0yq1g1lmm/",
        "category": "Racing",
        "tags": "2 Player, 3D, Action, Adventure, Car, car tuning, fly, Race, Simulation, Simulator, Supercars",
        "thumb": "https://img.gamemonetize.com/3knzad0dhfc1tpsvjykwljw0yq1g1lmm/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51085",
        "title": "TopBike Racing &amp; Moto 3D Bike 2023",
        "description": "Get your ride and explore aTopBike Racing &amp; Moto 3D Bike 2023 ! Compete against other players around the world on the beautiful trails in the desert, swamp and forest. Engage with Red Bull athletes, get real-brand bikes &amp; gear.Feel the adrenaline overload as you start racing against the biker gangs that rule The City. They are the famous 1%, the outlaw bike racers who thrive on crime and their need for the rush of speed. They believe that all of the best things in the world are for free (when you take them forcibly) and that having fun in life is the only thing that matters. Except for power and money, of course",
        "instructions": "Use KeyBoard Button To Controll TopBike Racing amp Moto 3D Bike 2023",
        "url": "https://html5.gamemonetize.com/t0kqw1h50dh3xvct31dddn8j66619s2n/",
        "category": "Racing",
        "tags": "3D Games, Action, Adventure, amazing, atv, Baby Games, Best Games, Bike",
        "thumb": "https://img.gamemonetize.com/t0kqw1h50dh3xvct31dddn8j66619s2n/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50989",
        "title": "Funny Mad Racing",
        "description": "This is the adventure of bouncy cars on the bouncy roads with the Funny Mad Racing game! The game consists of 40 levels various cars and various surprising funny features that you will encounter during your adventure. You can play this great and fun hill-climbing adventure in 2 player mode besides of 1 player mode. Earn coins and unlock new features. Challenge a friend and double your fun! Let the adventure begin in the pixel world!",
        "instructions": "Player 1 W A S D Player 2 ARROW KEYS",
        "url": "https://html5.gamemonetize.com/oba2cgdvjemwvvloq5rnjr4ej7wjtksr/",
        "category": "Racing",
        "tags": "2 Player, 2 Player Games, 3D, Adventure, Arcade, atv, Car, monstertruck, Skill, Sports, Supercars, Truck, WebGL",
        "thumb": "https://img.gamemonetize.com/oba2cgdvjemwvvloq5rnjr4ej7wjtksr/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "50706",
        "title": "Blob Bridge Run",
        "description": "In the Blob Bridge Run game, collect water droplets of your own color, build bridges to move to the next platform and try to finish the race first. Watch out for traps and opponents that will disperse the droplets during the race! With each level, the opponents are getting stronger, so get started now and compete for first place!",
        "instructions": "WASD or ARROW KEYS",
        "url": "https://html5.gamemonetize.com/52h628dmeiaqe7e12qy0m76aafslkpr1/",
        "category": "Racing",
        "tags": "Fun, Funny, running, Stickman",
        "thumb": "https://img.gamemonetize.com/52h628dmeiaqe7e12qy0m76aafslkpr1/512x384.jpg",
        "width": "1920",
        "height": "1080"
    },
    {
        "id": "50806",
        "title": "GT Car Stunts Legends",
        "description": "Experience the thrill of extreme stunt driving in Ramp Car Games: GT Car Stunts! You can choose from 8 different cars and explore the open-world mode to get familiar with them. Then you can take on 20 challenging levels in Classic mode and Obstacle mode, where you need to perform amazing stunts and tricks. You can switch the car attachments to suit your needs and preferences. Enjoy the stunning graphics and physics of this game and earn gems to unlock more cars and levels. Have fun!",
        "instructions": "On PC WASD or Arrow keys move Space hand brake LShift boost nitro On Mobile Tap buttons on the screen ",
        "url": "https://html5.gamemonetize.com/afach7283ov5gvxv5eugcrsev4omg8fq/",
        "category": "Racing",
        "tags": "3D, Boys, Car, Casual, Driving, Kids, Simulation",
        "thumb": "https://img.gamemonetize.com/afach7283ov5gvxv5eugcrsev4omg8fq/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "50945",
        "title": "Car Stunt Raching",
        "description": "In this exciting game you will have to drive your car as quickly as possible along different tracks, while performing breathtaking stunts. Get ready to overcome sharp turns and springboards, dodge swinging hammers and drive through loops, perform other equally difficult car stunts, be prepared to skid the car on sharp turns of the track. To confidently overcome all elements of the track, you will need to gain some experience and understand the real physics of the car&rsquo;s behavior. Prize coins received for completing the track can be spent on upgrading your car or opening a new race track.",
        "instructions": "Keyboard left-right turn the steering up gas pedal down brake pedal c camera Mouse mouse left-right turn the steering left mouse button gas pedal right mouse button brake pedal",
        "url": "https://html5.gamemonetize.com/m7do60m9yl1bdnv88bn57rlmec5kh1ni/",
        "category": "Racing",
        "tags": "Cars, Racing, Stunts",
        "thumb": "https://img.gamemonetize.com/m7do60m9yl1bdnv88bn57rlmec5kh1ni/512x384.jpg",
        "width": "800",
        "height": "480"
    },
    {
        "id": "50946",
        "title": "Offroad Life 3D",
        "description": "A life on the mountains with huge vehicles with huge wheels is beginning with the Offroad Life 3D game! This adventure will be in the different places of the world under the different seasons from autumn to summer. Various offroad vehicle options and various wheel options are available with this great adventure. Embark on this adventure with your friend in 2 player game mode and discover new areas together!",
        "instructions": "Player 1 W A S D or ARROW KEYS Only in 1P Mode Player 2 ARROW KEYS",
        "url": "https://html5.gamemonetize.com/wogcifp7lkset5tfyefzu4gmq2er0i75/",
        "category": "Racing",
        "tags": "1 Player, 2 Player, 2 Player Games, 3D, 3D Games, atv, Car, Driving, HTML5, offroad, Race, Simulation, Simulator, Supercars",
        "thumb": "https://img.gamemonetize.com/wogcifp7lkset5tfyefzu4gmq2er0i75/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50847",
        "title": "Santa And The Chaser",
        "description": "Hey Santa needs Your help to escape from the Chaser! Avoid all obstacles and try to resit the more you can! try to complete all 20 Levels to go back in to the North Pole! Enjoy this Christmas season with this great arcade game!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/90z8416bi2017am0ufwtu4j0itbvezob/",
        "category": "Racing",
        "tags": "Christmas, HTML5, Mobile, running, Santa, Santa Claus",
        "thumb": "https://img.gamemonetize.com/90z8416bi2017am0ufwtu4j0itbvezob/512x384.jpg",
        "width": "1024",
        "height": "768"
    },
    {
        "id": "50796",
        "title": "Turbo Racing 3D HTML5",
        "description": "Navigate swiftly through rapid courses and passageways. Collide with rival vehicles to eliminate them from the race. Seize the advantage by soaring off the track for a quicker route. Craving velocity? Prepare, Position, Proceed! Website Developer <a href='https://th.kizi10.org'>https://th.kizi10.org</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/u9757y54l74izica7dvrbj6wtg58njes/",
        "category": "Racing",
        "tags": "Android, Cars, Driving, fly, HTML5, iPad, iPhone, Mentolatux, Mobile, Racing, Supercars, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/u9757y54l74izica7dvrbj6wtg58njes/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50498",
        "title": "Super Traffic Racer",
        "description": "Super Traffic Racer is a milestone in the genre of endless arcade racing. Drive your car through highway traffic, earn cash, upgrade your car, and buy new ones. Try to be one of the fastest drivers in the global leaderboards. Endless racing is now redefined!",
        "instructions": "Touch the screen or use the arrow keys",
        "url": "https://html5.gamemonetize.com/a5w7favv4e53hhyfev78m7xs0dcefnew/",
        "category": "Racing",
        "tags": "1 Player, 3D, 3D Games, Action, Arcade, Best Games, Cars, Casual, Traffic",
        "thumb": "https://img.gamemonetize.com/a5w7favv4e53hhyfev78m7xs0dcefnew/512x384.jpg",
        "width": "800",
        "height": "480"
    },
    {
        "id": "49006",
        "title": "Runner Blob 3D",
        "description": "Your task is to run with Blob Giant on the platform and collect all the jelly people scattered on the platform. Collect The more jelly there are, the bigger the body of Blob Giant will be. It is worth noting that at the end of the platform, you will make a jump to the sky. How much reward can you get? Are you ready to challenge Blob Giant?",
        "instructions": "mouse",
        "url": "https://html5.gamemonetize.com/t391p9c2c1kbj0270jlqoyua7ll7pd6d/",
        "category": "Racing",
        "tags": "1 Player, 3D, 3D Games, Blood, Stickman, Superhero, WebGL",
        "thumb": "https://img.gamemonetize.com/t391p9c2c1kbj0270jlqoyua7ll7pd6d/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49095",
        "title": "Moto Stuntman",
        "description": "Test your motorcycle racer skills on tracks with different terrain, environments and moving elements in the Moto Stuntman game. You have to race through unique landscapes and overcome natural obstacles to reach the finish line. Driving powerful motorcycles, perform stunts to win extra seconds and set the best time. Enjoy a dizzying adventure on the surface of the earth and descending into its depths, but do not forget about caution on the way to victory!",
        "instructions": "The W key or the up arrow is gas The S key or the down arrow is the brake Using the A D keys or the right left arrows on the keyboard you can rotate the motorcycle and perform a somersault ",
        "url": "https://html5.gamemonetize.com/n78m9ciolokfgxn1g68vg7qrxvb56yso/",
        "category": "Racing",
        "tags": "Arcade, Bike, Crazy, Levels, Mobile, Moto, Motocross, Motorcycle, offroad, Race, Racing, Stunts",
        "thumb": "https://img.gamemonetize.com/n78m9ciolokfgxn1g68vg7qrxvb56yso/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "48555",
        "title": "Boat Merge &amp; Race",
        "description": "Enjoy the fun of Boat Merge &amp; Race, a 3D arcade racing game that lets you control your own boat. You can merge two identical boats to get a faster and stronger boat. You can also join the race, collect gold coins, and beat the AI opponents to finish each level. You will have 50 boats to collect and 17 props to upgrade. You will also have to keep your boat afloat on the water. Boat Merge &amp; Race is a game that will challenge your speed and strategy. Don&rsquo;t miss this amazing game!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/sliv5kkeswhex1s31846uoq5ik2o43j6/",
        "category": "Racing",
        "tags": "Boat, Boys, Casual, Girls, Kids, Matching",
        "thumb": "https://img.gamemonetize.com/sliv5kkeswhex1s31846uoq5ik2o43j6/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "41003",
        "title": "Monster Truck Wheels Winter",
        "description": "Play monster truck driving game Monster Truck Wheels Winter edition. Winter is a good season to test your trucks off-road abilities. So put large off-road wheels on the truck and get ready for a crazy ride over snowy mountains, vehicles, bridges and other obstacles on the track. Try to keep the monster truck balanced and complete the track as fast as possible to earn more score points and unlock various achievements. Each level gets harder, so be patient and explore what driving strategy is best for current obstacle. Play this cool monster truck driving game Monster Truck Wheels Winter online for free on any mobile device or computer.",
        "instructions": "Use arrow keys to drive or touch buttons on your devices ",
        "url": "https://html5.gamemonetize.com/bh69guvcxigqbpmsg4n6pa8bbrrvzfhn/",
        "category": "Racing",
        "tags": "1 Player, Best, Car, Cars, Driving, Fun, HTML5, Hypercasual, Mobile, Skill, Snow, Truck, Winter",
        "thumb": "https://img.gamemonetize.com/bh69guvcxigqbpmsg4n6pa8bbrrvzfhn/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "50502",
        "title": "Muscle Runner Rush Race 3D",
        "description": "No muscle No life! Collect your own color dumbbell and Build up your body !! You break through the some gimmick to the goal using your toughness muscle!! Aim at the goal earlier than anyone else!!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/gh93wubjimxyltsczz7nm3jvj81vis8p/",
        "category": "Racing",
        "tags": ".io Games, Best Games, Game, Games, Race, Racing",
        "thumb": "https://img.gamemonetize.com/gh93wubjimxyltsczz7nm3jvj81vis8p/512x384.jpg",
        "width": "350",
        "height": "600"
    },
    {
        "id": "50322",
        "title": "City Cash Race",
        "description": "The ultimate and fun arcade chase game! Race through vibrant cityscapes, grab cash, evade police, and upgrade your car. Become the City Cash King!",
        "instructions": "W up arrow key accelerate S down arrow key brake A left rrow key steer left D right arrow key steer right ",
        "url": "https://html5.gamemonetize.com/axkbjtkr9iufp3wzgpm1yagdghg2sfva/",
        "category": "Racing",
        "tags": "1 Player, 3D, Car, Racing, Top Down",
        "thumb": "https://img.gamemonetize.com/axkbjtkr9iufp3wzgpm1yagdghg2sfva/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50410",
        "title": "City Bus Parking Challenge Simulator 3D",
        "description": "Welcome to the ultimate test of precision driving skills in the bustling urban environment! City Bus Parking Simulator Challenge 3D offers an immersive and thrilling gaming experience where you take on the role of a skilled bus driver tasked with navigating through complex cityscapes and parking your bus in tight spots.",
        "instructions": "WASD or arrow keys for directions Space for Break ",
        "url": "https://html5.gamemonetize.com/m7s1352stf1vcozi4ve5311rj4rete5i/",
        "category": "Racing",
        "tags": "bus, Car, city, Parking, Race, Racing, Simulation, Simulator",
        "thumb": "https://img.gamemonetize.com/m7s1352stf1vcozi4ve5311rj4rete5i/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50345",
        "title": "Wheel Draw Master",
        "description": "Unique Levels: Explore a variety of captivating and unique levels. Realistic Physics: Experience true-to-life bicycle physics for an authentic riding feel. Power Up Your Ride: Use power-ups to turbocharge your bicycle and conquer obstacles! &zwj; Choose Your Rider: Visit the Skin Shop and unlock all riders! Daily Rewards: Play every day to claim exciting rewards! Climb the Leaderboard: Compete with players worldwide and aim for the top spot on the leaderboard!",
        "instructions": "Draw bicycle wheels to win the race The wheels can be changed throughout the race Get to the finish line first Have fun ",
        "url": "https://html5.gamemonetize.com/ntlis8v4wcl7cf9u32yevx6w6zofcyzq/",
        "category": "Racing",
        "tags": "3D, Arcade, Best, Best Games, Bicycle, Bike, BMX, BMX Games, Brain, Casual, Christmas, Draw, Drawing, Racing",
        "thumb": "https://img.gamemonetize.com/ntlis8v4wcl7cf9u32yevx6w6zofcyzq/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "50214",
        "title": "Mad Truck Driving",
        "description": "Do you love driving trucks and crushing cars? Then you will enjoy Mad Truck Driving, the best 2D driving game ever! This game lets you drive a powerful truck through various obstacles and challenges! You will be amazed by the interesting graphics and exciting sound effects! Don&rsquo;t worry about the cars in front of you, just smash them with your truck! Your truck is unstoppable! But can you overcome the different obstacles and complete the levels? Try Mad Truck Driving now and start your adventure!",
        "instructions": "WASD drive four directions",
        "url": "https://html5.gamemonetize.com/pj997lwxryci1jh3fbsa3jf1kttsp5ut/",
        "category": "Racing",
        "tags": "Avoid, Boys, Car, Collecting, Girls, Kids, monstertruck, Truck",
        "thumb": "https://img.gamemonetize.com/pj997lwxryci1jh3fbsa3jf1kttsp5ut/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "50301",
        "title": "Crazy Traffic Racer",
        "description": "Introducing an adrenaline-pumping car driving game that will push your driving skills to the limit. Powered by a cutting-edge 3D game engine, this game delivers a realistic and immersive experience like no other.Crazy Traffic Racer boasts stunning graphics and realistic physics, immersing you in a world filled with heart-stopping moments and breathtaking scenery. With intuitive controls and responsive gameplay, youll feel every twist, turn, and crash as if you were behind the wheel yourself.",
        "instructions": "Controls Desktop W or up arrow key - accelerate A or left arrow key - turn left D or right arrow key - turn right S or down arrow key - brake Controls Mobile Tablet Left button - turn left Right button - turn right Two buttons - brake",
        "url": "https://html5.gamemonetize.com/4yc7lfrhlx6p4bp57uw4su86itmq27ij/",
        "category": "Racing",
        "tags": "1 Player, 3D, 3D Games, Car, Cars, Crazy, Fun, Mobile, Race, Racing, Traffic",
        "thumb": "https://img.gamemonetize.com/4yc7lfrhlx6p4bp57uw4su86itmq27ij/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50267",
        "title": "Car Rapide",
        "description": "Car Rapide is a one-finger game. Its an endless game in portrait mode Race your car, avoid obstacles, collect coins and unlock upgrades and other vehicles. Race your van through the streets of Africa. Get multipliers and power-ups to jump higher, fly and... shoot slippers. Car Rapide is a flappy-style one-finger game. By purchasing new cars with the collected coins you will gain fantastic powers.",
        "instructions": "Car Rapide is a one-finger game Tap to jump and fly Race your car avoid obstacles collect coins and unlock upgrades and other vehicles ",
        "url": "https://html5.gamemonetize.com/b8ncavzg34mugfpzklzi2ykmay78xww4/",
        "category": "Racing",
        "tags": "1 Player, Car, Casual",
        "thumb": "https://img.gamemonetize.com/b8ncavzg34mugfpzklzi2ykmay78xww4/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "49788",
        "title": "2D Car Racing 2023",
        "description": "In the thrilling 2D Car Racing 2023 game, players are thrust into the fast-paced world of highway racing. Your objective? Collect as many coins as possible while skillfully avoiding collisions with other cars. Every crash is a failure, so youll need to showcase your impeccable driving skills to stay in the game. Successfully navigating the highway, collecting points, and amassing coins will be your ticket to victory in this high-speed racing adventure! Website Developer <a href='https://it.kizi10.org'>https://it.kizi10.org</a>",
        "instructions": "use the button to play for mobile and for PC version left and right AD and nitro W",
        "url": "https://html5.gamemonetize.com/fntrmrwbdjjlht8d9c9ie8ot5ecy9tqn/",
        "category": "Racing",
        "tags": "Android, Car, HTML5, iPad, iPhone, Mentolatux, Mobile, Racing, Unity3D",
        "thumb": "https://img.gamemonetize.com/fntrmrwbdjjlht8d9c9ie8ot5ecy9tqn/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50103",
        "title": "Impossible Track Car Stunt Racing Game",
        "description": "Get ready for an adrenaline-pumping experience like no other in the Impossible Track Car Stunt Racing Game! Push the limits of gravity-defying stunts as you navigate treacherous tracks suspended high above the ground. Choose from a fleet of high-performance sports cars, each finely tuned for precision control and speed. With its realistic physics and responsive handling, youll feel every twist and turn as you race against time to conquer the most challenging tracks ever devised. Dare to defy gravity on mind-bending loops, jaw-dropping jumps, and dizzying spirals that will test even the most seasoned racers.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/92cnyu9gzfsflrhyp2xh3pn18wxa6a12/",
        "category": "Racing",
        "tags": "Best Games, Cars",
        "thumb": "https://img.gamemonetize.com/92cnyu9gzfsflrhyp2xh3pn18wxa6a12/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50030",
        "title": "Balanced Running",
        "description": "Time to show your skills by making a puppet walk in the Balanced Walking game! This walk will be a little hard at first. You should decide how long you need to hold the button very carefully. If you hold too much the character will make a long step and this may cause fail. Try to make your steps balanced and get the character to the finish! You can play this challenge in 2 player mode and have much more fun with your friend! Lets get it begun!",
        "instructions": "Player 1 W You can use UP ARROW in 1 Player Mode either Player 2 UP ARROW",
        "url": "https://html5.gamemonetize.com/uvx55w0gpfu7vc75h0ga0u4uhmpf1cnv/",
        "category": "Racing",
        "tags": "2 Player, 3D, Casual, Hypercasual, run, running",
        "thumb": "https://img.gamemonetize.com/uvx55w0gpfu7vc75h0ga0u4uhmpf1cnv/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49647",
        "title": "Sky Driver Stunts 2024",
        "description": "In the adrenaline-fueled world of extreme sports, Sky Driver Stunts 2024 takes the cake for sheer audacity and spectacle. Set against a backdrop of stunning vistas, this event features the worlds best skydiving professionals performing jaw-dropping aerial manoeuvres while free-falling from staggering. The 2024 edition promises advancements in safety gear, allowing for even more daring stunts that defy the laws of gravity. Website Developer <a href='https://www.kizi10.org/'>https://www.kizi10.org/</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/qnfvjli9huwzhjtgk4ip0r7lbg6gzz0u/",
        "category": "Racing",
        "tags": "1 Player, Car, Driving, Game, Mentolatux, Stunts, Supercars, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/qnfvjli9huwzhjtgk4ip0r7lbg6gzz0u/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49756",
        "title": "Amazing Car Stunt Track",
        "description": "Welcome to the world of real impossible tracks car racing games. Enjoy the real impossible track race on the endless extreme impossible tracks in the sky highs. If you are a fast speed racer and have a passion for car racing games then be ready to experience the real car rally in the mid of sky with no limits. Rush like a crazy stunt master while riding the beautifully designed real impossible tracks",
        "instructions": "WASD - Drive Space - Brake",
        "url": "https://html5.gamemonetize.com/s7wchbbmzyk30x7fjx0e4t5i7m3lts28/",
        "category": "Racing",
        "tags": "1 Player, 3D, 3D Games, Best, Boy, Boys, Car, Cars, Driving, HTML5, Race, Racing, Simulator, WebGL",
        "thumb": "https://img.gamemonetize.com/s7wchbbmzyk30x7fjx0e4t5i7m3lts28/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "49661",
        "title": "Multiplayer Car Crash Simulator",
        "description": "In this thrilling online car game, join other players in real-time and collide on the city streets! Showcase your skills by overcoming the citys destructive obstacles. With detailed urban landscapes and interactive social features, become the ultimate car driver in this adrenaline-pumping game!",
        "instructions": "W forward S backward A left D right Space bar - handbrake Shift - nitro C - camera change The rest is through the game interface ",
        "url": "https://html5.gamemonetize.com/xcqyr29d7xsdmtw92nnkt4i7n3ov2xf5/",
        "category": "Racing",
        "tags": "1 Player, 3D, Action, Boy, Cars, crash, drift, drifting, Race, Racing, Simulation, Truck, vehicle, WebGL",
        "thumb": "https://img.gamemonetize.com/xcqyr29d7xsdmtw92nnkt4i7n3ov2xf5/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "49619",
        "title": "Night Neon Racers",
        "description": "Night Neon Racers game is a 3D car racing game with various game modes. You can race against other cars or you can drift as much as you want and earn diamonds from all of these. The game also has a car blasting mode to explode vehicles in traffic and earn diamonds from those vehicles while having fun! Various super sports cars and very fun game modes are waiting for you! Lets play!",
        "instructions": "Move W A S D or ARROW KEYS Nos LSHIFT Spawn R ",
        "url": "https://html5.gamemonetize.com/zrsbiulgpzj75g68zwldhd9s1edzttil/",
        "category": "Racing",
        "tags": "3D, Action, Arcade, Cars, crash, drift, drifting, Driving, gta, Race, Racing, Simulator, Supercars, vehicle",
        "thumb": "https://img.gamemonetize.com/zrsbiulgpzj75g68zwldhd9s1edzttil/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49558",
        "title": "Impossible Car Parking Master 2023",
        "description": "Impossible Car Parking Master is a mobile parking game that challenges players to park their cars in tight and difficult spaces. The parking game features various levels with increasing difficulty, where players must maneuver their car into a designated parking spot while avoiding obstacles and other cars. The game features realistic graphics and physics, making it challenging to park in tight spaces. The goal of the game is to master the art of parking cars in challenging situations and achieve the highest score. Game Features: Realistic vehicle physics Different levels with increasing difficulty Different controls",
        "instructions": "Use W A D and Arrow Keys to Move the Car Use Num 0 or N for Netural Use Num 1 or E for Acceleration Use Num 2 or R for Reverse ",
        "url": "https://html5.gamemonetize.com/ymkvkw8wag3u9m1212sqj135hg0ewycf/",
        "category": "Racing",
        "tags": "1 Player, 3D, 3D Games, Best Games, Car, Parking, Stunts",
        "thumb": "https://img.gamemonetize.com/ymkvkw8wag3u9m1212sqj135hg0ewycf/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49115",
        "title": "Impossible Tracks 2D",
        "description": "Impossible Tracks 2D is an exciting 2D game where you will encounter a series of tricky levels. Each level is packed with challenging obstacles that will test your skills and reflexes. Navigate these treacherous tracks and conquer the obstacles to reach the finish line. Get ready for an adventure filled with fun and excitement in this thrilling game!",
        "instructions": "Press Right Arrow Key D to move forward Press Left Arrow Key A to move backward",
        "url": "https://html5.gamemonetize.com/dm7la1p1srfqj8i6xtwcfo9e9tkkja8w/",
        "category": "Racing",
        "tags": "2D, Adventure, Car, Obstacle, Racing",
        "thumb": "https://img.gamemonetize.com/dm7la1p1srfqj8i6xtwcfo9e9tkkja8w/512x384.jpg",
        "width": "1000",
        "height": "450"
    },
    {
        "id": "49599",
        "title": "Lost Delivery",
        "description": "Do you like driving games? Then youll love this game where you drive your electric van and have to pick up lost packages on the road to recharge the battery. But it wont be easy, youll have to watch out for other cars and the fog that appears when you least expect it. Will you be able to reach your destination without running out of energy? Find out in this game full of fun and excitement!",
        "instructions": "Touch or click on the left or right side of the screen Cursors left and right on the keyboard",
        "url": "https://html5.gamemonetize.com/r1huv5lz1if8zq0ooah4qwcoq9fl26a0/",
        "category": "Racing",
        "tags": "Arcade, Car, Cars, Casual, Road",
        "thumb": "https://img.gamemonetize.com/r1huv5lz1if8zq0ooah4qwcoq9fl26a0/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "49103",
        "title": "Need for Race",
        "description": "Are you ready to accept the speed challenge and show everyone that you are a real racer without fear? Its time to come to the start of the race and drive as much as possible by car, avoiding collisions and not flying off the track! Rearrange between lanes, perform extreme detours and do everything possible to continue moving forward. The longer you can continue the race without collisions, the higher your speed will be and the higher the maximum record.",
        "instructions": "The car moves automatically Clicking on the right side of the screen allows you to turn it to the right clicking on the left side of the screen makes a left turn You can also turn using the A D keys or the right and left arrows on the keyboard ",
        "url": "https://html5.gamemonetize.com/mb8kyh2eioqmmh42g3tw8tkk98yl6h7y/",
        "category": "Racing",
        "tags": "Car, Cars, Driving, Mobile, Race, Racing, Road, Supercars, vehicle",
        "thumb": "https://img.gamemonetize.com/mb8kyh2eioqmmh42g3tw8tkk98yl6h7y/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "49104",
        "title": "Drive and Crash",
        "description": "Drive and Crash&rdquo; is a car derby racing game where your goal is to destroy your opponents cars in order to win and score a record number of points for the damage done. Choose a car and get ready for a ruthless battle. You will have access to several arenas surrounded by crazy racers, where everyone strives to destroy anyone who gets in his way. Bite into your tires into the asphalt in the parking lot or race track and stop at nothing! Become the best striker on the football field and a dangerous racer in the gorge. Hone your driving skills by dodging attacks and delivering a decisive blow until you become the last survivor of the race!",
        "instructions": "The W button and the up arrow are gas the S button and the down arrow are brake reverse To turn left using the A button and the left arrow right - the D button and the right arrow ",
        "url": "https://html5.gamemonetize.com/qbz49sidaq5d3mvkb1mr0siheeehfuwi/",
        "category": "Racing",
        "tags": "Action, Cars, crash, Driving, Mobile, Racing",
        "thumb": "https://img.gamemonetize.com/qbz49sidaq5d3mvkb1mr0siheeehfuwi/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49400",
        "title": "Flyway Duo Race",
        "description": "A Duo Race is beginning on the Flying Way by controlling casual-style cars in two player game mode! The main goal at this race is to get to the longest distance with your car. During your journey, you can collect the diamonds on your way. The diamonds will let you buy new cars on the shop menu. Jump over the ramps, fly as long as you can, and avoid obstacles on your way. Let the race begin!",
        "instructions": "Player 1 W A S D or ARROW KEYS 1P Mode Only Player 2 ARROW KEYS",
        "url": "https://html5.gamemonetize.com/mh65e8hirrffgngxcndtz9pmufz7lecv/",
        "category": "Racing",
        "tags": "1 Player, 2 Player, 2 Player Games, 3D, Air, Avoid, Car, Driving, Flight, fly, Race, Racing",
        "thumb": "https://img.gamemonetize.com/mh65e8hirrffgngxcndtz9pmufz7lecv/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "48563",
        "title": "Racing Horizon",
        "description": "Racing Horizon is a 3D and unlimited racing game in which you race consistently in highway traffic with your super-powerful car. The game contains various sport car models and various upgrade options. You can start a very long highway racing career or you can drive on an endless map. You can also join a police chase mission. Various highway racing maps and various cars and game modes are waiting for you! Lets go!",
        "instructions": "Move W A S D or ARROW KEYS NOS N Change camera C",
        "url": "https://html5.gamemonetize.com/qgb6n2r17f8b3a5gvf0lf1mncx6fzd2e/",
        "category": "Racing",
        "tags": "1 Player, 3D, 3D Games, Adventure, Car, Driving, Race, Simulation, Traffic, WebGL",
        "thumb": "https://img.gamemonetize.com/qgb6n2r17f8b3a5gvf0lf1mncx6fzd2e/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "49377",
        "title": "Super Stunt car 7",
        "description": "Fun and enjoyment filled stunt car game with casual fun and also challenging levels. Beat the other players in the multiplayer racing arena and rise to the top! Tweak your car to be the best on the planet! This game has muscle cars, jump ramps, Loops, fire rings, racing tracks, skill tracks, puzzle tracks, racing against trains, customisable cars, monster trucks, online racing and upgradable cars from stunt to monster car levels. Download now! Win the challenges in stunt tracks with your excellent stunt car! Drive on tracks with jumps, loops and obstacles! Race against a train! Beat the cop cars in San Francisco! Try the new racing levels a",
        "instructions": "Use W and S to move Forward and Backward Use A and D to move Left and Right ",
        "url": "https://html5.gamemonetize.com/cxrki3r51lxtdoso58xui05si74uehfk/",
        "category": "Racing",
        "tags": "1 Player, 3D, Action, Adventure, Car, Cars, Racing, Stunts, Supercars",
        "thumb": "https://img.gamemonetize.com/cxrki3r51lxtdoso58xui05si74uehfk/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48586",
        "title": "Speed Demons Race",
        "description": "Huge, powerful, brutal Monster Trucks. And what if we arrange a race on them? In the game Speed Demons Race you will be able to assemble your own Monster Truck and surpass all rivals! Each rider is faced with the task of driving a difficult track with hills, slopes, overcoming metal jumps, driving through containers, destroying wooden boxes. Only cool pilots can do it all! Winning and performing tricks, please the audience and earn coins for it, and use them to improve your Monster Truck. To prove that you are the best, come to the finish line first on all tracks!",
        "instructions": "The right arrow key or the pedal on the right on the screen is gas The left arrow key or the pedal on the right on the screen is the brake reverse gear The space bar or the acceleration button on the screen is turbo ",
        "url": "https://html5.gamemonetize.com/ispiubqetu8nido89byhvrdvot9x6n91/",
        "category": "Racing",
        "tags": "2D, Best Games, Car, car tuning, Cars, Cartoon, Enemies, Levels, Mobile, monstertruck, offroad, Race, Racing, vehicle",
        "thumb": "https://img.gamemonetize.com/ispiubqetu8nido89byhvrdvot9x6n91/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49298",
        "title": "Villager Bus Simulator",
        "description": "Driving bus while grab and drop any passenger",
        "instructions": "W Up - Acceleration S Down - Brake R -Reverse shift C-Camera ",
        "url": "https://html5.gamemonetize.com/6l7u09bxixpyld5le78bxzdzi41c1opd/",
        "category": "Racing",
        "tags": "bus, Driving, Simulation",
        "thumb": "https://img.gamemonetize.com/6l7u09bxixpyld5le78bxzdzi41c1opd/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49019",
        "title": "Hill Climb Pixel Car",
        "description": "Hill Climb Pixel Car is an off-road racing game where riders race over rough terrains such as dirt, sand, mud, or grass tracks. You will need to control your bike skillfully to overcome different obstacles and perform spectacular jump scenes. Race as fast as possible and become the only champion of this motocross championship.",
        "instructions": "- Hold the right pedal to start the engine and the left pedal to slow down or stop the vehicle You will need to increase your speed using the right pedal to overtake your opponents and reach the finish line as quickly as possible - You can use button A ",
        "url": "https://html5.gamemonetize.com/avws453b51tqcgibbrxzacjiwrm50akz/",
        "category": "Racing",
        "tags": "1 Player, 2D, Animal, Car, Fun, Monkey, Moto, Racing, Relaxation, WebGL",
        "thumb": "https://img.gamemonetize.com/avws453b51tqcgibbrxzacjiwrm50akz/512x384.jpg",
        "width": "900",
        "height": "600"
    },
    {
        "id": "49199",
        "title": "Grand Cyber City",
        "description": "A very long and entertaining story is beginning with the Grand Cyber City game. The game mainly contains various vehicle simulations like car simulation, bike, motorbike, rocket, and parachute simulations. The game contains various game modes either as missions, races, challenges, and free modes. Drive or ride whatever you want in the city, participate in events, collect coins, fly with your rocket, or speed up to the end of the limits with your car. By various vehicles, you will have fun to the end! Various cars and super customization options are waiting for you in the garage. Let the super adventure begin!",
        "instructions": "PLAYER 1 Move W A S D or ARROW KEYS NOS SHIFT or N Weapon Q or E Look behind T Reset Car R Change camera C IF YOU PLAYING 2 PLAYER PLAYER 1 Move W A S D NOS SHIFT or N Open gun F Look behind T Reset Car R Change camera C PLAYER 2 Move AR",
        "url": "https://html5.gamemonetize.com/ibvlqrkmvay6y6tlftsz99vvh09oz6eu/",
        "category": "Racing",
        "tags": "Action, Battle, Bike, Cars, drifting, Driving, Flight, gta, Motorcycle, Race, Rocket, Simulation, Simulator, WebGL",
        "thumb": "https://img.gamemonetize.com/ibvlqrkmvay6y6tlftsz99vvh09oz6eu/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "48285",
        "title": "Hillside Drive Master",
        "description": "Embark on an exhilarating 3D truck delivery adventure with Hillside Drive Master. Your mission is to transport 3 stickmen across various levels to the peak of the mountain. Along the challenging journey, feel free to toss the stickmen - as long as you reach the finish line. Collect coins along the way to unlock mystery gifts for added fun. If youre ready to take on the Hillside Drive Master challenge, then hop into this 3D trucking experience and get ready for thrills and excitement like never before!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/mapfm8t3unz663vwmw69nsttog7a0uq4/",
        "category": "Racing",
        "tags": "3D, Avoid, Balance, Boys, Car, Collecting, Kid, Simulation, Truck",
        "thumb": "https://img.gamemonetize.com/mapfm8t3unz663vwmw69nsttog7a0uq4/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "49116",
        "title": "Speedway Formula Drag 2023",
        "description": "Hey there, if you love drag games and ever imagined racing a car on a formula track, then Speedway Formula Drag Game 2023 is just for you! Its a super exciting drag racing game where you control your car by swiping left and right. Get ready to rev up your engines and experience the thrill of high-speed racing. Join us now and dominate the track!",
        "instructions": "Use mouse click to move or tap on yellow buttons to control your car",
        "url": "https://html5.gamemonetize.com/39d40qpa8kgza09br0yn70og5ac9vev1/",
        "category": "Racing",
        "tags": "Car, Casual, Race, Racing",
        "thumb": "https://img.gamemonetize.com/39d40qpa8kgza09br0yn70og5ac9vev1/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48694",
        "title": "Bike Stunt Race",
        "description": "Take the thrill to newns in Bike Stunt Race, an immersive motorcycle racing game set in stunning 3D worlds. Youre in control of a skilled rider, navigating challenging tracks while pulling off jaw-dropping stunts. Maneuver ramps and speed markers to flip and spin as you swerve around obstacles and collect coins to customize your bike. This high-octane adventure demands quick reflexes and strategy to reach the finish line. With exhilarating environments and stunts galore, Bike Stunt Race offers an adrenaline-fueled motorcycling experience. Start your engine!",
        "instructions": "Drag to move left and right",
        "url": "https://html5.gamemonetize.com/0n8vekxew85vhen3psp4xq8a20r1s0tv/",
        "category": "Racing",
        "tags": "Arcade, Avoid, Bike, Boy, Casual, Motorcycle, Platform, Race",
        "thumb": "https://img.gamemonetize.com/0n8vekxew85vhen3psp4xq8a20r1s0tv/512x384.jpg",
        "width": "950",
        "height": "1688"
    },
    {
        "id": "48882",
        "title": "Car Racing Championship",
        "description": "Are you confident in your driving skills? Do you want to challenge your driving skills? Car Racing Championship is made for you! In Car Racing Championship, you will drive various excellent cars to complete incredible races! Your opponents are very tough! The types of races are diverse! Can you win the championship? Try this game! Have fun!",
        "instructions": "W Accelerate S backward A Steer left D Steer right",
        "url": "https://html5.gamemonetize.com/55erbsn8awr3f99zhy6ek545byx5lexj/",
        "category": "Racing",
        "tags": "3D, Avoid, Boys, Car, Collecting, Racing, Simulation",
        "thumb": "https://img.gamemonetize.com/55erbsn8awr3f99zhy6ek545byx5lexj/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "49028",
        "title": "ATV Highway Racing",
        "description": "In the thrilling world of ATV highway racing, adrenaline junkies rev their engines for high-speed adventures. These rugged all-terrain vehicles, or ATVs, are customized for maximum performance on the asphalt. Racers navigate sharp turns and straightaways, showcasing their skills and pushing their machines to the limit. Whether its the roar of the engine or the pursuit of victory, ATV highway racing offers an exhilarating experience that keeps both riders and spectators on the edge of their seats. Website Developer <a href='https://www.bestcrazygames.com/'>https://www.bestcrazygames.com/</a>",
        "instructions": "WASD drive",
        "url": "https://html5.gamemonetize.com/c0jimko6ysr5m27a13a4ozmxuv50gkbq/",
        "category": "Racing",
        "tags": "atv, Driving, Mentolatux, Racing, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/c0jimko6ysr5m27a13a4ozmxuv50gkbq/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48984",
        "title": "Trailer Truck Parking",
        "description": "Do you enjoy playing parking games, friends? You can play a fun truck parking game called Trailer Truck Parking thanks to Jhurr.com. Enjoy driving your truck around the crowded parking lots and park it in the designated spot without hitting any other vehicles or objects. Drive carefully and methodically to the parking space, take in the thrilling levels, park your truck in various settings, and prove yourself to be a pro truck driver. Play further driving games at Jhurr.com.",
        "instructions": "Arrows to Drive",
        "url": "https://html5.gamemonetize.com/xk33o0aj2l8gos5cin3qng1pj5aymdzq/",
        "category": "Racing",
        "tags": "Driving, Parking, Truck",
        "thumb": "https://img.gamemonetize.com/xk33o0aj2l8gos5cin3qng1pj5aymdzq/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "48869",
        "title": "Bicycle Stunts Racing 2023",
        "description": "Bicycle Stunts Racing is an exhilarating sport that combines precision and daring. Riders push the limits of balance and skill, performing jaw-dropping tricks and flips on two wheels. From backflips to wheelies, its a heart-pounding spectacle. Safety gear is crucial as these athletes race against time, defying gravity to leave spectators in awe. Whether on dirt tracks or city streets, Bicycle Stunts Racing is an adrenaline-fueled pursuit that showcases the incredible athleticism of its participants. Website Developer <a href='https://www.crazygamesonline.com/'>https://www.crazygamesonline.com/</a>",
        "instructions": "WASD drive",
        "url": "https://html5.gamemonetize.com/7yodi87kk5va0dtrcasviepnk1kxe9eo/",
        "category": "Racing",
        "tags": "Action, Bicycle, Bike, Driving, Levels, Racing, Stunts, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/7yodi87kk5va0dtrcasviepnk1kxe9eo/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47331",
        "title": "PARK IT",
        "description": "Welcome to PARK IT, the ultimate 3D car parking game designed for all car enthusiasts and lovers of challenging gameplay! Get ready to put your driving skills to the test as you take on the best car parking experience of 2023. In this addictive and thrilling game, you&rsquo;ll find yourself facing ultra-challenging levels that will push your parking abilities to the limit. With meticulously designed environments and realistic car physics, each parking scenario will demand precision and skill. As you progress through the game, you&rsquo;ll have the opportunity to improve your driving skills and become a master parker. Maneuver your car through tight spa",
        "instructions": "Move WASD Look MOUSE Pause ESC in-game tutorial",
        "url": "https://html5.gamemonetize.com/6dd1lgau3evlkaqlzzi7a5mac4y6cod2/",
        "category": "Racing",
        "tags": ".io, .io Games, 1 Player, 3D, 3D Games, Adventure, Arcade, Car, car tuning, Cars, Parking, Puzzle, Supercars, trial car",
        "thumb": "https://img.gamemonetize.com/6dd1lgau3evlkaqlzzi7a5mac4y6cod2/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "48011",
        "title": "Climb Racing 3D",
        "description": "A variety of characters, cars and maps are waiting for you in the car racing game full of fun and adventure, based on 3D physics and with colorful visual effects. Choose your vehicle and hit the road for endless driving experience. Get an advantage by collecting bonuses. We wish you to have a pleasant time in the fun and action-packed car racing game. Have fun!",
        "instructions": "Movement A-D RIGHT and LEFT ARROW KEYS Nitro J Magnet K All Wheel Drive L Hint You can steer the car into the air with the forward and reverse consumers",
        "url": "https://html5.gamemonetize.com/gjfls53ild9pfyssb4btixekteqoh7py/",
        "category": "Racing",
        "tags": "3D Games, Action, Adventure, Boys, Cars, offroad",
        "thumb": "https://img.gamemonetize.com/gjfls53ild9pfyssb4btixekteqoh7py/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "41002",
        "title": "Monster Truck Wheels 2",
        "description": "In Monster Truck Wheels 2, youll be driving a heavy SUV, and weve already prepared fifteen different tracks. Do not rely on simplicity and ease, the tracks, from the very first stages it will be super difficult. You need to climb pyramids of different sizes, drive along bridges, drive into containers and standing cars. Your jeep is not very stable and can roll over easily. Wisely adjust the brake and gas, if necessary, back up in order to overcome the next obstacles with acceleration. Distances on the levels are short, but quite difficult, be careful and careful.",
        "instructions": "Use arrow keys to drive or touch buttons on your devices ",
        "url": "https://html5.gamemonetize.com/qf7gm6lcd394yd54umnpifqqejrie2kg/",
        "category": "Racing",
        "tags": "1 Player, Adventure, Best, Boys, Car, Cars, Driving, HTML5, Hypercasual, Mobile, Skill, Truck",
        "thumb": "https://img.gamemonetize.com/qf7gm6lcd394yd54umnpifqqejrie2kg/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "48526",
        "title": "Rival Stars Horse Racing",
        "description": "What is it like to become an equestrian expert? In Rival Stars Horse Racing, you will become one! Your goal is to provide professional equestrian performances for the audience. Various interesting obstacles await you to challenge them! How many levels can you complete? Its time to test your control skills! Can you become a master of equestrianism? Give this game a try! Have fun playing!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/hdd1bbba6y8edln63oohm3zxx3rsbx1f/",
        "category": "Racing",
        "tags": "Animal, Avoid, Casual, Horse, Kid, Simulation, Stunts",
        "thumb": "https://img.gamemonetize.com/hdd1bbba6y8edln63oohm3zxx3rsbx1f/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "48703",
        "title": "Extreme Stunt Car Game",
        "description": "Get ready for most exciting impossible and challenging Extreme Stunt Car Games. Play like a car stunt master while riding on the tricky tracks. Accept the challenge of car stunt games and choose your favorite vehicle to enjoy the driving challenges in car stunt races. This Extreme car stunt game having amazing Game play and challenging levels which is not an easy job for any stunt car driver. Now it&rsquo;s time To perform crazy stunts, tighten your seat belt and enjoy loads of different cars while climb up the massive try not fall down on the city otherwise you will lose.",
        "instructions": "W or up arrow key forward S or down arrow key back A or left arrow key move left D or right arrow key move right Space handbrake",
        "url": "https://html5.gamemonetize.com/pirzknd92cn58ix2lg0rskzlz8als6hp/",
        "category": "Racing",
        "tags": "3D Games, Best Games, Car, Driving, HTML5, Racing, Simulation, Stunts, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/pirzknd92cn58ix2lg0rskzlz8als6hp/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48327",
        "title": "Grimace vs Police SuperCar",
        "description": "Embark on an intense journey in Grimace vs Police SuperCar. As the player, youll command a formidable car, embarking on a map-based quest to eliminate the notorious Grimace. Your mission: track down Grimace, engage in thrilling pursuits, and ultimately ram into Grimace to clear each level. Unveil multiple stages including car parking challenges and coin collection, enhancing the excitement.",
        "instructions": "WASD and ARROW drive",
        "url": "https://html5.gamemonetize.com/jvrv8dvuw6snon0nykzxq3szr3relnct/",
        "category": "Racing",
        "tags": "Driving, Grimace, Levels, Police, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/jvrv8dvuw6snon0nykzxq3szr3relnct/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48458",
        "title": "Truck Simulator Skibidi Toilet",
        "description": "Before you start your multi-million dollar logistics company, you will first have to complete quick jobs using provided trucks. You will have to earn at least before buying your first truck. As the player completes jobs and levels up, they will unlock skills. Skills can be used to upgrade fuel efficiency and long distance cargoes as well as unlocking hazardous, fragile, and important deliveries.",
        "instructions": "W Up - Acceleration S Down - Brake R -Reverse shift E -Skibidi Horn C-Camera ",
        "url": "https://html5.gamemonetize.com/t6vmzx5aubxgwqnocbruc9n01c4q1f9b/",
        "category": "Racing",
        "tags": "Driving, Simulation, Simulator, Skibidi, Skibidi Toilet, Truck",
        "thumb": "https://img.gamemonetize.com/t6vmzx5aubxgwqnocbruc9n01c4q1f9b/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "48371",
        "title": "Motorcycle Stunt Racing",
        "description": "Motorcycle stunt racing offers an exhilarating experience that combines skill and adrenaline. The games various levels provide challenges, from intricate obstacle courses to high-speed tracks. Competing against AI-controlled bikes adds extra excitement, as players must strategically maneuver through the course while outsmarting their virtual opponents. As you progress through the levels and conquer each race, youll have the opportunity to unlock new bikes with increased power and performance capabilities. Website Developer <a href='https://www.crazygamesonline.com'>https://www.crazygamesonline.com</a>",
        "instructions": "WASD drive SHIFT nitro",
        "url": "https://html5.gamemonetize.com/fpi6sehlszxjmmxlfbtobgnf3kqxj67f/",
        "category": "Racing",
        "tags": "Android, Bike, Driving, HTML5, Mobile, Moto, Motocross, Motorcycle, Racing, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/fpi6sehlszxjmmxlfbtobgnf3kqxj67f/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48335",
        "title": "Zombie Vs SpongeBoob",
        "description": "Join SpongeBoob in an exhilarating arcade adventure! In this fast-paced game, help SpongeBoob sprint through the zany Bikini Bottom streets, dodging menacing zombies and overcoming challenging obstacles. Tap and swipe to guide SpongeBoob as he races against the clock, collecting power-ups and boosters along the way. With vibrant visuals, quirky sound effects, and endless excitement, this game is a thrilling test of reflexes and strategy. How far can you lead SpongeBoob in this undead obstacle course?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/57hgs0lhezmehersy3370k8lmgbj9u7x/",
        "category": "Racing",
        "tags": "Adventure, Arcade, Fun, Funny, Game, Games, HTML, HTML5, Kid, Obstacle, run, running, Spongebob, Zombie",
        "thumb": "https://img.gamemonetize.com/57hgs0lhezmehersy3370k8lmgbj9u7x/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48306",
        "title": "Stunt Car Racing Extreme",
        "description": "Get ready for an adrenaline-pumping adventure with our thrilling car customization and stunts game! In this high-octane experience, youll find yourself behind the wheel of a powerful car, akin to the style and performance of a BMW. But the excitement doesnt stop there &ndash; you have the freedom to make this car uniquely yours. Choose from a stunning array of colors and eye-catching decals to create a vehicle that reflects your personal style. Website Developer <a href='https://www.crazygamesonline.com'>https://www.crazygamesonline.com</a>",
        "instructions": "WASD Drive",
        "url": "https://html5.gamemonetize.com/qspnsc2rw356ol3zwf6tdd8q3dw8pd6e/",
        "category": "Racing",
        "tags": "Android, Cars, Driving, HTML5, Mentolatux, Mobile, Stunts, Supercars, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/qspnsc2rw356ol3zwf6tdd8q3dw8pd6e/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48203",
        "title": "Motorcycle Dirt Racing Multiplayer",
        "description": "Immerse yourself in the exhilarating world of motocross racing, where adrenaline and competition collide! Gear up for heart-pounding races across diverse terrains, from rugged dirt tracks to challenging off-road landscapes. Take control of powerful motorcycles, each with unique attributes, as you navigate through daring jumps, tight corners, and treacherous obstacles. Winning races not only brings you closer to the championship trophy but also earns you valuable rewards. Website Developer <a href='https://www.bestcrazygames.com'>https://www.bestcrazygames.com</a>",
        "instructions": "WASD control the bike",
        "url": "https://html5.gamemonetize.com/pd2c2meh0ax42i3ynichh7h3ry34l7re/",
        "category": "Racing",
        "tags": "3D Games, Android, Driving, HTML5, Mentolatux, Moto, Motocross, Motorcycle, Racing, Unity3D",
        "thumb": "https://img.gamemonetize.com/pd2c2meh0ax42i3ynichh7h3ry34l7re/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48276",
        "title": "USA Truck Simulator 2024",
        "description": "USA Truck Simulator 2024 is a realistic truck driving simulation is a quite realistic rural truck driving simulation. Transport the cows on the side of the road and take them to the destination points to be sold by local traders. This is a sequel to the Truck Owing Simulator Loading Cows, this time set in an offroad setting in the countryside and forest. With a much wider area coverage than the prequel. On the road you will meet many that you will transport using a truck and take you to the destination points.",
        "instructions": "Arrow keys - move C - camera change",
        "url": "https://html5.gamemonetize.com/fegihrwp2dcnmzxjl10wseojln60zr2a/",
        "category": "Racing",
        "tags": "Car, car tuning, crash, monstertruck, Race, Traffic",
        "thumb": "https://img.gamemonetize.com/fegihrwp2dcnmzxjl10wseojln60zr2a/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "48198",
        "title": "Car Race Drag Shift 2023",
        "description": "Experience high-speed adrenaline in Car Race Drag Shift! Get ready to grip the wheel, slam the gas pedal, and dominate the quarter-mile strip. This intense racing game combines precision timing with lightning-fast reflexes as you master the art of gear shifting for optimal acceleration. Choose from a fleet of meticulously detailed cars, each with unique specs, and compete against rivals in a heart-pounding test of speed and skill. Upgrade your vehicles, fine-tune your gear ratios, and strategize your shifts to achieve victory.",
        "instructions": "Use button from the game to play",
        "url": "https://html5.gamemonetize.com/m2ievm1xj29zked0kmurcmqzqr3zmk5r/",
        "category": "Racing",
        "tags": "Car, car tuning, Cars, Racing, Supercars, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/m2ievm1xj29zked0kmurcmqzqr3zmk5r/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48183",
        "title": "Race street of crash",
        "description": "Race street of crash &eacute; um jogo de carro, voc&ecirc; podera melhorar seu carro, comprar motores, nitro, turbo e melhorar seu visual, para vencer os desafios e ganhar de seus oponentes.",
        "instructions": "Use keyboard arrows to control the bike Button N nitro",
        "url": "https://html5.gamemonetize.com/rql0tgocaamugt3qzgkofpz6jtep1wkr/",
        "category": "Racing",
        "tags": "2D, Car, car tuning, Driving, Race, Racing, run",
        "thumb": "https://img.gamemonetize.com/rql0tgocaamugt3qzgkofpz6jtep1wkr/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48140",
        "title": "Highway Cleaners",
        "description": "Upgrade your car and try to reach the helicopter Go farther to earn more money Use your mony to upgrade your car If you go fast you win",
        "instructions": "WASD- Vehicle controls Left Shift - Turbo Space- Handbrake",
        "url": "https://html5.gamemonetize.com/02guxkh80ts07ya5ljsuipzmegt21z07/",
        "category": "Racing",
        "tags": "1 Player, 3D, 3D Games, Adventure, Arcade, Cars",
        "thumb": "https://img.gamemonetize.com/02guxkh80ts07ya5ljsuipzmegt21z07/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "41146",
        "title": "Taxi Parking Challenge 2",
        "description": "The Taxi Parking Challenge 2 game will reproduce the extreme conditions for car parking at each level. At the same time, with each new level, the task will become more difficult, but remain the same: park the car in the parking lot marked with a rectangle, meeting the time limit. Even a light touch of the curbs is not allowed, and even more so the cars standing in the parking lot.",
        "instructions": "Use arrow keys or on screen buttons to drive ",
        "url": "https://html5.gamemonetize.com/dtpq5tr2quj6qxmfsp1ipdfi82n2o06h/",
        "category": "Racing",
        "tags": "1 Player, Best, Cars, Driving, HTML5, Mobile, Parking, Skill, Taxi",
        "thumb": "https://img.gamemonetize.com/dtpq5tr2quj6qxmfsp1ipdfi82n2o06h/512x384.jpg",
        "width": "960",
        "height": "540"
    },
    {
        "id": "47830",
        "title": "Pink Rush Speedrun Platformer",
        "description": "Get ready for the ultimate platformer experience with this action-packed game that combines the thrill of speedrunning with the challenge of conquering 60 different levels. Each level presents its own unique obstacles and traps, making every moment a heart-pounding adventure. Tap into your speedrunning skills and embark on this 2D offline game that guarantees hours of endless fun. Your mission is to conquer all 60 levels, maneuvering through deadly traps while setting the fastest times possible.",
        "instructions": "Arrows or Touch Arrow Up - Jump Arrow Left - Move left Arrow Right - Move right",
        "url": "https://html5.gamemonetize.com/y5trug80jfhd2w5g2754u7xmx8ikvf5g/",
        "category": "Racing",
        "tags": "1 Player, 2D, Action, Platform, Racing",
        "thumb": "https://img.gamemonetize.com/y5trug80jfhd2w5g2754u7xmx8ikvf5g/512x384.jpg",
        "width": "640",
        "height": "360"
    },
    {
        "id": "47987",
        "title": "Jeep Wheelie",
        "description": "Jeep Wheelie is a simple yet super fun 2D game with 10 levels that a player has to overcome by keeping a Jeep on the rear wheels while driving. To make it more difficult, there are various obstacles in each level - some you can ride over, some you must avoid by jumping. Collected dollars increase total score. Have fun playing.",
        "instructions": "Arrow key RIGHt to wheelie the jeep around Space key to jump and avoid the obstacles ",
        "url": "https://html5.gamemonetize.com/7w8y4xw19oo2thkii5w0yqd3fkexfln1/",
        "category": "Racing",
        "tags": "Android, Arcade, Avoid, Boy, Collection, Driving, HTML5, Hypercasual, jump, Kids, Racing, Skill",
        "thumb": "https://img.gamemonetize.com/7w8y4xw19oo2thkii5w0yqd3fkexfln1/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "47970",
        "title": "Crazy racing in the sky",
        "description": "Complete different cool levels to earn money and buy your dream car. The game has two modes that will surprise you: 1) Career where you will earn money after completing the level 2) Free driving - a large map where you will test your car and study its characteristics. More than 10 cars that you can buy to complete the level quickly and easily, cars differ in speed, acceleration and braking. The game has realistic graphics and car physics, try to unlock all the levels if you can.",
        "instructions": "WASD or arrow keys - vehicle movement Spacebar - handbrake Tab - change car view P - pause the game R - Respawn",
        "url": "https://html5.gamemonetize.com/g8cjpgnt9nc1vhn8bbmmz4q31hwqc2a2/",
        "category": "Racing",
        "tags": "1 Player, 3D, Arcade, Car, Cars, drift, drifting, Obstacle, Race, Sport, unity, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/g8cjpgnt9nc1vhn8bbmmz4q31hwqc2a2/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47858",
        "title": "Stunt Skibidi",
        "description": "Are You the next great stunt Skibidi Toilet pilot? You will need to have strong nerves and great precision to finish the game. The difficulty increases as you advance in levels but sometimes you will be forced to repeat a level many times before completing the mission. How to play: The main goal is to collect all stars to finish each levels, so fly inside the hoops without crashing, but be aware to your fuel bar because sometime you need to refill it so collect the fuel barrel. Are you ready to fly now?",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/uc1lqk57zongclookru9bxszmk1myazg/",
        "category": "Racing",
        "tags": "Arcade, Flight, fly, HTML, Mobile, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/uc1lqk57zongclookru9bxszmk1myazg/512x384.jpg",
        "width": "1280",
        "height": "800"
    },
    {
        "id": "47835",
        "title": "Rebel Driving",
        "description": "Rebel Driving car game is very crazy monster stunt impossible racing game where you can made and feel stunts and experienced like actual life in this monster car race on impossible tracks you will face different challenges the target is to met all them in this Rebel Driving Car game .",
        "instructions": "Use arrow keys to drive the car Up Arrow key - gt Speed Down Arrow key - gt Reverse Left Arrow key - gt Move left Right Arrow key - gt Move Right",
        "url": "https://html5.gamemonetize.com/j9amh1bav4yv2iucad778nrhtp54fjjt/",
        "category": "Racing",
        "tags": "Adventure, drifting, Driving, Racing",
        "thumb": "https://img.gamemonetize.com/j9amh1bav4yv2iucad778nrhtp54fjjt/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47591",
        "title": "Skibidi Toilet Moto Bike Racing",
        "description": "Skibidi Toilet Moto Bike Racing with a cool bike racing Skibidi Toilet. Toilet vehicle based game with racing modifications for drag bike lovers. In this game, there are several types of toilet that you can play to ride the reckless Skibidi Toilet. Driving a drag toilet racing vehicle is a thrilling experience that is hard to forget. With the Skibidi Toilet Moto Bike Racing game, you will get a large collection of drag toilet racer. Games that you can download for free that have an additional collection of drag bikes make playing the game exciting.",
        "instructions": "arrow key or WASD - to move",
        "url": "https://html5.gamemonetize.com/n1ge69ixkkk1ovl8cp8gvsm1b6sdxltv/",
        "category": "Racing",
        "tags": "Bike, Boy, buggy, Cartoon, Casual, Motorcycle, Race, Racing, Simulator, Skibidi Toilet, Sport, WebGL",
        "thumb": "https://img.gamemonetize.com/n1ge69ixkkk1ovl8cp8gvsm1b6sdxltv/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47736",
        "title": "Car Stunts Challenge",
        "description": "Play the heavy track rear wheel car drifting cars offering large range of drifting powers and sharpen you in various driving &amp; racing skills in this fine real stunt drift simulator. Experience the new games play of off road games car, drive Prado on tricky tracks and enjoy the fun of Car parking on mountains. space, and difficult sky impossible tracks.",
        "instructions": "Use arrow keys to drive the car Up Arrow key - gt Speed Down Arrow key - gt Reverse Left Arrow key - gt Move left Right Arrow key - gt Move Right",
        "url": "https://html5.gamemonetize.com/nh7kkel92tikrtps3f376u23ourhesxg/",
        "category": "Racing",
        "tags": "Adventure, Car, Race, Stunts",
        "thumb": "https://img.gamemonetize.com/nh7kkel92tikrtps3f376u23ourhesxg/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46390",
        "title": "BMX Boy Online",
        "description": "Accelerate, soar through the air, and execute a variety of impressive maneuvers while ensuring a safe landing. BMX Boy Online offers a remarkable blend of simplicity and captivating gameplay. The mechanics are straightforward - simply amplify your speed and leap over hurdles on the track to accumulate as many points as possible. Utilize the two on-screen buttons (the right button for acceleration and the other for jumping) to navigate through the course. Unleash your flair by performing dazzling stunts mid-air for additional points. The primary objective remains consistent: masterfully maneuver your way through obstacles, enjoy!",
        "instructions": "PC WASD to operate Mobile Tp those buttons on the screen to operate",
        "url": "https://html5.gamemonetize.com/lzhya6ep5ilwwkj5ho7mokm43ftzdbxv/",
        "category": "Racing",
        "tags": "Balance, Bike, BMX, BMX Games, Boy, Driving, Highscore, jump, Kids, Mobile, Obstacle, Online, Skill, Stunts",
        "thumb": "https://img.gamemonetize.com/lzhya6ep5ilwwkj5ho7mokm43ftzdbxv/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "47636",
        "title": "Train subway surfers",
        "description": "Introducing Train Surfers - The Ultimate Subway Running Game! Embark on an adrenaline-fueled adventure with Train Surfers, a heart-pounding runner game that will immerse you in the fast-paced world of subway surfing. Jump into a thrilling experience that blends the excitement of subway escapades with the captivating allure of endless running. Get ready to dash, dodge, and surf your way through the bustling cityscape as you aim to set new records and become the ultimate subway surfer!",
        "instructions": "Move the Player With Mouse and Touch The Screen ",
        "url": "https://html5.gamemonetize.com/nnaxxq7w2nt83q6k2qjd60ae1tavjtw3/",
        "category": "Racing",
        "tags": "Hypercasual, run, running, subway, Subway Surfers",
        "thumb": "https://img.gamemonetize.com/nnaxxq7w2nt83q6k2qjd60ae1tavjtw3/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "47772",
        "title": "Traffic Ride Skibidi Toilet",
        "description": "In the bustling metropolis of Trafficville, a thrilling and high-octane rivalry has emerged on the busy streets. Enter the world of Traffic Ride Motorcycle, where fearless riders steer their powerful motorcycles through the chaotic urban landscape, maneuvering through gridlocked traffic with unmatched finesse and agility. These skilled riders form an elite group committed to showcasing their prowess in navigating through the citys congested thoroughfares.",
        "instructions": "Control the bike with WASD But lurking in the shadows is an enigmatic and mischievous force known as the Skibidi Toilet Picture a peculiar and quirky vehicle shaped like a funky retro restroom on wheels ",
        "url": "https://html5.gamemonetize.com/mpi6dgs0z3zzfbf0m40qckwdn1yt1beh/",
        "category": "Racing",
        "tags": "Action, Bike, Moto, Motorcycle, Racing, Skibidi, Skibidi Toilet, Traffic, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/mpi6dgs0z3zzfbf0m40qckwdn1yt1beh/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47644",
        "title": "Obstacle Racing",
        "description": "Obstacle Racing is an exciting game that will put your skills to the test! Your mission is to overcome obstacles and earn money as you race endlessly through different themes. With five awesome themes to choose from, each with its own unique look and feel, you will never get bored. Use the money you earn to unlock themes and expand your racing experience. Can you conquer all the obstacles and become the ultimate champion? Jump, dodge, and race your way to victory in Obstacle Racing",
        "instructions": "Use Right Arrow Key or D to move forwards Use Left Arrow key or A to move backwards You can also use the forward and backward button given in the game to control the vehicle",
        "url": "https://html5.gamemonetize.com/7n2owcvovcooopthz1j60ujr6i6y98d2/",
        "category": "Racing",
        "tags": "1 Player, 2D, Adventure, Car, endless, Obstacle, WebGL",
        "thumb": "https://img.gamemonetize.com/7n2owcvovcooopthz1j60ujr6i6y98d2/512x384.jpg",
        "width": "1000",
        "height": "450"
    },
    {
        "id": "47618",
        "title": "Stunt Tracks",
        "description": "Speed Mode and Challenge Mode. In Speed Mode, you will push your F1 car to the limits in adrenaline-fueled races to achieve the best lap time. Challenge Mode presents a series of difficult levels, calling you to overcome obstacles, collect coins, and use your tactics to reach the goals. As you progress in the game and achieve success, you will unlock the opportunity to obtain new cars. Each car will have unique features that enhance your racing experience. With stunning visuals and captivating sound effects, this game immerses you in a real racing experience. Fast reflexes, sharp turns, and tactical skills will be the keys to victory. As you",
        "instructions": "Every time you do the best time in F1 Mode you win 500 game coins In Stunt Mode as you collect coins around you open new sections and buy new cars with the money you earn Control gt gt WASD Refresh the Scene gt gt R Amazing Camera Angles gt gt",
        "url": "https://html5.gamemonetize.com/54vemb7467r43pl46m9pkx1t2xa12m8a/",
        "category": "Racing",
        "tags": "1 Player, 3D, Arcade, Best, Car, car tuning, drift, drifting, Driving, Fun, Funny, Kid, Race, Racing",
        "thumb": "https://img.gamemonetize.com/54vemb7467r43pl46m9pkx1t2xa12m8a/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47169",
        "title": "Steer Your Boat",
        "description": "You took your boat out on a beautiful summers day, but it seems a lot of other people had the same idea because the water is very crowded. Steer your boat so that you avoid colliding with the other boats and also be careful not to run over the swimmers out in the water.",
        "instructions": "Touch the game screen or use the mouse to move your boat left and right Avoid colliding with other boats and swimmers ",
        "url": "https://html5.gamemonetize.com/d8msb5hjg5upe1dv1h7lc4wzo5cw7wku/",
        "category": "Racing",
        "tags": "Boat, Driving",
        "thumb": "https://img.gamemonetize.com/d8msb5hjg5upe1dv1h7lc4wzo5cw7wku/512x384.jpg",
        "width": "480",
        "height": "864"
    },
    {
        "id": "47558",
        "title": "Offroad Moto Bike Racing",
        "description": "Moto Bike: Offroad Racing is a racing game for real racers with extremely crazy offroad tracks. Moto Bike: Offroad Racing has been beautifully designed for players of all age groups with simple control and challenging adventures. Drive off-road motorcycles to overcome difficult challenges and become the best racer.",
        "instructions": "use keyboard arrows to control the bike and space button for break",
        "url": "https://html5.gamemonetize.com/2gqe1qjo3qgtzkzcwklyrik5b1bt28d3/",
        "category": "Racing",
        "tags": "Bike, endless, Fight, Games, offroad, Race, Stunts",
        "thumb": "https://img.gamemonetize.com/2gqe1qjo3qgtzkzcwklyrik5b1bt28d3/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47531",
        "title": "Coach Bus Simulator: City Bus Sim",
        "description": "Coach Bus Simulator: City Bus Simulator is the first coach driving game that will teach you to drive a real coach across different scenarios! Take people from a city to another, show them amazing places and landscapes. Open world map, incredible vehicles, wonderful interiors will make you feel a realistic coach bus driving experience! Its time to get on board and drive through Europe! Enter the simulation world of bus driving! Get Coach Bus Simulator now!",
        "instructions": "Use keyboard arrows to control bus and use space button for break",
        "url": "https://html5.gamemonetize.com/w5ftqej91hpzkb1jtpiul52wfq18zpqm/",
        "category": "Racing",
        "tags": "bus, Cars, Driving, Interactive, Sim, Simulation, Simulator",
        "thumb": "https://img.gamemonetize.com/w5ftqej91hpzkb1jtpiul52wfq18zpqm/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47517",
        "title": "Monster Truck Racing Battlegrounds",
        "description": "Welcome to Monster Truck Racing Battleground game. Monster trucks race to win on a racetrack. You need to win the race using the Blue Monster Truck. Other Monster Trucks are driven by artificial intelligence. Think you can beat the Artificial Intelligence Monster Trucks? Good luck to you in this race.",
        "instructions": "You will drive the Blue Monster Truck with ARROW Keys When the race is over you need to click the PLAY AGAIN button to race again ",
        "url": "https://html5.gamemonetize.com/ywxzmb1cg0sh15cjhn1aas3kbvlbmnsi/",
        "category": "Racing",
        "tags": "1 Player, 2D, Arena, Battlegrounds, Boys, endless, HTML, HTML5, Monster, monstertruck, offroad, Race, Racing, Truck",
        "thumb": "https://img.gamemonetize.com/ywxzmb1cg0sh15cjhn1aas3kbvlbmnsi/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "47293",
        "title": "Dirt Bike Mad Skills",
        "description": "The dirt race is beginning with the dirt bike riders on the various bike stunt parkours with the Dirt Bike Mad Skills game! Ride your bike through the valleys, canyons, and dangerous places to have the most exciting moments either in single-player game mode or in 2 player game mode. This chapter comes with more bike types and better bike features. Pick your bike and start your challenge right away!",
        "instructions": "Player 1 Move W A S D or ARROW KEYS Single Player Mode Player 2 Move ARROW KEYS",
        "url": "https://html5.gamemonetize.com/bygt69xh1ch76g6if7hh3s0vdq7neqx5/",
        "category": "Racing",
        "tags": "2 Player, 2 Player Games, 3D, 3D Games, Adventure, Moto, Motorcycle, Race, Skill, WebGL",
        "thumb": "https://img.gamemonetize.com/bygt69xh1ch76g6if7hh3s0vdq7neqx5/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "47272",
        "title": "Trial Bike Racing Clash",
        "description": "A super bike racing experience begins with a stunt bike and a stunt rider with the Trial Bike Racing Clash! Dangerous rides in different zones will be waiting for you! This race can be played either in 1 player game mode or in 2 player game mode. Play both mission and skills game modes against a friend and race to the finish line. Customizable bikes and riders and various exciting game levels are waiting for you. It is not just important to go faster, also it is important to go without crashing. Let the ride begin!",
        "instructions": "Player 1 Move W A S D Jump SPACE Player 2 Move ARROW KEYS Jump L",
        "url": "https://html5.gamemonetize.com/vqfqbnwpjpv5t77qupxckrz953obu9wd/",
        "category": "Racing",
        "tags": "1 Player, 2 Player, 2 Player Games, 3D, 3D Games, Bike, Moto, Motorcycle, Race, Racing, Skill",
        "thumb": "https://img.gamemonetize.com/vqfqbnwpjpv5t77qupxckrz953obu9wd/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47411",
        "title": "Kitty Rush",
        "description": "Run, chase and dash with cute Kitty Rush in a fast, fun-filled endless runner. Now please help Kitty speed, slide and dodge through wild worlds where you have to challenging obstacles and keep moving forward.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/gnvtksczpjh4jmiuobleh6k0ei6i60d6/",
        "category": "Racing",
        "tags": "Cat, Obstacle, run, running",
        "thumb": "https://img.gamemonetize.com/gnvtksczpjh4jmiuobleh6k0ei6i60d6/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "1907",
        "title": "Friends Rainbow Survival Race",
        "description": "Survival Race: The Blue Rainbow Monster takes you on an adrenaline-fueled journey through a vibrant and enchanting world, where the formidable Blue Rainbow Monster reigns supreme. With its striking blue hue and extraordinary abilities, the monster stands out as a force to be reckoned with. As you participate in the intense Survival Race, you find yourself traversing treacherous terrains, confronting challenging obstacles, and always staying one step ahead of the relentless pursuit of the Blue Rainbow Monster. The race unfolds in a visually stunning environment, brimming with a kaleidoscope of colors and whimsical landscapes. Each corner hold",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/6fpke3eo0qsc35x2ip2d5vgjrxz7wcg3/",
        "category": "Racing",
        "tags": "Android, HTML5, iPad, iPhone, Mobile, Monster, Racing, run, running",
        "thumb": "https://img.gamemonetize.com/6fpke3eo0qsc35x2ip2d5vgjrxz7wcg3/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "45799",
        "title": "Tractor Challenge",
        "description": "In the new Tractor Challenge game, you have to conduct field trials of new tractor models that will soon go on sale. Selecting a specific tractor model you will see it in front of you on the screen. The tractor will stand on the road. By pushing the gas pedal, you will ride it on a road with a difficult terrain, gradually gaining speed. You will need to deftly drive a vehicle to overcome many dangerous sections of the road and even make ski jumps. The main thing is not to let the tractor roll over, because then you will fail the test.",
        "instructions": "Desktop Arrow keys or W A S D to drive the tractor Mobile Use on-screen buttons to drive ",
        "url": "https://html5.gamemonetize.com/fs5o27zuvaq3topxuqk7tsbry3nuvfu7/",
        "category": "Racing",
        "tags": "1 Player, 2D, Best, Boys, Driving, HTML5, Mobile, Obstacle, Skill, Truck",
        "thumb": "https://img.gamemonetize.com/fs5o27zuvaq3topxuqk7tsbry3nuvfu7/512x384.jpg",
        "width": "960",
        "height": "540"
    },
    {
        "id": "47363",
        "title": "Nubic Stunt Car Crasher",
        "description": "Destroy the building blocks consisting of cube bricks! Choose one of the 3D Stunt cars. Take your place on the track. Drive your car down the ramp. You can only accelerate along the way. At the end of the road, you will encounter many obstacles as you fall down. These obstacles will slow you down. Speed is very important in this game. You can see the vehicle selection and upgrades on the game home screen. Dont forget to upgrade the engine power, nitro speed and bonus winnings. Break down characters and building blocks by overcoming obstacles. With the fun characters of the game world, everything is much more enjoyable. Have fun!",
        "instructions": "Movement W Up Arrow Key Brake S Down Arrow Key Destroy large building blocks by smashing cube obstacles to progress through sections ",
        "url": "https://html5.gamemonetize.com/lecr0rwoug0m76ombdap2yrrmblrj9k7/",
        "category": "Racing",
        "tags": "1 Player, Cars, crash, Stunts",
        "thumb": "https://img.gamemonetize.com/lecr0rwoug0m76ombdap2yrrmblrj9k7/512x384.jpg",
        "width": "800",
        "height": "450"
    },
    {
        "id": "47341",
        "title": "Suburbs Zombie Driving",
        "description": "Suburbs Zombie Driving is an action packed driving game where you mission is to drive across the suburbs and crush the given amount of zombies on each level in order to win and unlock lots of different cars.",
        "instructions": "WASD - Drive Space - Brake C - Change camera mode ",
        "url": "https://html5.gamemonetize.com/skgl38xo2yo93ikgbkpozxjrz9b2img5/",
        "category": "Racing",
        "tags": "3D, Arcade, Car, Cars, Driving, Race, Racing, Undead, Unity3D, WebGL, Zombie",
        "thumb": "https://img.gamemonetize.com/skgl38xo2yo93ikgbkpozxjrz9b2img5/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "46981",
        "title": "SQUID SKIBIDI",
        "description": "SQID SKIBIDI is mixed game between each of squid game and squibidi its a really fun game where you have to drag your mouse when the green light is on to run and stand without making any move when the red light is on.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/zc2smtbp08wzv5i69fkq5s9j1zvh6uvj/",
        "category": "Racing",
        "tags": "Action, Adventure, Android, Brain, HTML5, iPhone, Mobile, running, Timing",
        "thumb": "https://img.gamemonetize.com/zc2smtbp08wzv5i69fkq5s9j1zvh6uvj/512x384.jpg",
        "width": "300",
        "height": "600"
    },
    {
        "id": "46998",
        "title": "Car Avoid Game",
        "description": "A car avoid game in which you must avoid the other cars on the road as well as the pedestrians. If you hit 3 cars its game over! If you hit a pedestrians the police will come after you. You can try to avoid the police if you can, but otherwise its game over!",
        "instructions": "Touch or use the mouse to move the car left or right to change lanes so that you avoid the oncoming traffic and pedestrians ",
        "url": "https://html5.gamemonetize.com/58k2sizfjc4jarv0ai7psakhx9wukcv8/",
        "category": "Racing",
        "tags": "Arcade, Avoid, Car, Driving, Hypercasual",
        "thumb": "https://img.gamemonetize.com/58k2sizfjc4jarv0ai7psakhx9wukcv8/512x384.jpg",
        "width": "480",
        "height": "864"
    },
    {
        "id": "45566",
        "title": "Motor Racing in Space",
        "description": "Are you ready for an action-packed journey in space? Collect diamonds and power up your engine while staying alive. You can also purchase new and faster engines with the diamonds you collect. Challenging and dangerous paths await you. Will you be able to reach the end of this 30-level motor riding adventure? Then start accelerating!",
        "instructions": "You can use the A S D and W keys to play the game Alternatively you can also play the game using the arrow keys",
        "url": "https://html5.gamemonetize.com/kw3od9y7balbsj8esnt64k8ovme1fi7r/",
        "category": "Racing",
        "tags": "Action, Bike, Funny, Game, HTML5, Motorcycle, Racing, Road, Sports",
        "thumb": "https://img.gamemonetize.com/kw3od9y7balbsj8esnt64k8ovme1fi7r/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "39336",
        "title": "Parking Challenge 2",
        "description": "Get behind the wheel, find a place where to put the car and park it neatly. If cause damage to the vehicle, then immediately lose. Get driving skills in order to avoid difficult obstacles and not touch the curbs. Sometimes we have to count every move, so as not to face and meet for the time that is given to complete the task.",
        "instructions": "Use arrow keys or on screen buttons to drive ",
        "url": "https://html5.gamemonetize.com/nqj312kwrj8cak1gbr8eo9crl8wuvfsw/",
        "category": "Racing",
        "tags": "1 Player, Arcade, Best, Driving, Fun, HTML5, Mobile, Parking, Skill",
        "thumb": "https://img.gamemonetize.com/nqj312kwrj8cak1gbr8eo9crl8wuvfsw/512x384.jpg",
        "width": "960",
        "height": "540"
    },
    {
        "id": "47173",
        "title": "ATV Ultimate Offroad",
        "description": "A great ATV simulator is beginning with the ATV Ultimate OffRoad game! The game consists of great game modes like races, free drive modes, and lots of gaming features. Participate in races in 2 player game mode or drive your ATV in a huge free driving map, however, you want. There are various ATV options in the game. You can unlock the locked ATVs by earning money or gears from the races and on a free map. Let another supercar game adventure begin!",
        "instructions": "Player 1 Move W A S D or ARROW KEYS NOS L-SHIFT Change camera C Restart position R Player 2 Move ARROW KEYS NOS M Change camera K Restart position P",
        "url": "https://html5.gamemonetize.com/pobxo4lajobw9ls5d9j1wgevq41psezx/",
        "category": "Racing",
        "tags": "2 Player, 2 Player Games, 3D, 3D Games, Car, car tuning, crash, Driving, monstertruck, Race, Racing",
        "thumb": "https://img.gamemonetize.com/pobxo4lajobw9ls5d9j1wgevq41psezx/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47007",
        "title": "Doodle Run 3D :Hard Mode",
        "description": "Doodle Run 3D goal is to end the race fast as you can and become the first. Avoid all collision with any object because they will slow your speed and make you troubles. each level is harder than the other have a good luck.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/ayhdbh9te397jkvv5c7592xvgt9q0plb/",
        "category": "Racing",
        "tags": "Adventure, Android, Funny, HTML5, Mobile, Race, run",
        "thumb": "https://img.gamemonetize.com/ayhdbh9te397jkvv5c7592xvgt9q0plb/512x384.jpg",
        "width": "800",
        "height": "600"
    }
]