[
    {
        "id": "52208",
        "title": "Shaolin Soccer",
        "description": "It is an engaging puzzle game where your objective is to descend safely. It appears straightforward at first glance but offers profound depth. Navigate through numerous levels, honing your intellect while enjoying the journey. Website Developer <a href='https://www.bestcrazygames.com/home/keyword/stickman'>https://www.bestcrazygames.com/home/keyword/stickman</a>",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/1re3k4h9vkknttyops13remtr23af95n/",
        "category": "Soccer",
        "tags": "Android, Ball, Football, HTML5, iPad, iPhone, Mobile, Soccer",
        "thumb": "https://img.gamemonetize.com/1re3k4h9vkknttyops13remtr23af95n/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "49638",
        "title": "Soccer Hero",
        "description": "A single player football game with multiple characters that can be developed and upgraded, using buttons to move and kick the ball.",
        "instructions": "Press the button to control the characters movement and kicking method ",
        "url": "https://html5.gamemonetize.com/cl9ik2kgtk7kxt89jl9hr1dbzfxmv7k5/",
        "category": "Soccer",
        "tags": "1 Player, Football, Soccer",
        "thumb": "https://img.gamemonetize.com/cl9ik2kgtk7kxt89jl9hr1dbzfxmv7k5/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "48631",
        "title": "Grimace Ball Jumpling",
        "description": "Help Grimace to not let the ball fall! How many times you can juggle these two soccer balls? How to play: - Tap left side of screen to kick the left football - Tap right side of screen to kick the right football Warning: This game create dependence! :-)",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/2eeizpsva0s0kdpw0zf5trn08s98fsva/",
        "category": "Soccer",
        "tags": "Arcade, Football, Grimace, Grimace Shake, HTML, HTML5, Soccer, Sport",
        "thumb": "https://img.gamemonetize.com/2eeizpsva0s0kdpw0zf5trn08s98fsva/512x384.jpg",
        "width": "600",
        "height": "1024"
    },
    {
        "id": "46420",
        "title": "Run and Shoot: GOAL!",
        "description": "Run without hitting obstacles and opposing team players. collect as much blue power as you can and hit the ball harder. Then direct the ball and try to pass the goalkeeper. You can score your goal and move on to the next level! According to the power you collect, the of the ball increases and the probability of the goalkeeper to save decreases. If you want, you can transfer between halftime and change your character. hitting sticks loses 1 power. hitting obstacles lose 10 power",
        "instructions": "Player movement - Left arrow key for move left - Right arrow key for move right - Spacebar for Jump Ball movement - Left and Right arrow keys - If you can score a goal you pass the level ",
        "url": "https://html5.gamemonetize.com/sfgt6xl9hugkmihr98y1jzma6t7knvl9/",
        "category": "Soccer",
        "tags": "1 Player, 3D, 3D Games, Action, Ball, endless, Football, Platform, run, running, Shoot, Soccer",
        "thumb": "https://img.gamemonetize.com/sfgt6xl9hugkmihr98y1jzma6t7knvl9/512x384.jpg",
        "width": "1520",
        "height": "855"
    },
    {
        "id": "48370",
        "title": "Skibidi Toilet Ball Juggling",
        "description": "Help Skibidi Toilet to not let the ball fall! How many times you can juggle these two soccer balls? How to play: - Tap left side of screen to kick the left football - Tap right side of screen to kick the right football Warning: This game create dependence :)",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/4dtfkvch0u66bm4hum60gl4dibqulc19/",
        "category": "Soccer",
        "tags": "Boy, HTML, Mobile, Skibidi, Skibidi Toilet, Soccer, Sport",
        "thumb": "https://img.gamemonetize.com/4dtfkvch0u66bm4hum60gl4dibqulc19/512x384.jpg",
        "width": "600",
        "height": "1024"
    },
    {
        "id": "48310",
        "title": "Skibidi Toilet Soccer",
        "description": "Skibidi is a great goalkeeper in soccer training! Use your finger to slide goalkeeper to the kicked penalty. As a super goalkeeper you must protect your goal from as much incoming balls as you can. How to Play: - The computer will shoot soccers - Just swipe the screen to control Skibidi Enjoy your soccer game! Become a Skibidi Soccer Goalkeeper Superstar!",
        "instructions": "Mouse click or touch the screen to play ",
        "url": "https://html5.gamemonetize.com/sy3abv7l2dkmrmt8ez8s30wsyrrnpodo/",
        "category": "Soccer",
        "tags": "Arcade, Casual, HTML5, Mobile, Skibidi, Skibidi Toilet, Soccer, Sport",
        "thumb": "https://img.gamemonetize.com/sy3abv7l2dkmrmt8ez8s30wsyrrnpodo/512x384.jpg",
        "width": "768",
        "height": "600"
    },
    {
        "id": "48192",
        "title": "Heads Up Skibidi",
        "description": "Heads Up Skibidi is a head-ball game where one player is the skibidi head and poo picker. The skibidi head wears a blindfold and tries to head the ball into the poo pickers mouth. The poo picker tries to dodge the ball and pick up as much poo as possible.",
        "instructions": "Desktop Use the right click and Drag of the mouse to move objects right and left Mobile Drag the Left and Right screens to move objects ",
        "url": "https://html5.gamemonetize.com/06ab0i2mp4ks3ul4iipkhoul1viwah2m/",
        "category": "Soccer",
        "tags": "1 Player, Arcade, Best Games, Classic, Fun, Game, Games, NapTech Games, Ski, Skibidi, Skibidi Toilet, Spongebob, Sport, Sports",
        "thumb": "https://img.gamemonetize.com/06ab0i2mp4ks3ul4iipkhoul1viwah2m/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "48179",
        "title": "Liga Super Malaysia",
        "description": "Permainan Bola Sepak Liga Super Malaysia Pengalaman Liga Super Malaysia: Terlibatlah dalam dunia Liga Super Malaysia yang terkenal, dengan pasukan-pasukan terbaik dari liga ini. Kawal Pasukan Anda: Gunakan jari anda untuk mengawal pemain-pemain dan mengarahkan laluan mereka untuk menjaringkan gol. Pasukan dan Stadium Terkenal: Mainkan dengan pasukan kegemaran anda di stadium-stadium terkenal dari Liga Super Malaysia. Sertai Turnamen Menarik: Ambil bahagian dalam pelbagai turnamen yang menarik dan tunjukkan kemahiran anda dalam permainan. Mod Latihan Taktikal: Latihlah kemahiran anda dalam mod latihan sebelum berentap dalam pertandingan",
        "instructions": "Guna Tetikus",
        "url": "https://html5.gamemonetize.com/cdjjmn1cbil1e0avgn054wv67ukyu2gx/",
        "category": "Soccer",
        "tags": "Football, Soccer",
        "thumb": "https://img.gamemonetize.com/cdjjmn1cbil1e0avgn054wv67ukyu2gx/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47534",
        "title": "Squad Goals: Soccer 3D",
        "description": "Squad Goals is fun and simple 3D soccer game that can quickly turn into a crazy ball brawl! No cards, fouls, or offsides! Slide, tackle, dribble, kick, shoot, and score &ndash; all with just one finger! Whoever scores first wins the match! Rise through the ranks to dominate the game! Key game features: &bull; One-finger on-screen joystick controls, with support for mouse and keyboard &bull; Upgrade character traits to unlock full potential &bull; Level up to rise through the ranks &bull; Shop for cosmetics to customize your character, ball, and stadium &bull; Complete daily quests to earn more coins &bull; Daily and ho rewards &bull; Play in two modes: ARENA or TEAM vs TEAM",
        "instructions": " bull Touch Mouse TAP CLICK and DRAG to RUN RELEASE to SLIDE SHOOT or PASS bull Keyboard Press arrow keys or WASD to RUN Release arrow keys or press SPACE to SLIDE SHOOT or PASS",
        "url": "https://html5.gamemonetize.com/413slo2x1o8km5rs8vb6ikya691zsm78/",
        "category": "Soccer",
        "tags": "3D, Alien, Android, Animal, Ball, Basketball, Football, Robot, Skill, Soccer, Sport, Sports, Tennis, Zombie",
        "thumb": "https://img.gamemonetize.com/413slo2x1o8km5rs8vb6ikya691zsm78/512x384.jpg",
        "width": "1024",
        "height": "1820"
    },
    {
        "id": "46375",
        "title": "Messi vs Ronaldo KTT",
        "description": "Messi and Ronaldo find themselves in competition on another continent. Play this unique version of Kick Tac Toe, where you play as Messi or Ronaldo against your foe and try to win. You can also play against your friends in 2 player mode",
        "instructions": "Swipe to kick and hit blocks to reveal your teams logo",
        "url": "https://html5.gamemonetize.com/l55plwa1pm7lz65c6wmu3bg3yk5aggsn/",
        "category": "Soccer",
        "tags": "2 Player, Soccer, Sports",
        "thumb": "https://img.gamemonetize.com/l55plwa1pm7lz65c6wmu3bg3yk5aggsn/512x384.jpg",
        "width": "450",
        "height": "800"
    }
]