[
    {
        "id": "52197",
        "title": "Golf Tour",
        "description": "Golf Tour is a game in which you need to drive the golf ball into the hole by moving along the platforms, planning the route and avoiding obstacles. On your way, you will meet stone blocks that need to be broken, magical blocks that need to be skipped in time, as well as metal blocks that need to be disabled.",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/0uywvc2jzafqk7ccld7510q52e02ly45/",
        "category": "Sports",
        "tags": "Ball, Best, Fun, Golf, Mobile, Skill",
        "thumb": "https://img.gamemonetize.com/0uywvc2jzafqk7ccld7510q52e02ly45/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "52181",
        "title": "Asian Cup Soccer",
        "description": "Asian Cup soccer/football is here and here is your chance to participate with your favorite team. Go from the round of 16 to the finals and try to win that cup. If you can you can also win other trophies such as the golden boot",
        "instructions": "Use the mouse to play this game for desktop Click on the screen to rotate for touch screens ",
        "url": "https://html5.gamemonetize.com/to276chdeobtg4yl7zdtc64utvglsqi8/",
        "category": "Sports",
        "tags": "Football, Soccer, Sports",
        "thumb": "https://img.gamemonetize.com/to276chdeobtg4yl7zdtc64utvglsqi8/512x384.jpg",
        "width": "960",
        "height": "540"
    },
    {
        "id": "51997",
        "title": "Goal Finger Soccer",
        "description": "Finger Football, also known as button football, penny football, coin football or foosball, is a button game played on a tabletop. It is also known as button football, penny football, coin football or foosball. Various people know this game by different names around the world, including football caps, industrial and various other names, and other variations. Choose your team and complete 100 levels one by one",
        "instructions": "Mobile Touch PC Mouse",
        "url": "https://html5.gamemonetize.com/7zrcsiy3lu247f5wfwm3altefzrzwf9z/",
        "category": "Sports",
        "tags": "1 Player, Android, Casual, Football, HTML5, Shoot, Soccer",
        "thumb": "https://img.gamemonetize.com/7zrcsiy3lu247f5wfwm3altefzrzwf9z/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "32632",
        "title": "Soccer training",
        "description": "Welcome to soccer training! Would you like to pactice your dribble skill? Try out and see how long you can bounce the ball into the air and catch points until you drop it! And if thats not enoug there will be obstacles coming your way to really test your skill! Try it out now and see how good you are with the ball! Remember, dont let the ball touch the ground!",
        "instructions": "Mouse click or tap to play dont let the ball touch the ground ",
        "url": "https://html5.gamemonetize.com/r8n838myi546zysv99tkg71dzb4xwovn/",
        "category": "Sports",
        "tags": "Click, Sports",
        "thumb": "https://img.gamemonetize.com/r8n838myi546zysv99tkg71dzb4xwovn/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47005",
        "title": "Pixel Sumo",
        "description": "Show your superiority by collecting five points in fierce competition against your friends. Be the first to reach five points by knocking your opponent out of the field. Unleash your skills,as the ultimate champion. Get ready for thrilling matches and unforgettable moments of triumph. Enjoy the exhilarating experience!",
        "instructions": "Keyboard You can move the blue character with the W key You can move the red character with the up arrow key Mobile You can control the characters with the Red and Blue button ",
        "url": "https://html5.gamemonetize.com/i7ya8w9dnnwvgv886ibs3wrnnx1xq07o/",
        "category": "Sports",
        "tags": "2 Player, Mobile, Sports, sumo",
        "thumb": "https://img.gamemonetize.com/i7ya8w9dnnwvgv886ibs3wrnnx1xq07o/512x384.jpg",
        "width": "417",
        "height": "274"
    },
    {
        "id": "51409",
        "title": "Head Shot Super League",
        "description": "You can play friendly match or league match in this game. Heading - Super League: Control the ball with your head, beat the opponent! Compete in leagues and become champions.",
        "instructions": "You can play arrow and space button ",
        "url": "https://html5.gamemonetize.com/w56iu6sa21fl5h44st8q76x1yzrw5ekp/",
        "category": "Sports",
        "tags": "Football, Soccer, Sport, Sports",
        "thumb": "https://img.gamemonetize.com/w56iu6sa21fl5h44st8q76x1yzrw5ekp/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51274",
        "title": "Mini Tennis Club",
        "description": "Take part in an amazing tennis match and enjoy the swift and fluent game. Practice before joining a tournament, because playing is easy, but mastering all the moves is not so much Have fun with this entertaining 3D tennis game with this new Mini Tennis Club game, a casual game compete against other players and beat them all and you can unlock new characters.Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
        "instructions": "Use the mouse or touch to play",
        "url": "https://html5.gamemonetize.com/49eln5cwqtgvyhxuxvb8ksp8jkz33h81/",
        "category": "Sports",
        "tags": "1 Player, 2 Player, 3D, Clicker, kiz10, Sport",
        "thumb": "https://img.gamemonetize.com/49eln5cwqtgvyhxuxvb8ksp8jkz33h81/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "51047",
        "title": "Muscle Clicker: Gym game",
        "description": "Muscle Clicker shows you what it&rsquo;s like to make a skinny person muscular with hard work at the gym. In this game, you need to train and compete to earn money. But, it&rsquo;s not easy as your stamina runs out when you continuously exercise. Then, when you have sufficient funds, you can buy more equipment to help you gain muscles, money, and experience. As you gain more experience, you can also increase your strength and stamina. Join the fun and become a muscle building pro with Muscle Clicker.",
        "instructions": "Click on the character and he will start training The faster you tap the easier it will be for you to lift dumbbells do pull-ups and squat with a barbell While training on stationary bikes you can maintain the tap for continuous exercise ",
        "url": "https://html5.gamemonetize.com/t2d34yzcod0b3o4kqayfnia4cce3gjf2/",
        "category": "Sports",
        "tags": "1 Player, 2D, Cartoon, Casual, Click, Clicker, Game, HTML5, RPG, Simulation, Simulator, Sport, Sports, Train",
        "thumb": "https://img.gamemonetize.com/t2d34yzcod0b3o4kqayfnia4cce3gjf2/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "50607",
        "title": "Hockey World Cup 2024",
        "description": "Shoot on goal and defend against the best in the Hockey World Cup tournament. Are you good enough to win it all and win that trophy?",
        "instructions": "Swipe to shoot mouse or finger Click mouse or tap when defending Keeper will go where you click or tap",
        "url": "https://html5.gamemonetize.com/brhk620edkzf7secmniydd073e2a8pxm/",
        "category": "Sports",
        "tags": "hockey, Sports",
        "thumb": "https://img.gamemonetize.com/brhk620edkzf7secmniydd073e2a8pxm/512x384.jpg",
        "width": "550",
        "height": "800"
    },
    {
        "id": "49965",
        "title": "Dunk Challenge",
        "description": "Shoot and score with Dunk Challenge, a 2D basketball game that will make you bounce with joy. You will play as a basketball shooter. You will also enjoy a new explosive mode that adds more fun and challenge to your gameplay. You will tap the screen to shoot and use your 14 bullets wisely to make the ball rebound and land in the hoop. You will also collect purple diamonds and explore the store, where you can find 15 different ball skins to customize your game. Don&rsquo;t miss this addictive game!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/kfc9v33e6eh3e0iurinpfkfggmsoq9l4/",
        "category": "Sports",
        "tags": "2D, Basketball, Boys, Casual, Girls, Highscore, Kids",
        "thumb": "https://img.gamemonetize.com/kfc9v33e6eh3e0iurinpfkfggmsoq9l4/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "50650",
        "title": "Air Hockey Cup",
        "description": "Fasten your skates and winter jacket. Your favorite ice sport is here in a new fun form. Move your tokens like real players and get the puck under control. Climb the ranks and destroy the tournaments!",
        "instructions": "Shoot the tokens to score a goal Advance in the league and win tournaments Use the money from your victories to upgrade your tokens buy rings or different formations ",
        "url": "https://html5.gamemonetize.com/ef9qq4qgxq1fa0ie4gv1t3igpvx029tm/",
        "category": "Sports",
        "tags": "Air, hockey, HTML5, Ice",
        "thumb": "https://img.gamemonetize.com/ef9qq4qgxq1fa0ie4gv1t3igpvx029tm/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50382",
        "title": "The Best Russian Billiards",
        "description": "Are you ready to play The Best Russian Billiards? This realistic billiards featuring stunning 3D graphics is for players of all levels. Worthy rivals are waiting for you! Get in the game and let them know who you are! There are two play modes: against a virtual rival and online. Try both and choose the one you like better. You can even choose the design of interiors, the color of the balls, a cue and other accessories to your taste all of them are available in the store. Two view modes and a sight allow to line up the shots accurately and consistently. Just start playing and enjoy!",
        "instructions": "Sight the aiming point by keeping the mouse button pressed and moving the pointer Choose the force of the stroke moving the cue on the right of the screen Your goal is to be the first to pocket 8 balls ",
        "url": "https://html5.gamemonetize.com/i5bwxw1fst4xsezqwa4p5oxl6z037kqm/",
        "category": "Sports",
        "tags": "1 Player, 2 Player, 2 Player Games, 3D, 3D Games, 8 Ball Pool, Adult, Android, Arcade, Ball, Simulation, Simulator, Sport, Sports",
        "thumb": "https://img.gamemonetize.com/i5bwxw1fst4xsezqwa4p5oxl6z037kqm/512x384.jpg",
        "width": "1500",
        "height": "900"
    },
    {
        "id": "50290",
        "title": "Extreme Volleyball",
        "description": "The game Extreme Volleyball is a variation on the subject of volleyball. In this game, players will be robots. And unlike normal volleyball instead of the ball will be a bomb. A bomb is known to have a tendency to explode ... The purpose of game to blow up a bomb on the territory of the opponent. The bomb blows up, if it concerns a floor, there were more than three contacts of a bomb or time of burning of a fuse ended. In the game settings menu you can select the number of bombs, bomb fuse burning time, game difficulty level and location of your robot.",
        "instructions": "Key left - move to the left Key right - move to the right Key up - bounce Key space - bounce",
        "url": "https://html5.gamemonetize.com/e8slra8oygqa8ynmnix90y8xl0yjcuq3/",
        "category": "Sports",
        "tags": "1 Player, 2D, Ball, Robot",
        "thumb": "https://img.gamemonetize.com/e8slra8oygqa8ynmnix90y8xl0yjcuq3/512x384.jpg",
        "width": "800",
        "height": "480"
    },
    {
        "id": "50048",
        "title": "Halloween Hoops",
        "description": "Scary game of hoops at the local graveyard playground. Watch out for zombie defenders, hit ghosts for extra points and enjoy a game of hoops. All in this cool Halloween game",
        "instructions": "Aim with finger or mouse release to shoot",
        "url": "https://html5.gamemonetize.com/aig4pxdqzoun4i8b1ngvon6vvshjbti3/",
        "category": "Sports",
        "tags": "Basketball, Halloween, Monster, Shooting, Sports",
        "thumb": "https://img.gamemonetize.com/aig4pxdqzoun4i8b1ngvon6vvshjbti3/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "50029",
        "title": "Halloween Soccer",
        "description": "What could be better than a fun challenging game where Halloween gets mixed with soccer and the most famous soccer players around. 10 fun levels with surprises and challenges. Have fun and earn trophies by completing challenges.",
        "instructions": "Finger or mouse to swipe and shoot Finger or mouse to move player on pumpkin juggling levels",
        "url": "https://html5.gamemonetize.com/qtfxbvlvbo4joy3ljjiu5bp80km2ydem/",
        "category": "Sports",
        "tags": "Halloween, Soccer",
        "thumb": "https://img.gamemonetize.com/qtfxbvlvbo4joy3ljjiu5bp80km2ydem/512x384.jpg",
        "width": "500",
        "height": "800"
    },
    {
        "id": "49940",
        "title": "Mini Soccer",
        "description": "Mini Soccer is a fast-paced sports football game where you can challenge your friends or play with the CPU. Choose your favorite player and play against the CPU for the tournament or be the best of your friends in the versus mode. With players to choose from the best teams of the world, 3 game fields, and all the arcade fun in a single game.",
        "instructions": "- When playing against the computer Right and left arrow keys right left move Up arrow key jump Z and X keys hit - When playing in the with a friend mode Player 1 Arrows move Z X hit the ball Player 2 WSAD move 1 2 hit the ball - O",
        "url": "https://html5.gamemonetize.com/or51fhgaqtlb2fldz8opctagkirnp0ys/",
        "category": "Sports",
        "tags": "2 Player, 2 Player Games, 2D, Soccer",
        "thumb": "https://img.gamemonetize.com/or51fhgaqtlb2fldz8opctagkirnp0ys/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49015",
        "title": "1 On 1 Soccer",
        "description": "1 on 1 Soccer is a simple soccer game that can be played with 1 or 2 players. Choose your country and play against a friend or the computer in a fast-paced match! Score as many goals as you can against your opponent before the time runs out!",
        "instructions": "Player 1 arrow keys - Player 2 WASD",
        "url": "https://html5.gamemonetize.com/9mj80xfti37ayutvlybw5seqgllgs690/",
        "category": "Sports",
        "tags": "1 Player, 2 Player, 2 Player Games, Football, Game, Games, HTML, HTML5, Online, Soccer, Sport, Sports",
        "thumb": "https://img.gamemonetize.com/9mj80xfti37ayutvlybw5seqgllgs690/512x384.jpg",
        "width": "800",
        "height": "580"
    },
    {
        "id": "49767",
        "title": "Ship Control 3D",
        "description": "Get ready for an exhilarating ship sailing adventure in Ship Stack Racing, a 3D arcade game that will challenge your skills. You have to dodge various obstacles and make it to the beach in one piece. But watch out, as any collision will end your run. Ship Stack Racing is a game that will make your heart race and your adrenaline pump.",
        "instructions": "Drag and swipe to move your ship",
        "url": "https://html5.gamemonetize.com/brc4hded4g3hv0h4ja4urb5vllz5zuww/",
        "category": "Sports",
        "tags": "Avoid, Boat, Boys, Casual, Cute, Girl, Kids",
        "thumb": "https://img.gamemonetize.com/brc4hded4g3hv0h4ja4urb5vllz5zuww/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "49618",
        "title": "Snow Rally",
        "description": "SNOW RALLY is an exciting racing game where you drive your car on snowy and icy tracks. Based on realistic physics, this game challenges you to masterfully drive your car in the coldest and most inhospitable places on the planet. The game features different difficulty levels and modes, providing an interesting and varied gameplay experience. Each level offers unique obstacles and challenges, requiring skill, precision and quick response. With beautiful graphics, inspiring soundtrack and smooth controls, SNOW RALLY promises to provide you with hours of addictive gameplay. Choose your car, customize it to suit your driving style and go raci",
        "instructions": "Drive through snowy mountains in this racing game based on the laws of physics Play for free Take on challenging driving tasks in the most dangerous inhospitable and coldest places in the world Show that you are the best racer on ice roads ",
        "url": "https://html5.gamemonetize.com/ipqdoc741flxpu6ho3su43k20h79k6mx/",
        "category": "Sports",
        "tags": "1 Player, Car, Race, Snow, vehicle",
        "thumb": "https://img.gamemonetize.com/ipqdoc741flxpu6ho3su43k20h79k6mx/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "48680",
        "title": "Basketball FRVR",
        "description": "Do you love basketball? Do you want to test your skills and have fun at the same time? Then you should try Basketball Shoot, a 3D simulation game that challenges you to score as many baskets as you can. You can use your mouse to adjust the power and angle of your shot and choose the right moment to release the ball. The more baskets you make, the higher your score will be. But be careful, if you miss a shot, you will have to start over. Try Basketball Shoot today! Have fun!",
        "instructions": "Slide to play",
        "url": "https://html5.gamemonetize.com/ayfldl6qyv3aehsu2pmbc5oz9rgfhhz2/",
        "category": "Sports",
        "tags": "Baseball, Boy, Casual, Girl, Highscore, Hypercasual, Kids, Shoot, Sport",
        "thumb": "https://img.gamemonetize.com/ayfldl6qyv3aehsu2pmbc5oz9rgfhhz2/512x384.jpg",
        "width": "750",
        "height": "1334"
    },
    {
        "id": "49603",
        "title": "Halloween Head Soccer",
        "description": "Are you ready to go head to head on a football match? Choose mode 1P or 2P to get started. Choose your favorite Halloween character! Hit the ball into the goal to score points before the time runs out. The player with the most goals wins the game",
        "instructions": "GAME CONTROLS Single-player Mode- Arrow keys to move Z X for shoot Player 1 - A D keys to move N M for shoot Player 2 - Arrow keys to move 1 2 for shoot",
        "url": "https://html5.gamemonetize.com/j06hqptx0yf7x3o2ylart0hktgih6ocm/",
        "category": "Sports",
        "tags": "Action, Multiplayer, Sport, Sports",
        "thumb": "https://img.gamemonetize.com/j06hqptx0yf7x3o2ylart0hktgih6ocm/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49366",
        "title": "T20 Cricket",
        "description": "Come and join the T20 cricket game! It takes place in a busy stadium with excited fans. The game is played on a green field. Pick the Bangladesh cricket team and show off your amazing skills and strategies. In this game, the bowler runs quickly towards the wicket and throws the ball fast. You have to play the role of the batsman and have to react quickly and either defend the ball or hit it hard. Showcase your cricket skills in front of others in your group.",
        "instructions": "Mobile Tap on the screen to hit the ball PC Click on the screen to hit the ball ",
        "url": "https://html5.gamemonetize.com/3tgpavmaczut7bt1k4wgjkj09wco7s06/",
        "category": "Sports",
        "tags": "Arcade, Ball, Hypercasual, NapTech Games, Sport, Sports",
        "thumb": "https://img.gamemonetize.com/3tgpavmaczut7bt1k4wgjkj09wco7s06/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "49156",
        "title": "Basketball Kings 2024",
        "description": "Enter one of the four basketball courts and outshine everyone wherever you go. Zero-in on the hoop and shoot! Reach a high score to unlock new balls. Which ball will you play best with?",
        "instructions": "A simple basketball game where your goal is to shoot the basket as many times as you can within the time limit You have to be quick and precise Try to reach the highest score and new balls will unlock The longer you play the less place for mistakes yo",
        "url": "https://html5.gamemonetize.com/xnzfab1hm5q86ofc9z9zuibgibo2wcrl/",
        "category": "Sports",
        "tags": "Arcade, Ball, Basketball, Shoot, Sport, Sports",
        "thumb": "https://img.gamemonetize.com/xnzfab1hm5q86ofc9z9zuibgibo2wcrl/512x384.jpg",
        "width": "600",
        "height": "800"
    },
    {
        "id": "49237",
        "title": "Sumo Smash!",
        "description": "Step into the ring and embrace the ancient art of Sumo&mdash; with a twist! Welcome to Sumo Smash! an exhilarating game where youll wrestle for supremacy while indulging in a sushi feast to grow your sumo size. Features: Grow to Dominate. Push to Win. Treasure Chests &amp; Skins: Unlock treasure chests found within the arena to collect unique skins",
        "instructions": "WASD or QZSD to move on desktop Touch to move on mobile ",
        "url": "https://html5.gamemonetize.com/zyjcvyrbjdb4400t324nzijc1in3hi5k/",
        "category": "Sports",
        "tags": ".io, .io Games, 3D, 3D Games, Action, Arcade, Arena, Avoid, Bounce, Fighting, Funny, sumo",
        "thumb": "https://img.gamemonetize.com/zyjcvyrbjdb4400t324nzijc1in3hi5k/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48503",
        "title": "Motor Stunt Simulator 3D",
        "description": "The most thrilling motorcycle stunt game is here! In Motor Stunt Simulator 3D, you can enjoy the most exciting tracks! Each level brings you a new experience! Each level has a unique design! Can you pass them all? The most important thing is that each level has three stars! They are in different places! Can you find them all? Try this game! Have fun!",
        "instructions": "W Accelerate S backward A Steer left D Steer right",
        "url": "https://html5.gamemonetize.com/sx60zz45e6khlxbs4if4f11cgbmll81s/",
        "category": "Sports",
        "tags": "3D, Avoid, Bike, Collecting, Platform, Simulation, Stunts",
        "thumb": "https://img.gamemonetize.com/sx60zz45e6khlxbs4if4f11cgbmll81s/512x384.jpg",
        "width": "1334",
        "height": "750"
    },
    {
        "id": "48450",
        "title": "All Way Down",
        "description": "it simple game you play as a golf ball that your mission is just to get away from those traps to win the level there is only 4 level but there 2 modes different first one normal is easy and slow fall but only legends can complete those 4 levels in hard mode",
        "instructions": "A D S W for move R to restart the level ",
        "url": "https://html5.gamemonetize.com/2mfowg7fi9trcshs07mv13fyv50c90rk/",
        "category": "Sports",
        "tags": "3D Games, Ball, Fun, Golf, Hypercasual, Physics, Skill, Sport",
        "thumb": "https://img.gamemonetize.com/2mfowg7fi9trcshs07mv13fyv50c90rk/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48498",
        "title": "Skibidi Basket",
        "description": "Skibidi Toilet Basketball is a simple but very Addictive game which base on realistic physics! Tap and slide the Skibidi Toilet ball, control its angle and power, then shoot towards the hoop. The perfect effect and physic effect will help you see more clearly. The game is an endless arcade game, then shoot towards the hoop to win the levels; as the difficulty could increases, there are four different random movements for the hoop. You have just 3 shoots to complete each level! Are you able to try to sign the best record in the leaderboard? HOW TO PLAY: 1. Touch the screen! 2. Drag the ball to change the power and angle! 3. Release to shoot!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/xttsh0p5t89s0nx8fc2ariyade3whekt/",
        "category": "Sports",
        "tags": "Basketball, Skibidi, Skibidi Toilet, Sport",
        "thumb": "https://img.gamemonetize.com/xttsh0p5t89s0nx8fc2ariyade3whekt/512x384.jpg",
        "width": "1024",
        "height": "600"
    },
    {
        "id": "48549",
        "title": "Bicycle Guys",
        "description": "Welcome to Bicycle Guys&zwj;&zwj;, the ultimate mobile game! Navigate unique obstacles for high scores . Stunning graphics and immersive sound amplify the excitement. Show agility, timing, and reflexes to avoid ramps, barriers, and moving objects. Its user-friendly for all skill levels. Compete endlessly, break records, and establish your supremacy. Experience addictive gameplay, captivating visuals, and escalating challenges. Hop on your virtual bike and become a cycling champ! Your journey starts now!",
        "instructions": "Click and drag to move",
        "url": "https://html5.gamemonetize.com/8i3xhrycrbfe64qsrb5kcqs472rgy29n/",
        "category": "Sports",
        "tags": "1 Player, 3D Games, Bike, BMX Games, Casual, endless, Family, Game, Games, Highscore, HTML5, Hypercasual, jump, Stunts",
        "thumb": "https://img.gamemonetize.com/8i3xhrycrbfe64qsrb5kcqs472rgy29n/512x384.jpg",
        "width": "540",
        "height": "1024"
    },
    {
        "id": "48980",
        "title": "Skibidi Toilet Pong",
        "description": "Get ready to dive into the hilariously entertaining world of Skibidi Toilet Pong, the ultimate 2-player pong game that guarantees endless laughter and heaps of fun. And heres the best part &ndash; you can enjoy this side-splitting game online, completely free of charge! Challenge your friends or family to a game thats sure to keep you entertained for hours. Skibidi Toilet Pong is not your ordinary pong game; it adds a quirky twist to the classic, making it an unforgettable gaming experience. So, grab a partner, aim, and shoot your way to victory in this uproarious adventure that wont cost you a penny to play.",
        "instructions": "Use W S and Up and Down arrow to play ",
        "url": "https://html5.gamemonetize.com/0o124x0fb0vd51286iigv4hz5oam9b2c/",
        "category": "Sports",
        "tags": "2 Player, Arcade, HTML5, Kids, Skibidi, Skibidi Toilet, Skill, Sport",
        "thumb": "https://img.gamemonetize.com/0o124x0fb0vd51286iigv4hz5oam9b2c/512x384.jpg",
        "width": "854",
        "height": "480"
    },
    {
        "id": "48690",
        "title": "Grimace Penalty",
        "description": "The Grimace Penalty Goal Game is a fun and challenging game where you have to attempt to score a penalty goal against a Grimace. To score a goal, you need to time your shot carefully and aim for the right spot in the goal. The Grimace will move around, so you need to be quick and accurate if you want to succeed. If you miss three goal, the game will be over.",
        "instructions": "PC You can use the mouse to click on the football and aim at the net Mobile Tap on the football and aim at the net then swipe to goal ",
        "url": "https://html5.gamemonetize.com/5u56pdgeqaju8sgzonpu8ktd4tkxm5ce/",
        "category": "Sports",
        "tags": "Action, Best Games, Football, Fun, Grimace, Grimace Shake, NapTech Games, Sport, Sports",
        "thumb": "https://img.gamemonetize.com/5u56pdgeqaju8sgzonpu8ktd4tkxm5ce/512x384.jpg",
        "width": "720",
        "height": "1280"
    },
    {
        "id": "48616",
        "title": "Grimace Vs Skibidi",
        "description": "Like in a great tennis game, Help Grimace to stopping the tennis balls fired by Skibidi! Toilet! but requires speed and precision, make one mistake and you&rsquo;re out! its may be simple to play but it&rsquo;s a challenge to get high scores! The longer You stay on ground, the faster the tennis balls will come at you and it is your job to return them while also avoiding flying bottles. Youre warned! the Platinum medal is VERY hard to complete! only if youre a true grand slam may catch it!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/solbljhembpof7yo8r23hu90gu1n5d3v/",
        "category": "Sports",
        "tags": "Grimace, HTML, HTML5, Skibidi, Skibidi Toilet",
        "thumb": "https://img.gamemonetize.com/solbljhembpof7yo8r23hu90gu1n5d3v/512x384.jpg",
        "width": "768",
        "height": "1024"
    },
    {
        "id": "48348",
        "title": "BasketMan : Joker In city",
        "description": "is about basket that should try to defeat joker with your bat things there 5 levels at level 5 you will meet the boss but level 6 only legends can win that level its same of level 5 but u dont have the shield that help you to dodge so you need to dodge everything by your self you need to collect 3 of black batman item",
        "instructions": "movements D right A Left H Batarang left shift shield level 5 only LeftMouseButton hold the left button to active robe will help to jump on places that higher ",
        "url": "https://html5.gamemonetize.com/t9gpb5ssdnzaq7h0q6nsy1b93osq5nek/",
        "category": "Sports",
        "tags": "1 Player, Air, Basketball, Batman, run, weapons",
        "thumb": "https://img.gamemonetize.com/t9gpb5ssdnzaq7h0q6nsy1b93osq5nek/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "48391",
        "title": "Goal Skibidi Goal",
        "description": "Goal Skibidi Goal is a fast-paced, physics-based soccer game where you control a little character with your head. The goal is to score more goals than your opponent by heading the ball into their net. You can jump, duck, and slide to control the ball, and you can also use power-ups to give yourself an edge.",
        "instructions": "Tap to Player for jump",
        "url": "https://html5.gamemonetize.com/hzeisj2a991z0lo3bhi2jf084bwllbk6/",
        "category": "Sports",
        "tags": "2D, Arcade, Ball, Football, Fun, Game, Games, NapTech Games, Online, Ski, Skibidi, Skibidi Toilet, Sports",
        "thumb": "https://img.gamemonetize.com/hzeisj2a991z0lo3bhi2jf084bwllbk6/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "48274",
        "title": "Drift Racing Top Gear Simulator",
        "description": "Get ready to drive high performance cars (turbo or naturally aspirated) and make them drift at high speed in tracks designed specifically for drift racing. Improve your racing and drifting skills and earn virtual money to tune and customize your car. Race to battle the world record of the leaderboard or just for fun in the freeride mode.",
        "instructions": "player 1 arrow keys - move V - change camera player 2 WASD - move C - change camera ",
        "url": "https://html5.gamemonetize.com/mh5b7q9ihedhyxaawcz6t48er909l6wx/",
        "category": "Sports",
        "tags": "1 Player, 3D Games, Arcade, Cars, drift, drifting, Driving, Race, Supercars",
        "thumb": "https://img.gamemonetize.com/mh5b7q9ihedhyxaawcz6t48er909l6wx/512x384.jpg",
        "width": "960",
        "height": "600"
    },
    {
        "id": "48300",
        "title": "Skibidi Toilet Tennis",
        "description": "Like in a great tennis game, Help Skibidi Toilet to stopping the tennis balls! but requires speed and precision, make one mistake and you&rsquo;re out! its may be simple to play but it&rsquo;s a challenge to get high scores! The longer You stay on ground, the faster the tennis balls will come at you and it is your job to return them while also avoiding flying bottles. Youre warned! the Platinum medal is VERY hard to complete! only if youre a true grand slam may catch it!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/90ie5u1rn2x61ly7yktw3dq6u5kbqj2m/",
        "category": "Sports",
        "tags": "Arcade, Ball, HTML5, Mobile, Skibidi, Skibidi Toilet, Sport, Sports, Tennis",
        "thumb": "https://img.gamemonetize.com/90ie5u1rn2x61ly7yktw3dq6u5kbqj2m/512x384.jpg",
        "width": "768",
        "height": "1024"
    },
    {
        "id": "48251",
        "title": "Upin Ipin Sepak Bola",
        "description": "Upin Ipin Sepak Bola Permainan bola sepak yang menyeronokkan. Mampukan anda menewaskan Upin di lapangan sepak bola? Ayoohh kita berseronok sambil bermain game sepak bola upin ipin ini",
        "instructions": "keyboard",
        "url": "https://html5.gamemonetize.com/dbc7mw2mns2ii57lkrbexvelvfhz90pz/",
        "category": "Sports",
        "tags": "Football, Kids, Soccer",
        "thumb": "https://img.gamemonetize.com/dbc7mw2mns2ii57lkrbexvelvfhz90pz/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47999",
        "title": "2d basketball runner",
        "description": "the game control is simple and easy is just hold left mouse button on the ball and chose the way that u want the ball move to but isnt too easy inside the game you need to pass all those things with physics",
        "instructions": " hold left mouse button on the ball or just click on the ball from direction that u want push the ball from",
        "url": "https://html5.gamemonetize.com/hxgw9ao48gub9cskdmlnfll19u99gsmt/",
        "category": "Sports",
        "tags": "1 Player, 2D, Basketball, running, Sport, Sports",
        "thumb": "https://img.gamemonetize.com/hxgw9ao48gub9cskdmlnfll19u99gsmt/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47973",
        "title": "Womens World Cup 2023",
        "description": "Womens world cup is here and you find yourself in the elimination rounds. Win trophies for your first win, getting to the finals or scoring 20 goals. Of course, the most important one is the world cup trophy. Can you make it to the finals and in it all? Good luck!",
        "instructions": "Mouse click or tap to set direction of your shot again to set and one more time to set curve of your kick When defending click or tap keeper gloves that appear as your opponent is about to kick",
        "url": "https://html5.gamemonetize.com/2xmopvaig70eb5svyq9706xqrkbz4plu/",
        "category": "Sports",
        "tags": "Soccer, Sport, Sports",
        "thumb": "https://img.gamemonetize.com/2xmopvaig70eb5svyq9706xqrkbz4plu/512x384.jpg",
        "width": "960",
        "height": "540"
    },
    {
        "id": "47985",
        "title": "Free Kick Master",
        "description": "A free kick master game where you can feel like a professional football player who has the task of forgetting as many goals as possible. In the game you have to hit the marked goal in the gate and forget as many beautiful goals from different distances as possible. The game has 3 stadiums with different modes such as penalty, free kick, wall and more Come in and try to become a free kick master, have fun!!!",
        "instructions": "How hard you hit the ball and hit the target more money is given with which you can buy different balls in the store You need to control the flight of the ball with the mouse or with your finger if you play on the phone ",
        "url": "https://html5.gamemonetize.com/2cbuiwx2ny4y2l1rpaycme9z6kc23fec/",
        "category": "Sports",
        "tags": "3D, Android, Ball, Boy, Boys, Football, Funny, Mobile, Soccer, Sport, Sports, Unity3D, WebGL",
        "thumb": "https://img.gamemonetize.com/2cbuiwx2ny4y2l1rpaycme9z6kc23fec/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47872",
        "title": "Basketball scorer 3d",
        "description": "all need to do is put the ball in the basket it a bit hard there a 7 levels only and it take a time to finish them all and maybe suffer a little bit to finish the game there things make you fly and others make you faster so you need be careful in the way to the basket",
        "instructions": "W For Move Forward A For Move Left D For Move Right S For Move Backward",
        "url": "https://html5.gamemonetize.com/dcfipfmt588h1xgcap9jckk4qk0z0bcx/",
        "category": "Sports",
        "tags": "1 Player, 3D, Basketball, Sport",
        "thumb": "https://img.gamemonetize.com/dcfipfmt588h1xgcap9jckk4qk0z0bcx/512x384.jpg",
        "width": "1200",
        "height": "800"
    },
    {
        "id": "47860",
        "title": "Skibidi Toilet Moto Bike Racing 2",
        "description": "Skibidi Toilet Moto Bike Racing 2 with a cool bike racing Skibidi Toilet. This sequel is harder than previous game. Toilet vehicle based game with racing modifications for drag bike lovers. In this game, there are several types of toilet that you can play to ride the reckless Skibidi Toilet. Driving a drag toilet racing vehicle is a thrilling experience that is hard to forget. With the Skibidi Toilet Moto Bike Racing game, you will get a large collection of drag toilet racer. Games that you can download for free that have an additional collection of drag bikes make playing the game exciting.",
        "instructions": "arrow key or WASD - to move",
        "url": "https://html5.gamemonetize.com/efm1mpr3r8svpj6jmmxo6sf62vnupcsd/",
        "category": "Sports",
        "tags": "Arcade, Arena, Bike, Boy, buggy, Motorcycle, Race, Simulator, Skibidi, Skibidi Toilet, Skills",
        "thumb": "https://img.gamemonetize.com/efm1mpr3r8svpj6jmmxo6sf62vnupcsd/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47635",
        "title": "Messi New Challenge",
        "description": "Messi makes the move to a new Continent and new challenges await. Participate in the excitement and go through numerous goal scoring and skill testing levels and earn trophies too.",
        "instructions": "Mouse or finger to move player during juggling levels swipe to shoot at targets or goal",
        "url": "https://html5.gamemonetize.com/8m3ox950lsb3vxarbxdfuwlnftq41i3p/",
        "category": "Sports",
        "tags": "Football, Soccer, Sport",
        "thumb": "https://img.gamemonetize.com/8m3ox950lsb3vxarbxdfuwlnftq41i3p/512x384.jpg",
        "width": "500",
        "height": "800"
    },
    {
        "id": "47448",
        "title": "Goal Quest",
        "description": "Experience the fusion of sports and puzzle-solving in this captivating 2D soccer ball game. Break through cube stone obstacles by simply touching them, clearing your path to the goal. But it&rsquo;s not just about scoring; you must also collect three stars scattered throughout each level to unlock new challenges. Navigate intricate mazes, utilize physics, and explore visually stunning environments as you strive to become the ultimate soccer ball champion. Are you ready for an adventure filled with excitement, discovery, and a touch of soccer magic?",
        "instructions": "Desktop Explode Cubes with leftmouse button Mobile Touch the screen and pop whatever you want",
        "url": "https://html5.gamemonetize.com/4gfskfmycte9r79aaz1umeaj9lmyjkvh/",
        "category": "Sports",
        "tags": "1 Player, Brain, Football, Fun, Funny, Puzzle, Soccer, Sport, Sports",
        "thumb": "https://img.gamemonetize.com/4gfskfmycte9r79aaz1umeaj9lmyjkvh/512x384.jpg",
        "width": "1280",
        "height": "720"
    },
    {
        "id": "47154",
        "title": "Crazy BasketBall Machine",
        "description": "Experience the ultimate basketball shooting frenzy in Crazy Basketball Machine! Get ready to test your shooting skills and aim for glory on the court. This action-packed game combines the thrill of basketball with the excitement of precise shooting. Step up to the challenge, shoot hoops, and dominate the game like a true basketball superstar. With stunning visuals and addictive gameplay, Crazy Basketball Machine will keep you hooked as you shoot your way to victory. So grab your basketball and prepare for an adrenaline-fueled shooting extravaganza that will leave you craving for more!",
        "instructions": "Use mouse to play the game or tap the Screen to shoot the Ball ",
        "url": "https://html5.gamemonetize.com/coedq4jfww6cxgkq0l39fchkl6uj3nbf/",
        "category": "Sports",
        "tags": "Baseball, Basketball, Casual, Hypercasual, Shoot, Sport, Sports",
        "thumb": "https://img.gamemonetize.com/coedq4jfww6cxgkq0l39fchkl6uj3nbf/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47548",
        "title": "Slash Dunk",
        "description": "Splash Dunk is a captivating basketball puzzle game where players must strategically cut threads to direct the ball into the goal. With limited cuts and complex thread arrangements, your precision and wit will be put to the test!",
        "instructions": "Mouse click or tap to play",
        "url": "https://html5.gamemonetize.com/r5q7wmk5mdoulxc1pjzpekh8mkcyrsun/",
        "category": "Sports",
        "tags": "Basketball, cut, Fun, Games, HTML5, Kid, Kids, Sport, Sports",
        "thumb": "https://img.gamemonetize.com/r5q7wmk5mdoulxc1pjzpekh8mkcyrsun/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "46991",
        "title": "Pixel Ball League",
        "description": "Outshine your friends and assert your dominance by scoring five goals through precise shots. Embrace the exhilarating thrill of victory and savor the gratifying joy of outplaying your opponents at every turn. Get ready for filled with intense competition and memorable moments. Enjoy the journey!!",
        "instructions": "Keyboard You can move the blue character by pressing the W key You can move the red character by pressing the up arrow key Mobile You can move the characters with the blue and red keys on the screen ",
        "url": "https://html5.gamemonetize.com/ea9sxvc1urr1rzjwj2ue449rcfgn7560/",
        "category": "Sports",
        "tags": "2 Player, Ball, Football, Mobile, Sport",
        "thumb": "https://img.gamemonetize.com/ea9sxvc1urr1rzjwj2ue449rcfgn7560/512x384.jpg",
        "width": "834",
        "height": "548"
    },
    {
        "id": "45937",
        "title": "Hoops &amp; Fruits",
        "description": "Get ready for a slam dunk of fun with Hoops &amp; Fruits, the ultimate basketball puzzle game! Score points by shooting hoops and solving challenging puzzles, all while enjoying a fruity twist. With over 100 levels to play, youll never run out of excitement as you work your way through increasingly difficult challenges. Master the game by perfecting your aim and using power-ups to clear tricky obstacles. Whether youre a basketball fanatic or just looking for a fun and addictive puzzle game, Hoops",
        "instructions": "tap and drag to draw line",
        "url": "https://html5.gamemonetize.com/lq9fckxfx08v52umn29ys5zgg2zopw2p/",
        "category": "Sports",
        "tags": "2D, Adventure, endless, HTML, HTML5, Online",
        "thumb": "https://img.gamemonetize.com/lq9fckxfx08v52umn29ys5zgg2zopw2p/512x384.jpg",
        "width": "1080",
        "height": "1920"
    },
    {
        "id": "47118",
        "title": "Tiny Football Cup",
        "description": "Become a football legend by winning all the tournaments and matches! Unlock all the leagues and play with 28 different teams. Prove to your friends you are the number one football player. Play and Score! Endless 3 Turnaments Local Multiplayer Mode 28 Teams",
        "instructions": "Play matches and tournaments to win in-game currency and diamonds Control your team and get the ball to enemys goal Have fun with friends in the local multiplayer mode ",
        "url": "https://html5.gamemonetize.com/dzitjk45xlzs7cmsqfo6v6vos58y4jc8/",
        "category": "Sports",
        "tags": "2 Player, 2 Player Games, Football",
        "thumb": "https://img.gamemonetize.com/dzitjk45xlzs7cmsqfo6v6vos58y4jc8/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47289",
        "title": "Pocket Tennis",
        "description": "Pocket Tennis is the best tennis game ever! Enjoy thrilling gameplay, beautiful graphics and pack of action! Pick your racket and choose your ball. Get ready to go onto the court in this brand new tennis game! Pocket Tennis is a great addition to the world of mobile sports games. Experience tennis like never before, in this fresh and easy to play tennis game. In Pocket Tennis you will enjoy a casual gameplay experience, while still remaining loyal to the original game. Clash with your opponents and smash hard!",
        "instructions": "For Desktop use Mouse to swipe For Mobile use touch to swipe ",
        "url": "https://html5.gamemonetize.com/z18oyrpxlzo1c47krfwhf4wwx10nqkvw/",
        "category": "Sports",
        "tags": "1 Player, 3D Games, Arcade, Best, Casual, Fun, Games, Hypercasual, Sports, Tennis",
        "thumb": "https://img.gamemonetize.com/z18oyrpxlzo1c47krfwhf4wwx10nqkvw/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47174",
        "title": "Dodgeball 3D",
        "description": "Dodgeball is a water sport game in which you will be able to play various entertaining game modes inside water. You can participate in a match, you can participate in wrestling inside the water against your opponent. You can also participate in a career mode. In wrestling mode, hit your opponent as fast as you can and drop your opponent over the other player. In a soccer game, should score five before your opponent. Join various game modes, customize your player, and have a great time!",
        "instructions": "Player 1 Move W A S D Throw ball F Player 2 Move ARROW KEYS Throw ball K",
        "url": "https://html5.gamemonetize.com/8cdo3xphxujgo4fgz3a910fueet95m4f/",
        "category": "Sports",
        "tags": "2 Player, 2 Player Games, 3D, 3D Games, Ball, Boxing, Pool, Shoot, Shooter",
        "thumb": "https://img.gamemonetize.com/8cdo3xphxujgo4fgz3a910fueet95m4f/512x384.jpg",
        "width": "800",
        "height": "600"
    },
    {
        "id": "47156",
        "title": "Heroes Head Ball",
        "description": "Have you ever seen him play football with his head? yes, its a football game where you score goals with your head. are you up for head football? Score a goal in head soccer with your friend and one of you wins. You have to score the most goals to win. You can play with your friend or you can play with artificial intelligence. All you have to do is choose 1 of 10 characters and start the match.",
        "instructions": " Use Arrow Keys ZX Keys to play in single player mode Use WASD NM AND Arrow Keys Num1 Num2 Keys to play in Two Player mode Mobile Touch Control Avaiable ",
        "url": "https://html5.gamemonetize.com/6p5xuxtae0zoal3wkwdcndjs4vd35wdn/",
        "category": "Sports",
        "tags": "2 Player, 2 Player Games, 2D, Adventure, Android, Arcade, Arena, Ball, Battle, Best, Boy, Boys, Highscore, Soccer",
        "thumb": "https://img.gamemonetize.com/6p5xuxtae0zoal3wkwdcndjs4vd35wdn/512x384.jpg",
        "width": "800",
        "height": "600"
    }
]